{
  "0": {
    "steps": ["How many points did the Lions score in the first quarter?\",","How many points did the Buccaneers score in the first quarter?\",","What is the difference between the points scored by the Lions and the Buccaneers in the first quarter?\""],
    "steps_dict": {
      "1": "How many points did the Lions score in the first quarter?\",",
      "2": "How many points did the Buccaneers score in the first quarter?\",",
      "3": "What is the difference between the points scored by the Lions and the Buccaneers in the first quarter?\""
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "To start the season, the Lions traveled south to Tampa, Florida to take on the Tampa Bay Buccaneers. The Lions scored first in the first quarter with a 23-yard field goal by Jason Hanson. The Buccaneers tied it up with a 38-yard field goal by Connor Barth, then took the lead when Aqib Talib intercepted a pass from Matthew Stafford and ran it in 28 yards. The Lions responded with a 28-yard field goal. In the second quarter, Detroit took the lead with a 36-yard touchdown catch by Calvin Johnson, and later added more points when Tony Scheffler caught an 11-yard TD pass. Tampa Bay responded with a 31-yard field goal just before halftime. The second half was relatively quiet, with each team only scoring one touchdown. First, Detroit's Calvin Johnson caught a 1-yard pass in the third quarter. The game's final points came when Mike Williams of Tampa Bay caught a 5-yard pass.  The Lions won their regular season opener for the first time since 2007\nHow many points did the buccaneers need to tie in the first?",
    "allSubtask": "step1: How many points did the Lions score in the first quarter?\",; step2: How many points did the Buccaneers score in the first quarter?\",; step3: What is the difference between the points scored by the Lions and the Buccaneers in the first quarter?\"",
    "nowSubtask": ["How many points did the Lions score in the first quarter?\",","How many points did the Buccaneers score in the first quarter?\",","What is the difference between the points scored by the Lions and the Buccaneers in the first quarter?\""]
  },
  "1": {
    "steps": ["What was the total number of games played by the Bills before this Week 3 game?","Were there any specific details mentioned about the outcomes of the games in Week 1 and Week 2?","What does the phrase \"trying to snap a two-game skid\" imply about the outcomes of the previous games?"],
    "steps_dict": {
      "1": "What was the total number of games played by the Bills before this Week 3 game?",
      "2": "Were there any specific details mentioned about the outcomes of the games in Week 1 and Week 2?",
      "3": "What does the phrase \"trying to snap a two-game skid\" imply about the outcomes of the previous games?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Trying to snap a two-game skid, the Bills flew to Gillette Stadium for a Week 3 divisional fight with the New England Patriots.  In the first quarter, QB J. P. Losman was immediately injured on the first offensive play of the game.  He would finish the series, but ended up on the bench for the rest of the game.  After New England took the lead with kicker Stephen Gostkowski's 24-yard field goal, rookie QB Trent Edwards played the rest of the game for Buffalo.  The Bills would get their only score of the game as RB Marshawn Lynch got an 8-yard TD run, and a Rian Lindell extra point put the Bills ahead surprisingly 7-3.  However, in the second quarter, the Patriots were able to open up their running game when Bills rookie standout Paul Posluszny was lost due to a broken arm. This left passing lanes open, and for the rest of the game, the Patriots dominated. QB Tom Brady's 8-yard TD pass to TE Benjamin Watson and a 3-yard TD pass to WR Randy Moss made it 17-7 at the half.  In the third quarter, New England continued its conquest with Brady's 4-yard TD pass to WR Jabar Gaffney and RB Sammy Morris' 4-yard TD run.  In the fourth quarter, the Patriots ended the day with Brady and Moss hooking up with each other again on a 45-yard TD pass.\nHow many games had the Bills won before this game?",
    "allSubtask": "step1: What was the total number of games played by the Bills before this Week 3 game?; step2: Were there any specific details mentioned about the outcomes of the games in Week 1 and Week 2?; step3: What does the phrase \"trying to snap a two-game skid\" imply about the outcomes of the previous games?",
    "nowSubtask": ["What was the total number of games played by the Bills before this Week 3 game?","Were there any specific details mentioned about the outcomes of the games in Week 1 and Week 2?","What does the phrase \"trying to snap a two-game skid\" imply about the outcomes of the previous games?"]
  },
  "2": {
    "steps": ["In which year did the Navarrese use the captivity of John II to try to seize power?","In which year was John II taken captive?","Calculate the difference in years between the year John II was taken captive and the year the Navarrese used his captivity to try to seize power."],
    "steps_dict": {
      "1": "In which year did the Navarrese use the captivity of John II to try to seize power?",
      "2": "In which year was John II taken captive?",
      "3": "Calculate the difference in years between the year John II was taken captive and the year the Navarrese used his captivity to try to seize power."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[2,3],[1,3]],
    "problemText": "The French king, John II, had been held captive in England. The Treaty of Brétigny set his ransom at 3 million crowns and allowed for hostages to be held in lieu of John. The hostages included two of his sons, several princes and nobles, four inhabitants of Paris, and two citizens from each of the nineteen principal towns of France. While these hostages were held, John returned to France to try and raise funds to pay the ransom. In 1362 John's son Louis of Anjou, a hostage in English-held Calais, escaped captivity. So, with his stand-in hostage gone, John felt honor-bound to return to captivity in England. The French crown had been at odds with Navarre  since 1354, and in 1363 the Navarrese used the captivity of John II in London and the political weakness of the Dauphin to try to seize power. Although there was no formal treaty, Edward III supported the Navarrese moves, particularly as there was a prospect that he might gain control over the northern and western provinces as a consequence. With this in mind, Edward deliberately slowed the peace negotiations. In 1364, John II died in London, while still in honourable captivity. Charles V succeeded him as king of France. On 7 May 1364, one month after the dauphin's accession and three days before his coronation as Charles V, the Navarrese suffered a crushing defeat at the Battle of Cocherel.\nHow many years before Navarrase used the captivity of John II?",
    "allSubtask": "step1: In which year did the Navarrese use the captivity of John II to try to seize power?; step2: In which year was John II taken captive?; step3: Calculate the difference in years between the year John II was taken captive and the year the Navarrese used his captivity to try to seize power.",
    "nowSubtask": ["In which year did the Navarrese use the captivity of John II to try to seize power?","In which year was John II taken captive?","Calculate the difference in years between the year John II was taken captive and the year the Navarrese used his captivity to try to seize power."]
  },
  "3": {
    "steps": ["What is the total number of people residing in the county?","What is the total number of families residing in the county?","How do you calculate the difference between the total number of people and the total number of families?"],
    "steps_dict": {
      "1": "What is the total number of people residing in the county?",
      "2": "What is the total number of families residing in the county?",
      "3": "How do you calculate the difference between the total number of people and the total number of families?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "As of the census of 2000, there were 218,590 people, 79,667 households, and 60,387 families residing in the county.  The population density was 496 people per square mile (192/km²). There were 83,146 housing units at an average density of 189 per square mile (73/km²). The racial makeup of the county was 86.77% Race (United States Census), 9.27% Race (United States Census), 0.23% Race (United States Census), 1.52% Race (United States Census), 0.06% Race (United States Census), 0.69% from Race (United States Census), and 1.47% from two or more races.  1.91% of the population were Race (United States Census) or Race (United States Census) of any race. 22.5% were of German people, 13.1% Irish people, 9.8% Italian people, 9.2% English, 8.1% \"American\" and 6.0% Polish ancestry.\nHow many more people were there than families?",
    "allSubtask": "step1: What is the total number of people residing in the county?; step2: What is the total number of families residing in the county?; step3: How do you calculate the difference between the total number of people and the total number of families?",
    "nowSubtask": ["What is the total number of people residing in the county?","What is the total number of families residing in the county?","How do you calculate the difference between the total number of people and the total number of families?"]
  },
  "4": {
    "steps": ["What is the definition of a prefecture in the context of the passage?","Identify the specific paragraph or sentence in the passage that mentions the establishment of prefectures due to the rebellion in 1258.","Determine the names and number of the prefectures mentioned in the context of the 1258 rebellion."],
    "steps_dict": {
      "1": "What is the definition of a prefecture in the context of the passage?",
      "2": "Identify the specific paragraph or sentence in the passage that mentions the establishment of prefectures due to the rebellion in 1258.",
      "3": "Determine the names and number of the prefectures mentioned in the context of the 1258 rebellion."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "From 1231, Goryeo was intermittently invaded by the Mongol Empire. During this time, Goryeo was controlled by a military regime led by the Choe family. In 1232 the government under the nominal king fled to Ganghwa Island, which Mongol horse riders were unable to land on, and resisted the Mongol invasion. Unfortunately because of its fragile foundation, Goryeo faced frequent rebellions. The 1258 rebellion resulted in the establishment of Ssangseong  and Dongnyeong Prefectures  by the Mongols. Unlike these rebels, the Sambyeolcho  were an organ of the military government. They were organized by the Choe family to maintain security. However, unlike the Choe private guards unit , the Sambyeolcho assumed public functions performed by police and combat forces, effectively replacing the Six Divisions of the military. In 1258, Choe Ui, the fourth of the Choe family, was overthrown by Kim Jun  using the Sambyeolcho. Kim Jun took a pro-Mongol policy and sent Crown Prince Wang Jeon to the Mongol Empire. At the same time, King Gojong and the crown prince approached the Mongols to restore power from Kim Jun. In 1268, however, Kim Jun was annihilated by the Sambyeolcho under the order of Im Yeon. The next year, Im Yeon's attempt to replace King Wonjong was reversed by the crown prince  with the help from the Mongol force. In 1270, Im Yeon's successor Im Yumu was killed by the pro-Mongol faction using the Sambyeolcho. It marked the end of the military regime.\nHow many Mongol prefectures were established due to the rebellion in 1258?",
    "allSubtask": "step1: What is the definition of a prefecture in the context of the passage?; step2: Identify the specific paragraph or sentence in the passage that mentions the establishment of prefectures due to the rebellion in 1258.; step3: Determine the names and number of the prefectures mentioned in the context of the 1258 rebellion.",
    "nowSubtask": ["What is the definition of a prefecture in the context of the passage?","Identify the specific paragraph or sentence in the passage that mentions the establishment of prefectures due to the rebellion in 1258.","Determine the names and number of the prefectures mentioned in the context of the 1258 rebellion."]
  },
  "5": {
    "steps": ["How many touchdowns did the Jets score in the first half and what are the point values for each touchdown?","Were there any extra points scored after the Jets' touchdowns in the first half?","How many touchdowns did the Chiefs score in the first half and what are the point values for each touchdown?","Were there any extra points scored after the Chiefs' touchdowns in the first half?","Sum the total points scored by the Jets in the first half.","Sum the total points scored by the Chiefs in the first half."],
    "steps_dict": {
      "1": "How many touchdowns did the Jets score in the first half and what are the point values for each touchdown?",
      "2": "Were there any extra points scored after the Jets' touchdowns in the first half?",
      "3": "How many touchdowns did the Chiefs score in the first half and what are the point values for each touchdown?",
      "4": "Were there any extra points scored after the Chiefs' touchdowns in the first half?",
      "5": "Sum the total points scored by the Jets in the first half.",
      "6": "Sum the total points scored by the Chiefs in the first half."
    },
    "depths": {
      "0": ["Step 1","Step 3"],
      "1": ["Step 2","Step 4"],
      "2": ["Step 5","Step 6"]
    },
    "int_edges": [[1,2],[2,5],[3,4],[4,6]],
    "problemText": "Hoping to rebound from their tough overtime road loss to the Raiders, the Jets went home for a Week 8 duel with the Kansas City Chiefs.  In the first quarter, New York took flight as QB Brett Favre completed an 18-yard TD pass to RB Leon Washington.  In the second quarter, the Chiefs tied the game as QB Tyler Thigpen completed a 19-yard TD pass to TE Tony Gonzalez.  The Jets would answer with Washington getting a 60-yard TD run.  Kansas City closed out the half as Thigpen completed an 11-yard TD pass to WR Mark Bradley. In the third quarter, the Chiefs took the lead as kicker Connor Barth nailed a 30-yard field goal, yet New York replied with RB Thomas Jones getting a 1-yard TD run.  In the fourth quarter, Kansas City got the lead again as CB Brandon Flowers returned an interception 91 yards for a touchdown.  Fortunately, the Jets pulled out the win with Favre completing the game-winning 15-yard TD pass to WR Laveranues Coles. During halftime, the Jets celebrated the 40th anniversary of their Super Bowl III championship team.\nHow many points did each team have at halftime?",
    "allSubtask": "step1: How many touchdowns did the Jets score in the first half and what are the point values for each touchdown?; step2: Were there any extra points scored after the Jets' touchdowns in the first half?; step3: How many touchdowns did the Chiefs score in the first half and what are the point values for each touchdown?; step4: Were there any extra points scored after the Chiefs' touchdowns in the first half?; step5: Sum the total points scored by the Jets in the first half.; step6: Sum the total points scored by the Chiefs in the first half.",
    "nowSubtask": ["How many touchdowns did the Jets score in the first half and what are the point values for each touchdown?","Were there any extra points scored after the Jets' touchdowns in the first half?","How many touchdowns did the Chiefs score in the first half and what are the point values for each touchdown?","Were there any extra points scored after the Chiefs' touchdowns in the first half?","Sum the total points scored by the Jets in the first half.","Sum the total points scored by the Chiefs in the first half."]
  },
  "6": {
    "steps": ["Identify who Philip Rivers is mentioned in relation to during the first quarter.","Determine the specific plays that occurred in the first quarter involving Philip Rivers.","Count the number of touchdown passes thrown by Philip Rivers in the first quarter."],
    "steps_dict": {
      "1": "Identify who Philip Rivers is mentioned in relation to during the first quarter.",
      "2": "Determine the specific plays that occurred in the first quarter involving Philip Rivers.",
      "3": "Count the number of touchdown passes thrown by Philip Rivers in the first quarter."
    },
    "depths": {
      "0": ["Step 2"],
      "1": ["Step 1"],
      "2": ["Step 3"]
    },
    "int_edges": [[2,1],[1,3]],
    "problemText": "Coming off their road win over the Redskins, the Chiefs went home, donned their Dallas Texans throwbacks, and played a Week 7 AFL Legacy game with the San Diego Chargers. Kansas City would find themselves trailing in the first quarter as Chargers quarterback Philip Rivers completed a 3-yard touchdown pass to wide receiver Malcom Floyd, followed by a 10-yard touchdown pass to wide receiver Vincent Jackson. San Diego would add onto their lead in the second quarter with a 20-yard and a 39-yard field goal from kicker Nate Kaeding. The Chiefs would get onto the board in the third quarter with quarterback Matt Cassel completing a 7-yard touchdown pass to wide receiver Dwayne Bowe, but the Chargers kept their momentum going with Rivers finding running back Darren Sproles on a 58-yard touchdown pass. In the fourth quarter, San Diego sealed the win with Kaeding's 19-yard field goal and fullback Jacob Hester recovering a blocked punt in the end zone for a touchdown. With the loss, Kansas City went into their bye week at 1-6. Larry Johnson was suspended for two weeks after he made offensive comments about Todd Haley and made offensive comments about homosexuals on Twitter and in public.\nHow many touchdowns did Philip Rivers throw in the first quarter?",
    "allSubtask": "step1: Identify who Philip Rivers is mentioned in relation to during the first quarter.; step2: Determine the specific plays that occurred in the first quarter involving Philip Rivers.; step3: Count the number of touchdown passes thrown by Philip Rivers in the first quarter.",
    "nowSubtask": ["Identify who Philip Rivers is mentioned in relation to during the first quarter.","Determine the specific plays that occurred in the first quarter involving Philip Rivers.","Count the number of touchdown passes thrown by Philip Rivers in the first quarter."]
  },
  "7": {
    "steps": ["What was the final score of the game?","What was New Orleans' score at the end of the game?","What was Tampa Bay's score at the end of the game?","Calculate the difference between New Orleans' score and Tampa Bay's score."],
    "steps_dict": {
      "1": "What was the final score of the game?",
      "2": "What was New Orleans' score at the end of the game?",
      "3": "What was Tampa Bay's score at the end of the game?",
      "4": "Calculate the difference between New Orleans' score and Tampa Bay's score."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 3","Step 2"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[1,2],[2,4],[3,4]],
    "problemText": "Drew Brees threw for 312 yards and two touchdown passes, as New Orleans defeated Tampa Bay 24-17. The Saints jumped out to a 14-0 lead in the second quarter, and led 17-10 at halftime. Tampa Bay made the score 24-17 after Jameis Winston threw a touchdown pass to Adam Humphries with just under 9 minutes left in regulation. Trailing by 7, the Buccaneers got the ball back with 5:22 to go, but went 3-and-out. The Saints were then able to run out the clock to secure the win.\nhow many points did new orleans defeat tampa by?",
    "allSubtask": "step1: What was the final score of the game?; step2: What was New Orleans' score at the end of the game?; step3: What was Tampa Bay's score at the end of the game?; step4: Calculate the difference between New Orleans' score and Tampa Bay's score.",
    "nowSubtask": ["What was the final score of the game?","What was New Orleans' score at the end of the game?","What was Tampa Bay's score at the end of the game?","Calculate the difference between New Orleans' score and Tampa Bay's score."]
  },
  "8": {
    "steps": ["How many points did the Cowboys score in the first half?","How many points did the Jaguars score in the first half?","What is the difference between the Jaguars' and Cowboys' scores at halftime?"],
    "steps_dict": {
      "1": "How many points did the Cowboys score in the first half?",
      "2": "How many points did the Jaguars score in the first half?",
      "3": "What is the difference between the Jaguars' and Cowboys' scores at halftime?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Hoping to break their current losing streak the Cowboys played on home ground for an Interconference duel with the Jaguars. In the first quarter the Cowboys took the lead as kicker David Buehler hit a 34-yard field goal. But they fell behind with QB David Garrard getting a 10-yard TD pass to WR Mike Sims-Walker. In the second quarter, the Cowboys struggled further with Garrard finding TE Marcedes Lewis on a 42-yard TD pass, then in the third quarter he found WR Mike Thomas on a 15-yard TD pass, and then he found Lewis again on a 9-yard TD pass. The Cowboys responded in the 4th quarter with RB Marion Barber getting a 1-yard TD run. But the Jaguars scored again with Garrard scrambling 2 yards to the endzone for a touchdown. The Cowboys replied with QB Jon Kitna making an 8-yard TD pass to TE Jason Witten.\nHow many points were the Cowboy's trailing at halftime?",
    "allSubtask": "step1: How many points did the Cowboys score in the first half?; step2: How many points did the Jaguars score in the first half?; step3: What is the difference between the Jaguars' and Cowboys' scores at halftime?",
    "nowSubtask": ["How many points did the Cowboys score in the first half?","How many points did the Jaguars score in the first half?","What is the difference between the Jaguars' and Cowboys' scores at halftime?"]
  },
  "9": {
    "steps": ["What is the number of yards covered by the touchdown pass to Heath Miller?","What is the number of yards covered by the touchdown pass to Hines Ward?","How do you calculate the difference between two numbers?"],
    "steps_dict": {
      "1": "What is the number of yards covered by the touchdown pass to Heath Miller?",
      "2": "What is the number of yards covered by the touchdown pass to Hines Ward?",
      "3": "How do you calculate the difference between two numbers?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Coming off their road win over the Lions, the Steelers went home for a divisional match with the Cleveland Browns.  After a scoreless first quarter, Pittsburgh came out striking in the second quarter as quarterback Ben Roethlisberger completed an 8-yard touchdown pass to tight end Heath Miller and a 52-yard touchdown pass to wide receiver Hines Ward.  The Browns immediately struck back as wide receiver Joshua Cribbs returned a kickoff 98&#160;yards for a touchdown. Pittsburgh would close out the half with a 32-yard field goal from kicker Jeff Reed. Cleveland tried to catch up as quarterback Derek Anderson completed a 1-yard touchdown pass to fullback Lawrence Vickers, yet the Steelers answered with a 2-yard touchdown run from running back Rashard Mendenhall.  Pittsburgh would then close the game out in the fourth quarter with Reed kicking a 39-yard field goal. With their 12th-straight win over the Browns, the Steelers improved to 4-2.  With the Ravens' loss to the Vikings, and the Bengals' loss to the Texans that same week, the Steelers are now tied with the Bengals at the top of the AFC North.\nHow many is the difference in the yards of the TD pass to Miller and the yards of the TD pass to Ward?",
    "allSubtask": "step1: What is the number of yards covered by the touchdown pass to Heath Miller?; step2: What is the number of yards covered by the touchdown pass to Hines Ward?; step3: How do you calculate the difference between two numbers?",
    "nowSubtask": ["What is the number of yards covered by the touchdown pass to Heath Miller?","What is the number of yards covered by the touchdown pass to Hines Ward?","How do you calculate the difference between two numbers?"]
  },
  "10": {
    "steps": ["What is the starting year of the events described?","What is the ending year of the events described?","How do you calculate the number of years between two given years?"],
    "steps_dict": {
      "1": "What is the starting year of the events described?",
      "2": "What is the ending year of the events described?",
      "3": "How do you calculate the number of years between two given years?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "In 1344, Momchil, the independent Bulgarian ruler of the Rhodope and Aegean regions, whose army grew to 2,000 men, took an important role in the Byzantine civil war. While at first he supported John Kantakouzenos, from the spring of 1344 Momchil reneged, provoked by the aggression of the Ottoman allies. In June he defeated the Ottoman fleet near the Portogalos bay. According to sources, at night the Bulgarian ruler sent boats to burn the anchored Ottoman ships and soon after he defeated the army of Kantakouzenos at Mosynopolis. Probably the first local ruler to become aware of the impending Ottoman threat, Momchil unsuccessfully pleaded with the emperors of Bulgaria and Byzantium for help. Even though his troops continued the resistance in the Eastern Rhodopes, in May 1345 the Turks led by Umur Beg marched from Asia Minor and devastated Bulgarian territories driving away people and livestock. Soon after, on 7 July 1345, Ottoman forces under Umur Beg defeated Momchil's army in the battle of Peritor near his capital Xanthi. Sources attest that the independent ruler perished in the battle without leaving asuccessor, and with little political will or leadership left to counter the Ottoman invasion.\nHow many years span these events?",
    "allSubtask": "step1: What is the starting year of the events described?; step2: What is the ending year of the events described?; step3: How do you calculate the number of years between two given years?",
    "nowSubtask": ["What is the starting year of the events described?","What is the ending year of the events described?","How do you calculate the number of years between two given years?"]
  },
  "11": {
    "steps": ["Identify the points in the game when the Carolina Panthers scored field goals.","Identify the points in the game when the New Orleans Saints scored field goals.","Determine which of these field goals were scored before halftime.","Count the total number of field goals made by both teams before halftime."],
    "steps_dict": {
      "1": "Identify the points in the game when the Carolina Panthers scored field goals.",
      "2": "Identify the points in the game when the New Orleans Saints scored field goals.",
      "3": "Determine which of these field goals were scored before halftime.",
      "4": "Count the total number of field goals made by both teams before halftime."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[3,4],[2,3]],
    "problemText": "Trying to rebound from their divisional home loss to the Buccaneers, the Panthers flew to the Louisiana Superdome for a Week 5 divisional duel with the winless New Orleans Saints. With QB Jake Delhomme out and done for the year with a right elbow injury, QB David Carr was given the start. In the first quarter, Carolina took the early lead with kicker John Kasay getting a 23-yard field goal. The Saints responded with kicker Olindo Mare getting a 25-yard field goal. In the second quarter, the Panthers went back into the lead with Kasay nailing a 35-yard field goal. New Orleans would respond with Mare kicking a 28-yard field goal. In the third quarter, Carolina trailed as Saints FB Mike Karney got a 2-yard TD run for the only score of the period. In the fourth quarter, the Panthers tied the game with Carr completing a 17-yard TD pass to WR Steve Smith. Afterwards, Carolina sealed the win in the final seconds with Kasay nailing a 52-yard field goal as time ran out.\nHow many field goals did both teams kick before halftime?",
    "allSubtask": "step1: Identify the points in the game when the Carolina Panthers scored field goals.; step2: Identify the points in the game when the New Orleans Saints scored field goals.; step3: Determine which of these field goals were scored before halftime.; step4: Count the total number of field goals made by both teams before halftime.",
    "nowSubtask": ["Identify the points in the game when the Carolina Panthers scored field goals.","Identify the points in the game when the New Orleans Saints scored field goals.","Determine which of these field goals were scored before halftime.","Count the total number of field goals made by both teams before halftime."]
  },
  "12": {
    "steps": ["Identify the total number of meetings mentioned at the beginning of the passage.","Confirm if there have been any additional games since the mentioned game or if this is the latest count.","Account for any special games such as playoffs or any other matches that might not be included in regular season counts if not clearly specified."],
    "steps_dict": {
      "1": "Identify the total number of meetings mentioned at the beginning of the passage.",
      "2": "Confirm if there have been any additional games since the mentioned game or if this is the latest count.",
      "3": "Account for any special games such as playoffs or any other matches that might not be included in regular season counts if not clearly specified."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their bye week, the Bears traveled to Lambeau Field to play the Green Bay Packers in the 189th meeting between the two rivals. The Bears had struggled regarding scoring against Green Bay in the last nine games between the two prior to 2013, and including the 2010 NFC title game, had scored 127 points, an average of 14.11 points. The two teams entered with among the top three scoring offenses, with Chicago and Green Bay ranked second and third, respectively, with 30.4 and 30.3 points per game, both of which rank behind the Denver Broncos. Among the weapons of the Packers offense that the Bears must attempt to hinder was the running game, as Green Bay's rookie running back Eddie Lacy has recorded over 100 yards per game in the previous six during the season, along with quarterback Aaron Rodgers. One of Rodgers' skills is passing balls longer than 20 yards, and was 16 of 32 on these attempts, which was tied with Russell Wilson of the Seattle Seahawks for the highest percentage in the league; the Bears allowed 57 percent of opponents to throw for the aforementioned distance, the second-worst score in the NFL. However, both teams ranked in the bottom five in the NFL in pass rush, with the Bears being in last with only nine sacks. For Chicago, Matt Fort&#233; had gained 533 yards along with averaging 4.6 yards per run, while Josh McCown filled in for Jay Cutler. Since 2009, Bears quarterbacks besides Cutler had thrown a combined eight touchdowns and 21 interceptions against the Packers; in McCown's last start in 2011 against the Packers, he threw for 242 yards, a touchdown and two interceptions in a 35-21 losing effort. On the Packers' first drive, Rodgers failed to recognize the Bears' zone defense, having expected a man-to-man defense, and Shea McClellin escaped Don Barclay's block and, along with Isaiah Frey, pulled Rodgers down, who landed on his shoulder and injured his left collarbone, and was replaced by Seneca Wallace for the remainder of the game. Afterwards, Mason Crosby kicked the 30-yard field goal to give the Packers the lead. On Chicago's first drive, McCown escaped pressure from Mike Neal and threw towards Brandon Marshall for the 7-3 lead. Once the Packers got the ball back, Wallace's pass for Jordy Nelson was tipped and intercepted by Julius Peppers, and was returned 14 yards to Green Bay's 45-yard line, but after the Bears failed to convert on third down, Adam Podlesh's punt was blocked by Jamari Lattimore. Eventually, James Starks ran 32 yards for the touchdown. However, the Bears traveled 60 yards on two plays, and Fort&#233; scored on the 1-yard run. The Bears ended the first half with Robbie Gould's 24-yard field goal to expand the lead to 17-10. In the third quarter, the Packers forced the Bears to punt, and Lacy ran 56 yards to the Bears' 1, and scored on the ensuing play. On the eventual kickoff, the Packers successfully attempted a surprise onside kick, which was recovered by Lattimore. Crosby kicked a 23-yarder on the drive. On the Bears' next drive, McCown threw a six-yard pass to Alshon Jeffery, whose size kept the ball from being knocked away by Davon House. After both teams exchanged punts in the fourth quarter, on the Bears' next drive, began attempting to run out the clock. On 4th and 1 at the Bears' 32 with 7:50 remaining, Fort&#233; ran three yards for the conversion and continuing the drive, which ended with Gould's 27-yard field goal. The drive lasted 18 plays and took up 8:58, leaving only 50 seconds remaining in the game. Despite a 15-yard pass by Wallace to Nelson, sacks by Corey Wootton and McClellin ended the game with a 27-20 victory for the Bears. McCown ended the night completing 22 of 41 passes for 272 yards and two touchdowns, while Wallace completed 11 of 19 for 114 yards and an interception. The win marked the first time the Packers lost at home to an NFC North opponent since 2009, and the first win for the Bears at Lambeau Field since 2007.\nHow many times have the Bears played the Packers?",
    "allSubtask": "step1: Identify the total number of meetings mentioned at the beginning of the passage.; step2: Confirm if there have been any additional games since the mentioned game or if this is the latest count.; step3: Account for any special games such as playoffs or any other matches that might not be included in regular season counts if not clearly specified.",
    "nowSubtask": ["Identify the total number of meetings mentioned at the beginning of the passage.","Confirm if there have been any additional games since the mentioned game or if this is the latest count.","Account for any special games such as playoffs or any other matches that might not be included in regular season counts if not clearly specified."]
  },
  "13": {
    "steps": ["What is the total number of points scored by the Seahawks before the Chargers scored any points?","Identify the scoring events for the Seahawks leading up to the Chargers' first score.","Calculate the total points from these specific scoring events for the Seahawks.","Determine the specific timing of when the Chargers first scored in the game."],
    "steps_dict": {
      "1": "What is the total number of points scored by the Seahawks before the Chargers scored any points?",
      "2": "Identify the scoring events for the Seahawks leading up to the Chargers' first score.",
      "3": "Calculate the total points from these specific scoring events for the Seahawks.",
      "4": "Determine the specific timing of when the Chargers first scored in the game."
    },
    "depths": {
      "0": ["Step 4"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 1"]
    },
    "int_edges": [[4,2],[2,3],[3,1]],
    "problemText": "The Seahawks' third game was played at home ground when they played their former division rival, the San Diego Chargers. In the second quarter Seattle took the early lead when kicker Olindo Mare made a 23-yard field goal. Then QB Matt Hasselbeck completed a 9-yard TD pass to TE John Carlson. This was followed in the third quarter by RB Leon Washington returning a kickoff 101 yards to the endzone for a touchdown. The lead was broken down with QB Philip Rivers getting a 3-yard TD pass to WR Malcolm Floyd, followed by Hasselbeck getting sacked by ILB Brandon Siler in the endzone for a safety. Then kicker Nate Kaeding made a 29-yard field goal. The Seahawks increased their lead when Mare made a 23-yard field goal, but the Chargers replied and tied the game when Rivers found TE Antonio Gates on a 12-yard TD pass. (With a successful 2-point conversion as Rivers found WR Legedu Naanee). Before the clock struck zero Seattle took the winning score as RB Leon Washington returned his second kickoff of the game into the endzone running 99 yards for a touchdown. Rivers and the Chargers attempted to make a comeback with less than a minute left, but was picked off by rookie Earl Thomas to seal the win for Seattle.\nHow many point lead did the Seahawks start the game with?",
    "allSubtask": "step1: What is the total number of points scored by the Seahawks before the Chargers scored any points?; step2: Identify the scoring events for the Seahawks leading up to the Chargers' first score.; step3: Calculate the total points from these specific scoring events for the Seahawks.; step4: Determine the specific timing of when the Chargers first scored in the game.",
    "nowSubtask": ["What is the total number of points scored by the Seahawks before the Chargers scored any points?","Identify the scoring events for the Seahawks leading up to the Chargers' first score.","Calculate the total points from these specific scoring events for the Seahawks.","Determine the specific timing of when the Chargers first scored in the game."]
  },
  "14": {
    "steps": ["What was the Lions' record before the game described in the passage?","How did the outcome of the game described in the passage affect the Lions' record?","Identify if the passage mentions any other losses for the Lions during the season."],
    "steps_dict": {
      "1": "What was the Lions' record before the game described in the passage?",
      "2": "How did the outcome of the game described in the passage affect the Lions' record?",
      "3": "Identify if the passage mentions any other losses for the Lions during the season."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "In week 6, the Lions hosted the NFC West Division-leading San Francisco 49ers. The Lions struck first, when Jason Hanson kicked a 25-yard field goal that came after a San Francisco turnover. Detroit added to their lead when Brandon Pettigrew caught a 16-yard TD pass. In the second quarter, the 49ers finally got on the board with a 1-yard TD run by Frank Gore. San Francisco received a safety when Aldon Smith sacked Matthew Stafford in the end zone. The final points of the first half came just before intermission when David Akers of the 49ers kicked a 55-yard field goal, putting the Lions down at halftime for the fourth consecutive week. After the break, Detroit scored on a 24-yard field goal. San Francisco responded with a field goal of their own, this one from 31 yards out. In the fourth quarter, the Lions' Nate Burleson caught a 5-yard TD pass; the Lions went for a 2-point conversion but Calvin Johnson failed to catch Matthew Stafford's pass. In the final 2 minutes, the 49ers rallied from behind, first with a 6-yard TD catch by Delanie Walker, then a 37-yard field goal by David Akers, putting them up 25-19. With 1:02 left in the game, the Lions attempted another comeback, but San Francisco's defense held them off, handing Detroit its first loss of the season as the team fell to 5-1 and 2nd place in the NFC North. After the game, coaches Jim Schwartz and Jim Harbaugh got into an argument after Schwartz claimed Harbaugh pushed him out of the way when the two coaches were shaking hands.\nHow many losses do the Lions have?",
    "allSubtask": "step1: What was the Lions' record before the game described in the passage?; step2: How did the outcome of the game described in the passage affect the Lions' record?; step3: Identify if the passage mentions any other losses for the Lions during the season.",
    "nowSubtask": ["What was the Lions' record before the game described in the passage?","How did the outcome of the game described in the passage affect the Lions' record?","Identify if the passage mentions any other losses for the Lions during the season."]
  },
  "15": {
    "steps": ["What was the Rams' record after their Week 9 game?","How many games had the Rams lost after playing Week 9?","What does the Rams' record imply about their record before Week 9 started?","How many losses did the Rams have before week 9, specifically after week 8?"],
    "steps_dict": {
      "1": "What was the Rams' record after their Week 9 game?",
      "2": "How many games had the Rams lost after playing Week 9?",
      "3": "What does the Rams' record imply about their record before Week 9 started?",
      "4": "How many losses did the Rams have before week 9, specifically after week 8?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "Hoping to rebound from the road loss to the Chargers, the Rams went home for Week 9, as they fought the Kansas City Chiefs in a \"Show Me State Showdown\". The Chiefs struck first as RB Larry Johnson got a 1-yard TD run for the only score of the period.  In the second quarter, things got worse for the Rams as QB Damon Huard completed a 3-yard TD pass to TE Tony Gonzalez, while kicker Lawrence Tynes nailed a 42-yard field goal.  St. Louis got on the board with RB Steven Jackson getting a 2-yard TD run, yet Huard and Gonzalez hooked up with each other again on a 25-yard TD strike.  Rams kicker Jeff Wilkins made a 41-yard field goal to end the half.  In the third quarter, QB Marc Bulger completed a 2-yard TD pass to WR Kevin Curtis for the only score of the period, yet the only score of the fourth quarter came from Huard completing an 11-yard TD pass to TE Kris Wilson. With the loss, the Rams fell to 4-4.\nHow many losses did the Rams have in week 8?",
    "allSubtask": "step1: What was the Rams' record after their Week 9 game?; step2: How many games had the Rams lost after playing Week 9?; step3: What does the Rams' record imply about their record before Week 9 started?; step4: How many losses did the Rams have before week 9, specifically after week 8?",
    "nowSubtask": ["What was the Rams' record after their Week 9 game?","How many games had the Rams lost after playing Week 9?","What does the Rams' record imply about their record before Week 9 started?","How many losses did the Rams have before week 9, specifically after week 8?"]
  },
  "16": {
    "steps": ["How many touchdown passes did Tom Brady throw in the first quarter?","How many touchdown passes did Tom Brady throw in the second quarter?","How many touchdown passes did Tom Brady throw in the third quarter?","How many touchdown passes did Tom Brady throw in the fourth quarter?","Sum the total number of touchdown passes from each quarter to determine Tom Brady's total touchdown passes for the game."],
    "steps_dict": {
      "1": "How many touchdown passes did Tom Brady throw in the first quarter?",
      "2": "How many touchdown passes did Tom Brady throw in the second quarter?",
      "3": "How many touchdown passes did Tom Brady throw in the third quarter?",
      "4": "How many touchdown passes did Tom Brady throw in the fourth quarter?",
      "5": "Sum the total number of touchdown passes from each quarter to determine Tom Brady's total touchdown passes for the game."
    },
    "depths": {
      "0": ["Step 1","Step 3","Step 2","Step 4"],
      "1": ["Step 5"]
    },
    "int_edges": [[1,5],[2,5],[3,5],[4,5]],
    "problemText": "Trying to rebound from back-to-back home losses, the Patriots traveled to Lambeau Field for a Week 11 showdown with the Green Bay Packers.  In the first quarter, Brady hooked up with Graham on a two-yard touchdown pass for the only score of the period.  In the second quarter, Dillon got a one-yard touchdown run, while Brady hooked up with Caldwell on a 54-yard touchdown pass.  Late in the quarter Packers quarterback Brett Favre was sacked by Tedy Bruschi and was knocked out of the game with injury to his right (throwing) wrist.  In the third quarter, Brady threw an eight-yard touchdown pass to Watson for the only score of the period.  In the fourth quarter, New England put the game away with Brady throwing his fourth touchdown pass of the day to Maroney, a 19-yard strike.  With the win, the Patriots improved to 7-3.\nHow many touchdown passes did Tom Brady have in total?",
    "allSubtask": "step1: How many touchdown passes did Tom Brady throw in the first quarter?; step2: How many touchdown passes did Tom Brady throw in the second quarter?; step3: How many touchdown passes did Tom Brady throw in the third quarter?; step4: How many touchdown passes did Tom Brady throw in the fourth quarter?; step5: Sum the total number of touchdown passes from each quarter to determine Tom Brady's total touchdown passes for the game.",
    "nowSubtask": ["How many touchdown passes did Tom Brady throw in the first quarter?","How many touchdown passes did Tom Brady throw in the second quarter?","How many touchdown passes did Tom Brady throw in the third quarter?","How many touchdown passes did Tom Brady throw in the fourth quarter?","Sum the total number of touchdown passes from each quarter to determine Tom Brady's total touchdown passes for the game."]
  },
  "17": {
    "steps": ["What was the initial target number of volunteers desired by the administration?","How many volunteers actually enlisted within the first six weeks?","Subtract the number of actual volunteers from the target number to find the gap."],
    "steps_dict": {
      "1": "What was the initial target number of volunteers desired by the administration?",
      "2": "How many volunteers actually enlisted within the first six weeks?",
      "3": "Subtract the number of actual volunteers from the target number to find the gap."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "In the United States, conscription began in 1917 and was generally well received, with a few pockets of opposition in isolated rural areas. The administration decided to rely primarily on conscription, rather than voluntary enlistment, to raise military manpower for when only 73,000 volunteers enlisted out of the initial 1 million target in the first six weeks of the war. In 1917 10 million men were registered. This was deemed to be inadequate, so age ranges were increased and exemptions reduced, and so by the end of 1918 this increased to 24 million men that were registered with nearly 3 million inducted into the military services. The draft was universal and included blacks on the same terms as whites, although they served in different units. In all 367,710 black Americans were drafted , compared to 2,442,586 white . Forms of resistance ranged from peaceful protest to violent demonstrations and from humble letter-writing campaigns asking for mercy to radical newspapers demanding reform. The most common tactics were dodging and desertion, and many communities sheltered and defended their draft dodgers as political heroes. Many socialists were jailed for \"obstructing the recruitment or enlistment service\". The most famous was Eugene Debs, head of the Socialist Party of America, who ran for president in 1920 from his prison cell. In 1917 a number of radicals and anarchists challenged the new draft law in federal court, arguing that it was a direct violation of the Thirteenth Amendment's prohibition against slavery and involuntary servitude. The Supreme Court unanimously upheld the constitutionality of the draft act in the Selective Draft Law Cases on January 7, 1918.\nHow many people was the gap in the target and the number of volunteers who enlisted?",
    "allSubtask": "step1: What was the initial target number of volunteers desired by the administration?; step2: How many volunteers actually enlisted within the first six weeks?; step3: Subtract the number of actual volunteers from the target number to find the gap.",
    "nowSubtask": ["What was the initial target number of volunteers desired by the administration?","How many volunteers actually enlisted within the first six weeks?","Subtract the number of actual volunteers from the target number to find the gap."]
  },
  "18": {
    "steps": ["Identify the specific timeframe mentioned for the Browns' consecutive season-opening losses.","Confirm the total number of consecutive losses mentioned for season-opening games.","Distinguish between the total games lost since rejoining the league and the specific sequence of consecutive opening losses.","Verify the sequence if it pertains to the most recent games or if it includes any past interruptions in the sequence of losses."],
    "steps_dict": {
      "1": "Identify the specific timeframe mentioned for the Browns' consecutive season-opening losses.",
      "2": "Confirm the total number of consecutive losses mentioned for season-opening games.",
      "3": "Distinguish between the total games lost since rejoining the league and the specific sequence of consecutive opening losses.",
      "4": "Verify the sequence if it pertains to the most recent games or if it includes any past interruptions in the sequence of losses."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[3,4],[2,3]],
    "problemText": "The Browns dropped their 13th consecutive season-opening game with a 21-18 loss to the Steelers. The scoring began early in the first quarter when Pittsburgh's Tyler Matakevich blocked a Britton Colquitt punt, knocking the ball into the end zone where it was recovered by Anthony Chickillo for a touchdown. The Browns were able to tie the score by the end of the first quarter, however, as rookie quarterback DeShone Kizer orchestrated a 12-play drive that ended when he scored on a 1-yard touchdown run. The game stayed at 7-7 through most of the second quarter, until the Steelers quarterback Ben Roethlisberger connected with tight end Jesse James on a 4-yard touchdown with 45 seconds left in the first half. The 7-play, 91-yard scoring drive was highlighted by a 50-yard reception by Antonio Brown on a tipped ball. After a Zane Gonzalez field goal brought the Browns within 14-10 early in the third quarter, the Steelers drove down the field again. Roethlisberger threw a second touchdown pass to James to put them up by 11, 21-10. The drive was boosted by a 41-yard pass interference penalty on Browns cornerback Jamar Taylor on a deep pass intended for Brown. The score remained 21-10 until under four minutes remained in the game, when Kizer was able to throw his first career touchdown pass to Corey Coleman. A two-point conversion run by Isaiah Crowell brought the Browns to within a field goal, 21-18. The Browns did not get a chance to score again, however, as the Steelers were able to run out the clock after a long pass from Roethlisberger to Brown. Browns head coach Hue Jackson challenged the ruling; however, the catch call on the field was upheld. The 13th-straight season-opening loss extended an NFL record for the Browns, who also fell to 1-18 in season openers since returning to the league in 1999.  The team also lost their 12th straight game against a divisional opponent.  The team started 0-1.\nHow many times did the Browns lose opening games in a row?",
    "allSubtask": "step1: Identify the specific timeframe mentioned for the Browns' consecutive season-opening losses.; step2: Confirm the total number of consecutive losses mentioned for season-opening games.; step3: Distinguish between the total games lost since rejoining the league and the specific sequence of consecutive opening losses.; step4: Verify the sequence if it pertains to the most recent games or if it includes any past interruptions in the sequence of losses.",
    "nowSubtask": ["Identify the specific timeframe mentioned for the Browns' consecutive season-opening losses.","Confirm the total number of consecutive losses mentioned for season-opening games.","Distinguish between the total games lost since rejoining the league and the specific sequence of consecutive opening losses.","Verify the sequence if it pertains to the most recent games or if it includes any past interruptions in the sequence of losses."]
  },
  "19": {
    "steps": ["Identify the specific events where Tartars raided southern Muscovy mentioned in the passage.","Determine the number of captives taken during each of these specific raids.","Sum the number of captives taken from all the raids in southern Muscovy to get the total number of captives taken during these events."],
    "steps_dict": {
      "1": "Identify the specific events where Tartars raided southern Muscovy mentioned in the passage.",
      "2": "Determine the number of captives taken during each of these specific raids.",
      "3": "Sum the number of captives taken from all the raids in southern Muscovy to get the total number of captives taken during these events."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "1564: The city of Ryazan posad was burned.:47 1571: Russo-Crimean War 1572: Battle of Molodi 1591: Raid reaches Moscow. :116 1591: Artillery stops a raid at Kolomenskoy on the Bank Line. :52 1592: Suburbs of Moscow burned.  Russian troops were away fighting Sweden.:17 1598: Crimeans stopped by Bank Line, withdraw and sue for peace.:46 1614: Nogai raids within sight of Moscow. During the Time of Troubles so many captives were taken that the price of a slave at Kaffa dropped to fifteen or twenty gold pieces.:66 1618: Nogais release 15,000 captives in peace treaty with Moscow. 1632: Force from Livny ambushed by Tatars and Janissaries. 300 killed and the rest enslaved.:67 1632: 20,000 Tatars raid the south, as troops were shifted north for the Smolensk War.:76 1633: 30,000 Tatars cross Abatis and Bank lines. Thousands were captured from Oka region.:76 This was the last deep raid into Muscovy. :26 1635: Many small war parties invaded Russia south of Ryazan.:79 1637,41-43: Several raids were led by Nogais and Crimean nobles without permission of Khan.:90 1643: 600 Tatars and 200 Zaporozhian Cossacks raid Kozlov. 19 were killed, and 262 were captured.:23 1644: 20,000 The Tatars raid southern Muscovy, 10,000 captives.:91 1645: A raid captures 6,000 captives. It is claimed that the Turks encouraged these raids to obtain galley slaves for a war with Venice.:91\nHow many captives were taken when the Tartars raided southern Muscovy?",
    "allSubtask": "step1: Identify the specific events where Tartars raided southern Muscovy mentioned in the passage.; step2: Determine the number of captives taken during each of these specific raids.; step3: Sum the number of captives taken from all the raids in southern Muscovy to get the total number of captives taken during these events.",
    "nowSubtask": ["Identify the specific events where Tartars raided southern Muscovy mentioned in the passage.","Determine the number of captives taken during each of these specific raids.","Sum the number of captives taken from all the raids in southern Muscovy to get the total number of captives taken during these events."]
  },
  "20": {
    "steps": ["When did the Dutch initially invade the State of Brazil?","When did the Dutch return to Brazil and establish New Holland?","How do we calculate the number of years between two given dates?"],
    "steps_dict": {
      "1": "When did the Dutch initially invade the State of Brazil?",
      "2": "When did the Dutch return to Brazil and establish New Holland?",
      "3": "How do we calculate the number of years between two given dates?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Surprised by such easy gains in the East, the Republic quickly decided to exploit Portugal's weakness in the Americas. In 1621 the Geoctroyeerde Westindische Compagnie  was created to take control of the sugar trade and colonise America . The Company benefited from a large investment in capital, drawing on the enthusiasm of the best financiers and capitalists of the Republic, such as Isaac de Pinto, by origin a Portuguese Jew. The Dutch West India Company would not, however, be as successful as its eastern counterpart. The Dutch invasion began in 1624 with the conquest of the then capital of the State of Brazil, the city of São Salvador da Bahia, but the Dutch conquest was short lived. In 1625, a joint Spanish-Portuguese fleet of 52 ships and 12,000 men rapidly recaptured Salvador. In 1630 the Dutch returned, and captured Olinda and then Recife, renamed Mauritsstadt, thus establishing the colony of New Holland. The Portuguese commander Matias de Albuquerque retreated his forces inland, to establish a camp dubbed Arraial do Bom Jesus. Until 1635, the Dutch were unable to harvest sugar due to Portuguese guerrilla attacks, and were virtually confined to the walled perimeter of the cities. Eventually, the Dutch evicted the Portuguese with the assistance of a local landlord named Domingos Fernandes Calabar, but on his retreat to Bahia, Matias de Albuquerque captured Calabar at Porto Calvo, and had him hang for treason. The Portuguese fought back two Dutch attacks on Bahia in 1638. Nonenetheless, by 1641 the Dutch captured São Luís, leaving them in control of northwestern Brazil between Maranhão and Sergipe in the south\nHow many years between the Dutch invasion in 1624 of the state of Brazil and the return which resulted in the establishment of New Holland?",
    "allSubtask": "step1: When did the Dutch initially invade the State of Brazil?; step2: When did the Dutch return to Brazil and establish New Holland?; step3: How do we calculate the number of years between two given dates?",
    "nowSubtask": ["When did the Dutch initially invade the State of Brazil?","When did the Dutch return to Brazil and establish New Holland?","How do we calculate the number of years between two given dates?"]
  },
  "21": {
    "steps": ["What is the exact date when SCDOT announced the preferred routing of I-73?","What is the exact date when the alternative corridors were formally announced to the public?","How do you calculate the number of days between two specific dates?"],
    "steps_dict": {
      "1": "What is the exact date when SCDOT announced the preferred routing of I-73?",
      "2": "What is the exact date when the alternative corridors were formally announced to the public?",
      "3": "How do you calculate the number of days between two specific dates?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "On May 30, 2006, SCDOT announced its preferred routing of I-73 between Myrtle Beach and Interstate 95 in South Carolina.  I-73 will begin where South Carolina Highway 22 (SC 22) starts at U.S. Route 17 in South Carolina near Briarcliffe Acres, South Carolina. It will then proceed northwest crossing the proposed routing of I-74 (currently South Carolina Highway 31, the Carolina Bays Parkway). After passing Conway, South Carolina, I-73 will leave SC 22 at a new interchange to be constructed  west of U.S. Route 701, and will then use a new highway to be built between SC 22 and South Carolina Highway 917 north of Cool Spring, South Carolina. I-73 will then use an upgraded SC 917 to cross the Little Pee Dee River. It will then proceed on a new freeway alignment between SC 917 and Interstate 95 in South Carolina that would have an interchange with U.S. Route 76 in South Carolina west of Mullins and then would proceed northwest to an exit with U.S. Route 501 near Latta, passing that city to the south before intersecting I-95 near South Carolina Highway 38. After crossing I-95, I-73 will use the chosen middle route, one of six potential alternative corridors that were studied all of which roughly paralleling SC 38 to proceed further north to the North Carolina state line. These alternative corridors were formally announced to the public on September 7, 2006, at a meeting in Bennettsville, South Carolina. The number of possible routes was reduced to three, and a final decision on the preferred northern route was announced on July 19, 2007. The central route caused the least disruption to homes, farms and wetlands. The North Carolina Department of Transportation and South Carolina Department of Transportation Carolina departments of transportation previously agreed to an I-73 corridor crossing the state line along SC  and NC 38 near Hamlet, North Carolina, on February 11, 2005. Previously I-73 had been planned to cross the state line further west, near U.S. Route 1 in North Carolina south of Rockingham, North Carolina.\nHow many days had passed from when SCDOT announced its preferred routing of I-73 between Myrtle Beach and Interstate 95 in South Carolina until alternative corridors were formally announced to the public?",
    "allSubtask": "step1: What is the exact date when SCDOT announced the preferred routing of I-73?; step2: What is the exact date when the alternative corridors were formally announced to the public?; step3: How do you calculate the number of days between two specific dates?",
    "nowSubtask": ["What is the exact date when SCDOT announced the preferred routing of I-73?","What is the exact date when the alternative corridors were formally announced to the public?","How do you calculate the number of days between two specific dates?"]
  },
  "22": {
    "steps": ["estion \"how many yards did Gore score in the first half?\", we need to determine:","","What does it mean by \"yards scored\" in the context of this problem?","Identify the specific instances in the first half where Frank Gore gained yards.","Calculate the total yards from these instances to find out how many yards Gore scored in the first half."],
    "steps_dict": {
      "1": "estion \"how many yards did Gore score in the first half?\", we need to determine:",
      "2": "",
      "3": "What does it mean by \"yards scored\" in the context of this problem?",
      "4": "Identify the specific instances in the first half where Frank Gore gained yards.",
      "5": "Calculate the total yards from these instances to find out how many yards Gore scored in the first half."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "San Francisco kept Detroit in the game with missed opportunities, then made just enough plays for a rare two-game winning streak and its first road win. RB Frank Gore set a franchise record with 148 yards rushing in the first half and scored on a 61-yard run before leaving with a concussion. San Francisco led 13-3 at halftime after scoring on three of its first four drives, wishing it had a bigger lead after out gaining Detroit 247-102 yards and recovering a fumble without giving up a turnover. The 49ers had chances to go ahead big in the third quarter because Detroit had two turnovers on its first three plays, but they came away with only a field goal and a 13-point lead. Gore then caught a 7-yard pass, wobbled off the field and didn't return. QB Alex Smith's fumble midway through the third quarter set up a score that helped the Lions get back in the game. The 49ers drove down the field to set up K Joe Nedney's fourth field goal, a key score because it made Detroit go for a TD instead of kicking a tying field goal late in the game. S Keith Lewis intercepted QB Jon Kitna's pass at the 49ers' 2 with 2&#189; minutes left and San Francisco now 4-5 picked up the one first down it needed to seal the game, winning consecutive games for the second time since 2003. RB Frank Gore finished with career-high 159 yards rushing and San Francisco's QB Alex Smith was 14 of 20 for 136 yards with a fumble. WR Arnaz Battle caught six passes for 55 yards, and converted a third-and-4 on the final drive to allow the 49ers to run out the clock. The 49ers' defense again came up huge, allowing only 273 total offensive yards and forcing 4 turnovers. LB Brandon Moore was yet again the story, leading the team with 9 tackles, 2 sacks and forcing 2 turnovers. With the win, the 49ers advanced to 4-5.\nhow many yards did gore score the first half?",
    "allSubtask": "step1: estion \"how many yards did Gore score in the first half?\", we need to determine:; step2: ; step3: What does it mean by \"yards scored\" in the context of this problem?; step4: Identify the specific instances in the first half where Frank Gore gained yards.; step5: Calculate the total yards from these instances to find out how many yards Gore scored in the first half.",
    "nowSubtask": ["estion \"how many yards did Gore score in the first half?\", we need to determine:","","What does it mean by \"yards scored\" in the context of this problem?","Identify the specific instances in the first half where Frank Gore gained yards.","Calculate the total yards from these instances to find out how many yards Gore scored in the first half."]
  },
  "23": {
    "steps": ["How many total touchdown passes did Stafford throw during the game?","How many of those touchdown passes were caught by Calvin Johnson?","Subtract the number of touchdowns caught by Johnson from the total number of touchdowns thrown by Stafford to find out how many were caught by other players."],
    "steps_dict": {
      "1": "How many total touchdown passes did Stafford throw during the game?",
      "2": "How many of those touchdown passes were caught by Calvin Johnson?",
      "3": "Subtract the number of touchdowns caught by Johnson from the total number of touchdowns thrown by Stafford to find out how many were caught by other players."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Playing in their second straight Thanksgiving game, the Eagles struggled especially on defense, where they were unable to stop the much-hyped Lions offense, led by Matthew Stafford and Calvin Johnson, all game. The worst of it all was how unproven rookie Eric Rowe was tasked with covering wide receiver Calvin Johnson for the majority of the games, leading to Johnson catching 3 touchdowns. Philadelphia's offense was no help, either and frustrations, especially from the team's sideline boiled over. Stafford's five passing touchdowns, including three of them to Johnson was too much for the Eagles to overcome and for the second consecutive time this season, the Eagles gave up 45 points in a game. With the loss, the Eagles drop to 4-7 on the season and 6-1 when playing on Thanksgiving. However, hope was revived for the team when the Giants, who could have moved to a commanding 3 game lead in the NFC East, fell to the Washington Redskins, meaning the Eagles were only down 1 game from the Giants and Redskins.\nHow many TD passes did Stafford throw other than to Jhonson?",
    "allSubtask": "step1: How many total touchdown passes did Stafford throw during the game?; step2: How many of those touchdown passes were caught by Calvin Johnson?; step3: Subtract the number of touchdowns caught by Johnson from the total number of touchdowns thrown by Stafford to find out how many were caught by other players.",
    "nowSubtask": ["How many total touchdown passes did Stafford throw during the game?","How many of those touchdown passes were caught by Calvin Johnson?","Subtract the number of touchdowns caught by Johnson from the total number of touchdowns thrown by Stafford to find out how many were caught by other players."]
  },
  "24": {
    "steps": ["What is the total score for both teams at the end of the third quarter?","What is the final score for both teams at the end of the fourth quarter?","Subtract the total score at the end of the third quarter from the final score to determine if any points were scored in the fourth quarter."],
    "steps_dict": {
      "1": "What is the total score for both teams at the end of the third quarter?",
      "2": "What is the final score for both teams at the end of the fourth quarter?",
      "3": "Subtract the total score at the end of the third quarter from the final score to determine if any points were scored in the fourth quarter."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The Panthers started off their season by making their first return to Levi's Stadium since losing to the Denver Broncos in Super Bowl 50. Late in the first quarter Cam Newton threw a 40-yard touchdown to Russell Sheppard followed by a Graham Gano field goal. The Panthers scored six more points in the second quarter with two field goals. In the third Jonathan Stewart scored a touchdown, followed by another Gano field goal. With 3:14 left to go in the third quarter, Gano made his third field goal of the day making the score 23-0. Robbie Gould's kick with thirteen seconds to go gave the 49ers their first points of the game. Neither the Panthers or 49ers scored in the fourth quarter, resulting in Carolina defeating San Francisco 23-3. They improved to 1-0.\nHow many points were scored in the fourth quarter?",
    "allSubtask": "step1: What is the total score for both teams at the end of the third quarter?; step2: What is the final score for both teams at the end of the fourth quarter?; step3: Subtract the total score at the end of the third quarter from the final score to determine if any points were scored in the fourth quarter.",
    "nowSubtask": ["What is the total score for both teams at the end of the third quarter?","What is the final score for both teams at the end of the fourth quarter?","Subtract the total score at the end of the third quarter from the final score to determine if any points were scored in the fourth quarter."]
  },
  "25": {
    "steps": ["What was the score before the final points were scored by the Raiders?","How many points did the Raiders score in their final scoring play?","What was the final score of the game after the Raiders scored their final points?","Calculate the difference in points between the score before the final Raiders scoring play and the final score of the game."],
    "steps_dict": {
      "1": "What was the score before the final points were scored by the Raiders?",
      "2": "How many points did the Raiders score in their final scoring play?",
      "3": "What was the final score of the game after the Raiders scored their final points?",
      "4": "Calculate the difference in points between the score before the final Raiders scoring play and the final score of the game."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,4],[2,3],[3,4]],
    "problemText": "The Raiders traveled to Baltimore looking to win their third straight road game to open the season for the first time since 2000. The Ravens, undefeated on the season, looked to continue their good start. The Raiders jumped out early, taking a lead on a six-yard touchdown pass to Seth Roberts from Derek Carr. A Baltimore field goal tightened the lead before Carr hit Michael Crabtree for his first of three touchdown scores on the day, and the Raiders took a 14-6 lead to the half as the Raiders defense held the Ravens in check. Baltimore answered in the third quarter, pulling within two on a Joe Flacco one-yard touchdown run. Crabtree again answered for the Raiders on a 13-yard pass from Carr. However, the Raiders defense allowed a 52-yard pass and catch from Flacco to Steve Smith Sr. and the Ravens pulled within two after failing to convert on the two-point conversion. The Raiders lead tightened to 21-19. The Ravens struck again following a fumble by Raiders rookie running back DeAndre Washington and Terrance West scored three-yard touchdown run to take the Ravens first lead of the game 27-21. The Raiders answered, driving down the field before Carr hit Crabtree from 23 yards out. The Raiders took the lead 28-27. As time was running out, the Ravens looked for the game-winning field goal, but the Raiders defense held and the Raiders moved to 3-1 for the first time since 2000. The three-touchdown game marked Crabtree's first career three-touchdown game. Carr finished with four touchdowns on 199 yards passing. The Raiders defense, much maligned on the season, gave up 412 yards, but stopped the Ravens when needed.\nHow many more points did Raiders score at the end?",
    "allSubtask": "step1: What was the score before the final points were scored by the Raiders?; step2: How many points did the Raiders score in their final scoring play?; step3: What was the final score of the game after the Raiders scored their final points?; step4: Calculate the difference in points between the score before the final Raiders scoring play and the final score of the game.",
    "nowSubtask": ["What was the score before the final points were scored by the Raiders?","How many points did the Raiders score in their final scoring play?","What was the final score of the game after the Raiders scored their final points?","Calculate the difference in points between the score before the final Raiders scoring play and the final score of the game."]
  },
  "26": {
    "steps": ["What is the definition of a \"field goal\" in American football?","Identify the segments of the game described in the passage where field goals could have occurred.","Confirm the specific time frame that constitutes the \"first half\" of the game.","Enumerate the occurrences of field goals scored by the Bears in the first half based on the passage."],
    "steps_dict": {
      "1": "What is the definition of a \"field goal\" in American football?",
      "2": "Identify the segments of the game described in the passage where field goals could have occurred.",
      "3": "Confirm the specific time frame that constitutes the \"first half\" of the game.",
      "4": "Enumerate the occurrences of field goals scored by the Bears in the first half based on the passage."
    },
    "depths": {
      "0": ["Step 1","Step 3"],
      "1": ["Step 2"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,2],[2,4],[3,4]],
    "problemText": "Coming off their overtime win over the Broncos, the Bears stayed at home for a Week 13 intraconference duel with the New York Giants. In the first quarter, Chicago struck first with QB Rex Grossman completing a 1-yard TD pass to TE Desmond Clark for the only score of the period. In the second quarter, the Giants got on the board with RB Derrick Ward. Afterwards, the Bears ended the half with kicker Robbie Gould getting a 35-yard and a 46-yard field goal. In the third quarter, Chicago increased its lead with Gould nailing a 41-yard field goal for the only score of the period. However, in the fourth quarter, New York took the lead with QB Eli Manning completing a 6-yard TD pass to WR Amani Toomer, along with RB Reuben Droughns. The Bears did have one final attempt, but it ended with a thud.\nHow many field goals did the Bear's get in the first half?",
    "allSubtask": "step1: What is the definition of a \"field goal\" in American football?; step2: Identify the segments of the game described in the passage where field goals could have occurred.; step3: Confirm the specific time frame that constitutes the \"first half\" of the game.; step4: Enumerate the occurrences of field goals scored by the Bears in the first half based on the passage.",
    "nowSubtask": ["What is the definition of a \"field goal\" in American football?","Identify the segments of the game described in the passage where field goals could have occurred.","Confirm the specific time frame that constitutes the \"first half\" of the game.","Enumerate the occurrences of field goals scored by the Bears in the first half based on the passage."]
  },
  "27": {
    "steps": ["List all the touchdowns scored in the game.","Determine the yardage for each touchdown play mentioned.","Compare the yardage of these touchdowns to find the shortest distance."],
    "steps_dict": {
      "1": "List all the touchdowns scored in the game.",
      "2": "Determine the yardage for each touchdown play mentioned.",
      "3": "Compare the yardage of these touchdowns to find the shortest distance."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their upset road win over the Broncos, the Raiders went home for a Week 13 AFC West rematch with the Kansas City Chiefs. In the first quarter, Oakland struck first as kicker Sebastian Janikowski got a 25-yard field goal. The Chiefs would respond with kicker Connor Barth getting a 38-yard field goal. In the second quarter, Kansas City took the lead as CB Maurice Leggett returned a fumble (who was from a trick play on a field goal attempt) 67 yards for a touchdown. In the third quarter, Oakland responded with RB Justin Fargas getting a 1-yard TD run. In the fourth quarter, the Chiefs replied with RB Larry Johnson getting a 2-yard TD run, along with Barth making a 27-yard field goal. The Raiders tried to come back as Janikowski nailed a 51-yard field goal, but Kansas City's defense was too much to overcome.\nHow many yards was the shortest touchdown scoring play?",
    "allSubtask": "step1: List all the touchdowns scored in the game.; step2: Determine the yardage for each touchdown play mentioned.; step3: Compare the yardage of these touchdowns to find the shortest distance.",
    "nowSubtask": ["List all the touchdowns scored in the game.","Determine the yardage for each touchdown play mentioned.","Compare the yardage of these touchdowns to find the shortest distance."]
  },
  "28": {
    "steps": ["How many points did the Bears score in the first quarter?","How many points did the Jaguars score in the first quarter?","Sum the points scored by both teams to find the total score by the end of the first quarter."],
    "steps_dict": {
      "1": "How many points did the Bears score in the first quarter?",
      "2": "How many points did the Jaguars score in the first quarter?",
      "3": "Sum the points scored by both teams to find the total score by the end of the first quarter."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "In week 5, the Bears recorded the highest margin of victory of the season, defeating the Jacksonville Jaguars 41-3. In the first quarter, the Bears scored first on a Robbie Gould 32-yard field goal, though Jacksonville would respond in the next quarter on Josh Scobee's 31-yard kick. In the second half, the Bears broke the deadlock by kicking another field goal and cornerback Charles Tillman returning a Blaine Gabbert interception 36 yards for a touchdown, breaking former Bears safety Mike Brown's franchise record for the most pick-sixes in a career. Tillman also tied Donnell Woolford for the most interceptions by a cornerback in team history. In the fourth quarter, the Bears scored on Jay Cutler's 10-yard touchdown pass to Alshon Jeffery. Chicago would then extend their lead on Cutler's 24-yard pass to Brandon Marshall to increase the lead to 27-3. Bears linebacker Lance Briggs would then intercept Gabbert and score on a 36-yard return. Briggs and Tillman would become the first pair in league history to return interceptions for touchdowns in consecutive games, and the Bears became the first team in NFL history to return five interceptions for touchdowns in the first five games of a season. The Bears would close out the game with backup running back Armando Allen scoring on a 46-yard touchdown run. The victory improved the team's record to 4-1. The victory is the most lopsided win for the Bears since their 1985 44-0 victory over the Cowboys, and the 38 points scored in the second half are the most since the team scoring 49 second half points in the 1941 win over the Philadelphia Eagles.\nHow many points were scored in total by the end of the first quarter?",
    "allSubtask": "step1: How many points did the Bears score in the first quarter?; step2: How many points did the Jaguars score in the first quarter?; step3: Sum the points scored by both teams to find the total score by the end of the first quarter.",
    "nowSubtask": ["How many points did the Bears score in the first quarter?","How many points did the Jaguars score in the first quarter?","Sum the points scored by both teams to find the total score by the end of the first quarter."]
  },
  "29": {
    "steps": ["What is the total percentage of national agricultural exports from Haryana?","What is the percentage of Basmati rice exports from Haryana as part of the national export?","Calculate the difference in percentage points between the percentage of total agricultural exports and the percentage of Basmati rice exports.","Interpret the result to understand how much more significant Basmati rice exports are compared to the overall agricultural exports in terms of percentage points."],
    "steps_dict": {
      "1": "What is the total percentage of national agricultural exports from Haryana?",
      "2": "What is the percentage of Basmati rice exports from Haryana as part of the national export?",
      "3": "Calculate the difference in percentage points between the percentage of total agricultural exports and the percentage of Basmati rice exports.",
      "4": "Interpret the result to understand how much more significant Basmati rice exports are compared to the overall agricultural exports in terms of percentage points."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[3,4],[2,3]],
    "problemText": "As the largest recipient of investment per capita since 2000 in India, and among one of the wealthiest and most economically developed regions in South Asia, Haryana has the List of Indian states and union territories by GDP per capita per capita income among Indian states and union territories at  against the national average of  for year 2016–17. Haryanas 2017-18 estimated List of Indian states and union territories by GDP of US$95 billion (52% Service economy, 30% Industry and 18% Agriculture in India) is growing at 12.96% 2012-17 compound annual growth rate and placed on the list of Indian states and union territories by GDP behind only much bigger states, is also boosted by 30 special economic zones (mainly along Delhi–Mumbai Industrial Corridor Project, Amritsar Delhi Kolkata Industrial Corridor and Delhi Western Peripheral Expressway in National Capital Region (India)), 7% national agricultural exports, 60% of national Basmati rice export, 67% cars, 60% motorbikes, 50% tractors and 50% refrigerators produced in India. Faridabad has been described as eighth fastest growing city in the world and third most in India by City Mayors Foundation survey. In services, Gurugram ranks number 1 in India in IT growth rate and existing technology infrastructure, and number 2 in startup ecosystem, innovation and livability (Nov 2016).\nHow many more percentage points in India's economy is Basmati rice over their agricultural exports?",
    "allSubtask": "step1: What is the total percentage of national agricultural exports from Haryana?; step2: What is the percentage of Basmati rice exports from Haryana as part of the national export?; step3: Calculate the difference in percentage points between the percentage of total agricultural exports and the percentage of Basmati rice exports.; step4: Interpret the result to understand how much more significant Basmati rice exports are compared to the overall agricultural exports in terms of percentage points.",
    "nowSubtask": ["What is the total percentage of national agricultural exports from Haryana?","What is the percentage of Basmati rice exports from Haryana as part of the national export?","Calculate the difference in percentage points between the percentage of total agricultural exports and the percentage of Basmati rice exports.","Interpret the result to understand how much more significant Basmati rice exports are compared to the overall agricultural exports in terms of percentage points."]
  },
  "30": {
    "steps": ["What is the initial year when the fortifications were completed?","What year were the fortifications levelled by Parliament?","Calculate the difference in years between the year the fortifications were completed and the year they were levelled."],
    "steps_dict": {
      "1": "What is the initial year when the fortifications were completed?",
      "2": "What year were the fortifications levelled by Parliament?",
      "3": "Calculate the difference in years between the year the fortifications were completed and the year they were levelled."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The Lines of Communication were English Civil War fortifications commissioned by Parliament  and built around London between 1642 and 1643 to protect the capital from attack by the Royalist armies of Charles I. In 1642 some basic fortifications were built, in the form of street barricades and small earthworks. In 1643 a major construction effort was made, to provide a comprehensive ring of fortifications around the city. Much of the work was done by volunteer labour, organized by the trained bands and the livery companies. Up to 20,000 people are thought to be involved, and the works were completed in under two months. The fortifications failed their only test when the New Model Army entered London in 1647, and they were levelled by Parliament the same year.\nHow many years after the fortifications were built were they levelled by Parliment?",
    "allSubtask": "step1: What is the initial year when the fortifications were completed?; step2: What year were the fortifications levelled by Parliament?; step3: Calculate the difference in years between the year the fortifications were completed and the year they were levelled.",
    "nowSubtask": ["What is the initial year when the fortifications were completed?","What year were the fortifications levelled by Parliament?","Calculate the difference in years between the year the fortifications were completed and the year they were levelled."]
  },
  "31": {
    "steps": ["List all the field goals made by David Akers in the game.","Note the yardage of each field goal he made.","Compare the yardages to determine which one was the longest."],
    "steps_dict": {
      "1": "List all the field goals made by David Akers in the game.",
      "2": "Note the yardage of each field goal he made.",
      "3": "Compare the yardages to determine which one was the longest."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their divisional road win over the 49ers, the Seahawks went home for a Week 9 duel with the Philadelphia Eagles.  In the first quarter, the 'Hawks immediately took flight as QB Seneca Wallace completed a franchise-long 90-yard TD pass to WR Koren Robinson.  In the second quarter, the Eagles took the lead as QB Donovan McNabb completed a 22-yard TD pass to WR Reggie Brown and a 1-yard TD pass to Todd Herremans. In the third quarter, Philadelphia continued its domination as kicker David Akers got a 39-yard and a 24-yard field goal.  In the fourth quarter, the Eagles flew away as Akers nailed a 42-yard and a 39-yard field goal.\nHow many yards was Akers' longest field goal?",
    "allSubtask": "step1: List all the field goals made by David Akers in the game.; step2: Note the yardage of each field goal he made.; step3: Compare the yardages to determine which one was the longest.",
    "nowSubtask": ["List all the field goals made by David Akers in the game.","Note the yardage of each field goal he made.","Compare the yardages to determine which one was the longest."]
  },
  "32": {
    "steps": ["What was the population of Kabul in the year 1700?","What was the population of Kabul in the year 1878?","How do you calculate the difference in population between two different years?"],
    "steps_dict": {
      "1": "What was the population of Kabul in the year 1700?",
      "2": "What was the population of Kabul in the year 1878?",
      "3": "How do you calculate the difference in population between two different years?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Kabuls population is estimated to have been about 10,000 in 1700, 65,000 by 1878, and 120,000 by 1940. More recently, the population was around 500,000 in 1979, whilst another source claims 337,715 as of 1976. This figure rose to about 1.5 million by 1988, before dramatically dropping in the 1990s. Kabul became one of the fastest growing cities in the world, with its population growing fourfold from 2001 to 2014. This was partly due to the return of refugees after the fall of the Taliban regime, and partly due to Afghans moving from other provinces mainly due to war between Taliban insurgents and Afghan government forces in their native areas as well as looking for labor. This resulting rapid urbanization mean that many residents today live in informal settlements. Shanty mud-brick homes on the mountainsides and steep hills have been built by them and these are usually poverty-stricken, not connected to the water and electricity grid. Although the settlements are illegal, they have been tolerated by authorities. In 2017 Kabul Municipality started a project to paint the homes in these settlements in bright colors in an effort to \"cheer up\" residents.\nHow many more people lived in Kabuls by 1878 compared to 1700?",
    "allSubtask": "step1: What was the population of Kabul in the year 1700?; step2: What was the population of Kabul in the year 1878?; step3: How do you calculate the difference in population between two different years?",
    "nowSubtask": ["What was the population of Kabul in the year 1700?","What was the population of Kabul in the year 1878?","How do you calculate the difference in population between two different years?"]
  },
  "33": {
    "steps": ["Identify each instance in the passage where the Broncos lost possession of the ball either through a fumble, interception, or any other form of turnover.","Count the number of fumbles mentioned in the passage.","Count the number of interceptions mentioned in the passage.","Sum the total numbers from steps 2 and 3 to determine the total number of turnovers by the Broncos."],
    "steps_dict": {
      "1": "Identify each instance in the passage where the Broncos lost possession of the ball either through a fumble, interception, or any other form of turnover.",
      "2": "Count the number of fumbles mentioned in the passage.",
      "3": "Count the number of interceptions mentioned in the passage.",
      "4": "Sum the total numbers from steps 2 and 3 to determine the total number of turnovers by the Broncos."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 3","Step 2"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[1,2],[2,4],[3,4]],
    "problemText": "In their first home game in nearly a month, the Patriots faced the Broncos, winners of 16 of the last 19 games between the two teams, on Monday Night Football; earlier that day, the Patriots placed Maroney on injured reserve with a shoulder injury after he had missed two of the team's last three games, and activated offensive lineman Stephen Neal from the physically unable to perform list. After winning the coin toss, the Patriots deferred their pick to the start of the second half; the Broncos elected to receive. On the opening series, Broncos quarterback Jay Cutler injured his finger on the first play, but led the Broncos into Patriots territory, where running back Andre Hall, who replaced injured starter Michael Pittman two plays prior, fumbled at the Patriots' 30-yard line; Patriots defensive lineman Le Kevin Smith's recovery gave the Patriots the ball at their own 32-yard line to begin their first drive. A 29-yard reception by Watson brought the Patriots into the Broncos' red zone, where the drive ended and a 31-yard Gostkowski field goal gave the Patriots a 3-0 lead. On the fourth play of the Broncos' ensuing drive, Hall fumbled again; this time, a scramble for the ball pushed it 25 yards in the Patriots' favor to the Broncos' 37-yard line, where Mayo recovered it. A Broncos unnecessary roughness penalty on the play gave the ball to the Patriots at the Broncos' 22-yard line, but after failing to make a first down, a 40-yard Gostkowski field goal extended the Patriots' lead to 6-0. An exchange of three punts brought the game into the second quarter, where Morris ran for 34 yards on the second play of a Patriots drive to put them in the Broncos' red zone yet again. Four plays later, on 4th-and-1 from the Broncos' 4-yard line, Morris ran for a 4-yard touchdown that gave the Patriots a 13-0 lead. The Broncos' next drive ended with Meriweather intercepting a deep throw by Cutler, setting up the Patriots' next series at their own 16-yard line. After a sack of Cassel put the Patriots even deeper into their own territory, a facemask penalty on Cassel on third down by Broncos linebacker Jamie Winborn gave the Patriots a new set of downs. Five plays later, on another 4th-and-1, Morris ran for 29 yards to give the Patriots a first down from the Broncos' 13-yard line; he ran for a total of 138 yards on 16 carries. On the next play, Moss caught a 13-yard touchdown pass from Cassel to extend the Patriots' lead to 20-0. The Broncos' next drive began with backup Patrick Ramsey replacing Cutler at quarterback. On the fourth play, defensive lineman Mike Wright sacked Ramsey and forced a fumble, which undrafted free agent linebacker Gary Guyton caught to give the Patriots the ball at midfield. Cassel suffered his fifth sack on the next play, the final of the first half. The Patriots chose to receive the ball to open the second half. Another undrafted rookie, running back BenJarvus Green-Ellis, elevated from the Patriots' practice squad before the Chargers game, replaced Morris, who left the game with a knee injury. A Patriots punt was followed by a Broncos three-and-out; Welker returned the punt 44 yards to give the Patriots the ball at the Broncos' 28-yard line. After two Green-Ellis carries gained one yard, Cassel used a screen play to throw a 27-yard touchdown pass to Moss to extend the Patriots' lead to 27-0. Three completed passes and an unnecessary roughness penalty on Patriots defensive lineman Vince Wilfork moved the Broncos' next drive into Patriots' territory before the Broncos turned the ball over for the fifth and final time, with safety James Sanders intercepting a Cutler pass; a second unnecessary roughness call, originally on Wilfork but later changed to be on Sanders, gave the Patriots the ball at their own 20-yard line to begin the ensuing drive. Three plays after a 27-yard Welker catch put the Patriots in Broncos territory, Broncos safety Calvin Lowry appeared to have intercepted an errant Cassel throw at the Broncos' 1-yard line, but, when the Patriots challenged, the pass was deemed incomplete, as the ball touched the ground before Lowry had possession. Two plays later, Welker caught his first touchdown pass of the season, this one from 6 yards out, to give the Patriots a 34-0 lead. Four plays later, former Patriots tight end Daniel Graham caught a 10-yard touchdown pass from Cutler to cut the Patriots' lead to 34-7. The Patriots' next drive got as far as the Broncos' 33-yard line but eventually ended in a punt. The Broncos, facing 3rd-and-21 on their next drive, had a 21-yard completion by Cutler pushed back by a Broncos holding penalty; Richard Seymour sacked Cutler on the next play, forcing the Broncos to punt on 4th-and-23 with 6:35 left in the game. On the ensuing Patriots drive, two 10-yard runs by Green-Ellis and 16- and 15-yard runs by Faulk put the Patriots in the red zone, where Green-Ellis earned his first NFL touchdown, running in untouched from the 1-yard line, to score the final points of the game. Another Broncos punt gave the Patriots the ball to end the game with a 41-7 victory that took the Patriots' record to 4-2. The Patriots accumulated 257 rushing yards, their largest total since the 1985 season. Cassel, who completed 18 of 24 passes for 185 yards, three touchdowns, and no interceptions, finished with a passer rating of 136.3, one of the ten highest single-game ratings in Patriots history, and was named AFC Offensive Player of the Week for his performance. On the final play of the third quarter, as the Broncos were driving into Patriots territory, Harrison was injured while attempting to tackle Cutler. Harrison, whose 2005 and 2006 seasons were cut short by knee injuries that caused ligament damage, suffered a torn quadriceps muscle in his right leg. Harrison was carted off the field and placed on injured reserve two days later. Safety Antwain Spann was then activated from the practice squad. The Broncos also lost players to injury: Ramsey and linebacker Boss Bailey were also placed on injured reserve, while cornerback Champ Bailey was sidelined for several weeks by a torn groin muscle.\nHow many times did the Broncos turn the ball over?",
    "allSubtask": "step1: Identify each instance in the passage where the Broncos lost possession of the ball either through a fumble, interception, or any other form of turnover.; step2: Count the number of fumbles mentioned in the passage.; step3: Count the number of interceptions mentioned in the passage.; step4: Sum the total numbers from steps 2 and 3 to determine the total number of turnovers by the Broncos.",
    "nowSubtask": ["Identify each instance in the passage where the Broncos lost possession of the ball either through a fumble, interception, or any other form of turnover.","Count the number of fumbles mentioned in the passage.","Count the number of interceptions mentioned in the passage.","Sum the total numbers from steps 2 and 3 to determine the total number of turnovers by the Broncos."]
  },
  "34": {
    "steps": ["What is the exact date when the Kiev Uprising began?","What is the exact date when the Rada declared Ukrainian independence?","How to calculate the number of months between two given dates."],
    "steps_dict": {
      "1": "What is the exact date when the Kiev Uprising began?",
      "2": "What is the exact date when the Rada declared Ukrainian independence?",
      "3": "How to calculate the number of months between two given dates."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "All this led to the October Revolution in Petrograd, which quickly spread all over the empire. The Kiev Uprising in November 1917 led to the defeat of Russian imperial forces in the capital. Soon after, the Central Rada took power in Kiev, while in late December 1917 the Bolsheviks set up a rival Ukrainian republic in the eastern city of Kharkov  - initially also called the \"Ukrainian People's Republic\". Hostilities against the Central Rada government in Kiev began immediately. Under these circumstances, the Rada declared Ukrainian independence on January 22, 1918 and broke ties with Russia. The Rada had a limited armed force at its disposal  and was hard-pressed by the Kharkov government which received men and resources from the Russian SFSR. As a result, the Bolsheviks quickly overran Poltava, Aleksandrovsk , and Yekaterinoslav  by January 1918. Across Ukraine, local Bolsheviks also formed the Odessa and Donetsk-Krivoy Rog Soviet Republics; and in the south Nestor Makhno formed the Free Territory - an anarchist region - then allied his forces with the Bolsheviks. Aided by the earlier Kiev Arsenal Uprising, the Red Guards entered the capital on February 9, 1918. This forced the Central Rada to evacuate to Zhytomyr. In the meantime, the Romanians took over Bessarabia. Most remaining Russian Imperial Army units either allied with the Bolsheviks or joined the Ukrainian People's Army. A notable exception was Colonel Mikhail Drozdovsky, who marched his White Volunteer Army unit across the whole of Novorossiya to the River Don, defeating Makhno's forces in the process.\nHow many months had passed from when the Kiev Uprising began to when Rada declared Ukrainian independence",
    "allSubtask": "step1: What is the exact date when the Kiev Uprising began?; step2: What is the exact date when the Rada declared Ukrainian independence?; step3: How to calculate the number of months between two given dates.",
    "nowSubtask": ["What is the exact date when the Kiev Uprising began?","What is the exact date when the Rada declared Ukrainian independence?","How to calculate the number of months between two given dates."]
  },
  "35": {
    "steps": ["What specific year and month did the British begin blockading French ports?","What date marks the formal declarations of war in the following spring?","Calculate the time difference between the blockading of French ports and the declarations of war.","Convert the calculated time difference into years to determine how many years separated these two events."],
    "steps_dict": {
      "1": "What specific year and month did the British begin blockading French ports?",
      "2": "What date marks the formal declarations of war in the following spring?",
      "3": "Calculate the time difference between the blockading of French ports and the declarations of war.",
      "4": "Convert the calculated time difference into years to determine how many years separated these two events."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[3,4],[2,3]],
    "problemText": "News of the two battles reached England in August. After several months of negotiations, the government of the Duke of Newcastle decided to send an army expedition the following year to dislodge the French. They chose Major General Edward Braddock to lead the expedition. Word of the British military plans leaked to France well before Braddock's departure for North America. In response, King Louis XV dispatched six regiments to New France under the command of Baron Dieskau in 1755. The British sent out their fleet in February 1755, intending to blockade French ports, but the French fleet had already sailed. Admiral Edward Hawke detached a fast squadron to North America in an attempt to intercept them. In a second British action, Admiral Edward Boscawen fired on the French ship Alcide on June 8, 1755, capturing her and two troop ships. The British harassed French shipping throughout 1755, seizing ships and capturing seamen. These actions contributed to the eventual formal declarations of war in spring 1756.\nBetween British blockading of French ports in 1755 and formal declarations of war in the following spring, how many years separated these events?",
    "allSubtask": "step1: What specific year and month did the British begin blockading French ports?; step2: What date marks the formal declarations of war in the following spring?; step3: Calculate the time difference between the blockading of French ports and the declarations of war.; step4: Convert the calculated time difference into years to determine how many years separated these two events.",
    "nowSubtask": ["What specific year and month did the British begin blockading French ports?","What date marks the formal declarations of war in the following spring?","Calculate the time difference between the blockading of French ports and the declarations of war.","Convert the calculated time difference into years to determine how many years separated these two events."]
  },
  "36": {
    "steps": ["What was the length in yards of Nate Byham's touchdown pass?","What was the length in yards of Vincent Jackson's touchdown pass?","How do you calculate the difference in yards between Vincent Jackson's touchdown pass and Nate Byham's touchdown pass?"],
    "steps_dict": {
      "1": "What was the length in yards of Nate Byham's touchdown pass?",
      "2": "What was the length in yards of Vincent Jackson's touchdown pass?",
      "3": "How do you calculate the difference in yards between Vincent Jackson's touchdown pass and Nate Byham's touchdown pass?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The Tampa Bay Buccaneers walked out of Bank of America Stadium with perhaps one of the most impressive comeback wins in their franchise history. Quarterback Josh Freeman threw for 248 yards and 3 touchdowns. Freeman threw 2 interceptions in this game as well. Nate Byham caught a 3-yard pass for a touchdown for the Bucs in the first quarter. Connor Barth scored 2 field goals in this game. Late in the fourth quarter, Vincent Jackson caught a 24-yard pass for a touchdown with 12 seconds left. Jackson caught the two-point conversion to tie the game. Dallas Clark caught a 15-yard pass for a touchdown that won the game for the Buccaneers in overtime. Doug Martin rushed for 138 yards. Martin surpassed 1,000 rushing yards in 10 games as a rookie. Michael Bennett and Da'Quan Bowers each registered a sack. The Tampa Bay defense held Carolina to 97 rushing yards. The Buccaneers swept their division rival Carolina Panthers this season.\nHow many yards longer was Vincent Jackson's touchdown pass compared to Nate Byham's?",
    "allSubtask": "step1: What was the length in yards of Nate Byham's touchdown pass?; step2: What was the length in yards of Vincent Jackson's touchdown pass?; step3: How do you calculate the difference in yards between Vincent Jackson's touchdown pass and Nate Byham's touchdown pass?",
    "nowSubtask": ["What was the length in yards of Nate Byham's touchdown pass?","What was the length in yards of Vincent Jackson's touchdown pass?","How do you calculate the difference in yards between Vincent Jackson's touchdown pass and Nate Byham's touchdown pass?"]
  },
  "37": {
    "steps": ["When did the father and son, Uroš III and Dušan, conclude peace?","What is the date of Uroš III's surrender to Dušan?","Calculate the time interval between the peace conclusion and Uroš III's surrender and convert this time into months."],
    "steps_dict": {
      "1": "When did the father and son, Uroš III and Dušan, conclude peace?",
      "2": "What is the date of Uroš III's surrender to Dušan?",
      "3": "Calculate the time interval between the peace conclusion and Uroš III's surrender and convert this time into months."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Uroš III's decision not to attack the Byzantines after the victory at the Battle of Velbazhd against Bulgaria resulted in the alienation of many nobles, who sought to expand to the south. By January or February 1331, Dušan was quarreling with his father, perhaps pressured by the nobility. According to contemporary pro-Dušan sources, evil advisors turned Uroš III against his son; he decided to seize and exclude Dušan of his inheritance. Uroš III sent an army into Zeta against his son, the army ravaged Skadar, but Dušan had crossed the Bojana. A brief period of anarchy in parts of Serbia took place before the father and son concluded peace in April 1331. Three months later, Uroš III ordered Dušan to meet him. Dušan feared for his life and his advisors persuaded him to resist, so Dušan marched from Skadar to Nerodimlje, where he besieged his father. Uroš III fled, and Dušan captured the treasury and family. He then pursued his father, catching up with him at Petrić. On 21 August 1331, Uroš III surrendered, and on the advice or insistence of Dušan's advisors, he was imprisoned. Dušan was crowned King of All Serbian and Maritime lands in the first week of September. The civil war had prevented Serbia from aiding Ivan Stephen and Anna Neda in Bulgaria, who were deposed in March 1331, taking refuge in the mountains. Ivan Alexander of Bulgaria feared for the danger of Serbia as the situation there had settled, and immediately sought peace with Dušan. As Dušan wanted to move against richer Byzantium, the two made peace and an alliance in December 1331, accepting Ivan Alexander as ruler. It was sealed with the marriage of Dušan and Helena, the sister of Ivan Alexander.\nHow many months after concluding peace did Uroš III surrender?",
    "allSubtask": "step1: When did the father and son, Uroš III and Dušan, conclude peace?; step2: What is the date of Uroš III's surrender to Dušan?; step3: Calculate the time interval between the peace conclusion and Uroš III's surrender and convert this time into months.",
    "nowSubtask": ["When did the father and son, Uroš III and Dušan, conclude peace?","What is the date of Uroš III's surrender to Dušan?","Calculate the time interval between the peace conclusion and Uroš III's surrender and convert this time into months."]
  },
  "38": {
    "steps": ["What parts of the passage directly mention the preparation of localities in colonial Chile for a potential attack?","Identify the specific names of localities mentioned as being made ready for an English attack.","Count how many distinct localities are listed in the passage, excluding the Valdivian Fort System which is mentioned separately as being updated and reinforced."],
    "steps_dict": {
      "1": "What parts of the passage directly mention the preparation of localities in colonial Chile for a potential attack?",
      "2": "Identify the specific names of localities mentioned as being made ready for an English attack.",
      "3": "Count how many distinct localities are listed in the passage, excluding the Valdivian Fort System which is mentioned separately as being updated and reinforced."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "In South America , the Portuguese conquered from Spain most of the Rio Negro valley, and repelled a Spanish attack on Mato Grosso . Between September 1762 and April 1763, Spanish forces led by don Pedro Antonio de Cevallos, Governor of Buenos Aires  undertook a campaign against the Portuguese in Uruguay and South Brazil. The Spaniards conquered the Portuguese territories of Colonia do Sacramento and Rio Grande de São Pedro and forced the Portuguese to surrender and retreat. Under the Treaty of Paris , Spain had to return to Portugal the colony of Sacramento, while the vast and rich territory of the so-called \"Continent of S. Peter\"  would be retaken from the Spanish army during the undeclared Hispano-Portuguese war of 1763-1777. As consequence of the war the Valdivian Fort System, a Spanish defensive complex in southern Chile, was updated and reinforced from 1764 onwards. Other vulnerable localities of colonial Chile such as Chiloé Archipelago, Concepción, Juan Fernández Islands and Valparaíso were also made ready for an eventual English attack.\nHow many other localities of colonial Chile were also made ready for English attack?",
    "allSubtask": "step1: What parts of the passage directly mention the preparation of localities in colonial Chile for a potential attack?; step2: Identify the specific names of localities mentioned as being made ready for an English attack.; step3: Count how many distinct localities are listed in the passage, excluding the Valdivian Fort System which is mentioned separately as being updated and reinforced.",
    "nowSubtask": ["What parts of the passage directly mention the preparation of localities in colonial Chile for a potential attack?","Identify the specific names of localities mentioned as being made ready for an English attack.","Count how many distinct localities are listed in the passage, excluding the Valdivian Fort System which is mentioned separately as being updated and reinforced."]
  },
  "39": {
    "steps": ["What is the definition of \"median age\" as used in the demographics data?","Verify if the question about the average age is looking for the mean age instead of the median age.","Analysis of how ages are distributed among different age groups to understand if mean can be calculated or inferred.","Check if there are any specific weights to apply to each age category based on their population proportions.","Calculate an estimated average age if possible, based on the data provided.","Consider the implications of sex ratio data on average age calculation if necessary."],
    "steps_dict": {
      "1": "What is the definition of \"median age\" as used in the demographics data?",
      "2": "Verify if the question about the average age is looking for the mean age instead of the median age.",
      "3": "Analysis of how ages are distributed among different age groups to understand if mean can be calculated or inferred.",
      "4": "Check if there are any specific weights to apply to each age category based on their population proportions.",
      "5": "Calculate an estimated average age if possible, based on the data provided.",
      "6": "Consider the implications of sex ratio data on average age calculation if necessary."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"],
      "4": ["Step 5"],
      "5": ["Step 6"]
    },
    "int_edges": [[1,2],[2,3],[3,4],[4,5],[5,6]],
    "problemText": "In the county, the population was spread out with 24.90% under the age of 18, 7.20% from 18 to 24, 28.10% from 25 to 44, 23.60% from 45 to 64, and 16.30% who were 65 years of age or older.  The median age was 39 years. For every 100 females there were 97.10 males.  For every 100 females age 18 and over, there were 93.60 males.\nHow many years old was the average person?",
    "allSubtask": "step1: What is the definition of \"median age\" as used in the demographics data?; step2: Verify if the question about the average age is looking for the mean age instead of the median age.; step3: Analysis of how ages are distributed among different age groups to understand if mean can be calculated or inferred.; step4: Check if there are any specific weights to apply to each age category based on their population proportions.; step5: Calculate an estimated average age if possible, based on the data provided.; step6: Consider the implications of sex ratio data on average age calculation if necessary.",
    "nowSubtask": ["What is the definition of \"median age\" as used in the demographics data?","Verify if the question about the average age is looking for the mean age instead of the median age.","Analysis of how ages are distributed among different age groups to understand if mean can be calculated or inferred.","Check if there are any specific weights to apply to each age category based on their population proportions.","Calculate an estimated average age if possible, based on the data provided.","Consider the implications of sex ratio data on average age calculation if necessary."]
  },
  "40": {
    "steps": ["On what date did Mehmed II start bombarding the city walls?","On what date did the siege of the city officially begin?","Calculate the number of days between the start of the bombardment and the beginning of the siege."],
    "steps_dict": {
      "1": "On what date did Mehmed II start bombarding the city walls?",
      "2": "On what date did the siege of the city officially begin?",
      "3": "Calculate the number of days between the start of the bombardment and the beginning of the siege."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Before Hunyadi could assemble his forces, the army of Mehmed II  arrived at Belgrade. The siege began on July 4, 1456. Szilágyi could rely on a force of only 5,000-7,000 men in the castle. Mehmed set up his siege on the neck of the headland and started heavily bombarding the city's walls on June 29. He arrayed his men in three sections: The Rumelian corps had the majority of his 300 cannons, while his fleet of 200 river war vessels had the rest of them. The Rumelians were arrayed on the right wing and the Anatolian corps were arrayed on the left. In the middle were the personal guards of the Sultan, the Janissaries, and his command post. The Anatolian corps and the Janissaries were both heavy infantry troops. Mehmed posted his river vessels mainly to the northwest of the city to patrol the marshes and ensure that the fortress was not reinforced. They also kept an eye on the Sava river to the southwest to avoid the infantry from being outflanked by Hunyadi's army. The zone from the Danube eastwards was guarded by the Sipahi, the Sultan's feudal heavy cavalry corps, to avoid being outflanked on the right.\nHow many days after Mehmed starting bombarding the city walls did the seige begin?",
    "allSubtask": "step1: On what date did Mehmed II start bombarding the city walls?; step2: On what date did the siege of the city officially begin?; step3: Calculate the number of days between the start of the bombardment and the beginning of the siege.",
    "nowSubtask": ["On what date did Mehmed II start bombarding the city walls?","On what date did the siege of the city officially begin?","Calculate the number of days between the start of the bombardment and the beginning of the siege."]
  },
  "41": {
    "steps": ["What are all the field goals mentioned in the passage?","Identify which of these field goals were attempted from a distance exceeding 40 yards.","Count the number of successful attempts from those identified in step 2."],
    "steps_dict": {
      "1": "What are all the field goals mentioned in the passage?",
      "2": "Identify which of these field goals were attempted from a distance exceeding 40 yards.",
      "3": "Count the number of successful attempts from those identified in step 2."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Looking to stay in the playoff hunt, the Raiders welcomed the Dallas Cowboys to Oakland for Sunday Night Football. The Raiders struggled from the outset, allowing the Cowboys to drive inside Raider territory before Sean Smith intercepted a Dak Prescott pass to end the drive. Following a punt by the Raiders, the Cowboys moved right down the field, but were stopped at the Oakland 27 yard line. Settling for a 45-yard field goal, the Cowboys took the lead. The Raiders failed to manage a first down again on their second possession, the Cowboys took over and moved down field again. This time, the Raider defense could not stop the Cowboys and Rod Smith scored on a one-yard run to increase the Cowboy lead to 10-0. The Raider offense did manage two first downs on their next possession, but again were forced to punt. After forcing a Cowboy punt, the Raiders took over with just over three minutes left in the half. The offense came alive as the Raiders moved down to the Cowboy 11 yard line. Derek Carr then hit Jared Cook for an 11 yard touchdown, but Cook was called for pass interference on the play and the touchdown was taken off the board. The Raiders drive stalled and, with three seconds remaining, Giorgio Tavecchio missed a 39-yard field goal as the half expired leaving the score at 10-0. On the opening kickoff of the second half, Cordarrelle Patterson returned the kick 100 yards for a touchdown. However, the return was nullified on a Raider holding call. However, the Raider offense would make up for the mistake as they took the ball 90 yards and Carr found Michael Crabtree on a two-yard pass to narrow the lead to 10-7. On the ensuing Cowboy possession, Sean Smith intercepted Dak Prescott for the second time in the game and returned it 22 yards for a touchdown and Raider lead. Upon review of the play, it was determined that Smith was down by contact at the 22. The Raider offense failed to capitalize on the turnover, only managing one yard and settling for a Tavecchio 39-yard field goal to tie the game at 10. The Raider defense continued its strong play to start the second half by stopping the Cowboys on three plays on the next possession. However, punter Chris Jones took the snap and rushed around the right side of the line for a 24-yard gain and a first down. Nine plays later, Prescott scrambled in from five yards out to retake the lead 17-10. As the fourth quarter began, the Raiders answered as Carr again hit Crabtree from two yards out to cap a 53-yard drive to tie the game at 17. Following punts by both teams, the Cowboys moved to the Raider five-yard line as the two minute warning sounded. However, the Raider defense stiffened and the Cowboys could not get the ball in the end zone. Dan Bailey hit a 19-yard field goal with 1:47 remaining to give the Cowboys a 20-17 lead. Needing a field goal to tie, the Raiders drive stalled at their own 30 yard line with just over one minute remaining. On fourth down, Carr rolled out of the pocket and heaved the ball downfield to Crabtree who could not make the catch. But, the Cowboys were called for pass interference on the play and the Raiders took over on the Dallas 15, well within field goal range. Two plays later, Carr scrambled to the goal line and would have had a first down, but instead attempted to dive to the pylon to score the winning touchdown. Carr, however, lost control of the ball attempting to reach it into the end zone and fumbled it out of the end zone giving the ball to the Cowboys on a touchback. The Cowboys were able to a knee to end the game and secure the 20-17 win. The loss moved the Raiders to 6-8 on the season and eliminated them from the AFC West race. Carr threw for only 171 yards in the game as the offense, as usual, struggled through most of the game. The Raiders committed 14 penalties for 105 yards in the game as their disastrous season all but came to an end.\nHow many field goals were made from a distance of more than 40 yards?",
    "allSubtask": "step1: What are all the field goals mentioned in the passage?; step2: Identify which of these field goals were attempted from a distance exceeding 40 yards.; step3: Count the number of successful attempts from those identified in step 2.",
    "nowSubtask": ["What are all the field goals mentioned in the passage?","Identify which of these field goals were attempted from a distance exceeding 40 yards.","Count the number of successful attempts from those identified in step 2."]
  },
  "42": {
    "steps": ["How many touchdown passes were explicitly mentioned as being received by Steve Breaston in the provided passage?","Are there any additional references to passes caught by Steve Breaston elsewhere in the passage, other than touchdowns?","Summarize the findings to determine the total number of passes caught by Steve Breaston according to the passage."],
    "steps_dict": {
      "1": "How many touchdown passes were explicitly mentioned as being received by Steve Breaston in the provided passage?",
      "2": "Are there any additional references to passes caught by Steve Breaston elsewhere in the passage, other than touchdowns?",
      "3": "Summarize the findings to determine the total number of passes caught by Steve Breaston according to the passage."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Coming off their win over the Browns, the Bears stayed at home for a Week 9 duel with the Arizona Cardinals.  Chicago would trail early in the first quarter as Cardinals quarterback Kurt Warner hooked up with wide receiver Larry Fitzgerald on an 11-yard touchdown pass.  The Bears would answer as quarterback Jay Cutler competed a 33-yard touchdown pass to tight end Greg Olsen, but Arizona came right back as Warner hooked up with tight end Ben Patrick on a 6-yard touchdown pass.  Chicago would find themselves in a huge deficit in the second quarter as Warner completed a 17-yard touchdown pass to Fitzpatrick and a 15-yard touchdown pass to tight end Anthony Becht, followed by kicker Neil Rackers nailing a 43-yard field goal. The Cardinals would add onto their lead as Rackers booted a 30-yard field goal in the third quarter.  The Bears tried to rally in the fourth quarter as Cutler connected with Olsen on a 3-yard and a 20-yard touchdown pass, but Arizona pulled away with Warner completing a 4-yard touchdown pass to wide receiver Steve Breaston.\nHow many passes did Steve Breaston receive?",
    "allSubtask": "step1: How many touchdown passes were explicitly mentioned as being received by Steve Breaston in the provided passage?; step2: Are there any additional references to passes caught by Steve Breaston elsewhere in the passage, other than touchdowns?; step3: Summarize the findings to determine the total number of passes caught by Steve Breaston according to the passage.",
    "nowSubtask": ["How many touchdown passes were explicitly mentioned as being received by Steve Breaston in the provided passage?","Are there any additional references to passes caught by Steve Breaston elsewhere in the passage, other than touchdowns?","Summarize the findings to determine the total number of passes caught by Steve Breaston according to the passage."]
  },
  "43": {
    "steps": ["What defines a turnover in an American football game?","Did the Jaguars commit any turnovers on their offensive downs during the third quarter?","Identify the events classifiable as turnovers that occurred in the third quarter.","Sum the individual turnover events to determine the total number of turnovers by the Jaguars in the third quarter."],
    "steps_dict": {
      "1": "What defines a turnover in an American football game?",
      "2": "Did the Jaguars commit any turnovers on their offensive downs during the third quarter?",
      "3": "Identify the events classifiable as turnovers that occurred in the third quarter.",
      "4": "Sum the individual turnover events to determine the total number of turnovers by the Jaguars in the third quarter."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2","Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,2],[1,3],[3,4]],
    "problemText": "Tampa bay faced in-state rival Jacksonville Jaguars for the fourth time in the regular season. Injured Jacksonville starting quarterback David Garrard was replaced by Quinn Gray, while Jeff Garcia hoped to extend on a 217-consecutive passing streak without an interception. In the first half, Jacksonville's running attack of Fred Taylor, LaBrandon Toefield and Maurice Jones-Drew rushed 15 times in their first 16 plays from scrimmage, and eventually set up a 10-3 lead. In the second quarter, Garcia threw his first interception of the season, which was returned for a Jacksonville score. Tampa Bay quickly responded, however, driving 81 yards in three plays, capped off with Garcia and Joey Galloway connecting for a 58-yard touchdown. A momentum shift appeared to occur near the end of the second quarter, as Tampa Bay forced Jacksonville into a 3-and-out. Inside the two-minute warning, Garcia drove the Buccaneers to the 4-yard line. Garcia scrambled on 3rd & 10, colliding with Reggie Nelson, losing his helmet, but fell one yard short of the first down. Tampa Bay settled for a Matt Bryant field goal, and a 13-17 halftime deficit. Tampa Bay's defense dominated the third quarter, forcing Jacksonville a turnover on downs, a fumble in the end zone (recovered by Gray on 1-yard line), and a blocked punt. The good field position led to Michael Bennett's first touchdown as a Buccaneer. The fourth quarter saw Jacksonville re-take the lead with an 8-yard touchdown pass. Despite two late drives starting with decent field position, Tampa Bay's effort died when Garcia's pass was deflected and intercepted with 19 seconds remaining, his third pick of the game. The loss dropped Tampa Bay to 4-4, second place in the NFC South.\nHow many turnovers did the Jaguars have in the third quarter?",
    "allSubtask": "step1: What defines a turnover in an American football game?; step2: Did the Jaguars commit any turnovers on their offensive downs during the third quarter?; step3: Identify the events classifiable as turnovers that occurred in the third quarter.; step4: Sum the individual turnover events to determine the total number of turnovers by the Jaguars in the third quarter.",
    "nowSubtask": ["What defines a turnover in an American football game?","Did the Jaguars commit any turnovers on their offensive downs during the third quarter?","Identify the events classifiable as turnovers that occurred in the third quarter.","Sum the individual turnover events to determine the total number of turnovers by the Jaguars in the third quarter."]
  },
  "44": {
    "steps": ["Determine the exact date when the Treaty of Fez was signed.","Identify the year when Morocco was declared to be fully pacified.","Calculate the total duration from the signing of the Treaty to the year of full pacification."],
    "steps_dict": {
      "1": "Determine the exact date when the Treaty of Fez was signed.",
      "2": "Identify the year when Morocco was declared to be fully pacified.",
      "3": "Calculate the total duration from the signing of the Treaty to the year of full pacification."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The French conquest of Morocco took place in 1911 in the aftermath of the Agadir Crisis, when Moroccan forces besieged the French-occupied city of Fez. On 30 March 1912, Sultan Abdelhafid signed the Treaty of Fez, formally ceding Moroccan sovereignty to France, transforming Morocco into a protectorate of France. However, many regions remained in revolt until 1934, when Morocco was declared to be pacified, but in several regions French authority was maintained by cooperation with local chiefs and not military strength. On 17 April 1912, Moroccan infantrymen mutinied in the French garrison in Fez. The Moroccans were unable to take the city and were defeated by a French relief force. In late May 1912, Moroccan forces unsuccessfully attacked the enhanced French garrison at Fez. The last aftermath of the conquest of Morocco occurred in 1933-34, the pacification of Morocco took over 22 years.\nHow many years did the regions remain in revolt after the Treaty of Fez?",
    "allSubtask": "step1: Determine the exact date when the Treaty of Fez was signed.; step2: Identify the year when Morocco was declared to be fully pacified.; step3: Calculate the total duration from the signing of the Treaty to the year of full pacification.",
    "nowSubtask": ["Determine the exact date when the Treaty of Fez was signed.","Identify the year when Morocco was declared to be fully pacified.","Calculate the total duration from the signing of the Treaty to the year of full pacification."]
  },
  "45": {
    "steps": ["Did Sam Bradford's passes result in any interceptions by the Bears' defense?","Specifically, identify any pass incidents involving an interception and note details such as the players involved and when they occurred.","Verify if there were other interceptions from different quarterbacks or by the opposing team that need to be counted."],
    "steps_dict": {
      "1": "Did Sam Bradford's passes result in any interceptions by the Bears' defense?",
      "2": "Specifically, identify any pass incidents involving an interception and note details such as the players involved and when they occurred.",
      "3": "Verify if there were other interceptions from different quarterbacks or by the opposing team that need to be counted."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Attempting to bounce back from the Week 2 loss to the Packers, the Bears faced the St. Louis Rams. Throughout the course of the game, the Bears defense sacked Rams quarterback Sam Bradford six times, marking the first time the Bears defense has recorded at least five sacks in back-to-back games since the team's 2001 season. The six sacks increased the Bears season sack total to 14, which led the league, and is the most they have recorded in the first three games since 1987. On the offensive side, however, Jay Cutler completed only 17 of 31 passes for 183 yards and an interception (by Cortland Finnegan; Finnegan appeared to fumble on the return, and the ball was recovered by Bears receiver Devin Hester, but the fumble was overturned), and a mere passer rating of 58.9. With running back Matt Forte out for the game, the Bears rushing attack ran for 103 yards and Michael Bush ran for a 3-yard touchdown. In the second quarter, Rams kicker Greg Zuerlein kicked a 56-yard field goal, the longest in Soldier Field history. In the fourth quarter, Bears cornerback Tim Jennings deflected a Bradford pass intended for Danny Amendola to Major Wright, who returned the interception 45 yards for a touchdown.\nHow many interceptions were there?",
    "allSubtask": "step1: Did Sam Bradford's passes result in any interceptions by the Bears' defense?; step2: Specifically, identify any pass incidents involving an interception and note details such as the players involved and when they occurred.; step3: Verify if there were other interceptions from different quarterbacks or by the opposing team that need to be counted.",
    "nowSubtask": ["Did Sam Bradford's passes result in any interceptions by the Bears' defense?","Specifically, identify any pass incidents involving an interception and note details such as the players involved and when they occurred.","Verify if there were other interceptions from different quarterbacks or by the opposing team that need to be counted."]
  },
  "46": {
    "steps": ["How many passing touchdowns did Donovan McNabb throw in the game?","How many passing touchdowns did Kyle Orton throw in the game?","How many total touchdowns are there when summing up the touchdowns thrown by both quarterbacks?"],
    "steps_dict": {
      "1": "How many passing touchdowns did Donovan McNabb throw in the game?",
      "2": "How many passing touchdowns did Kyle Orton throw in the game?",
      "3": "How many total touchdowns are there when summing up the touchdowns thrown by both quarterbacks?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "NFC East leaders for the second straight week, the 10-4 Eagles remained home for an interconference matchup with the 8-6 Denver Broncos. The Eagles jumped out to an early 10-0 lead in the 1st quarter, recovering from a quick turnover on their first possession. Philadelphia quarterback Donovan McNabb was sacked, losing the ball in the process. The loose ball was picked up by Denver's Darrell Reid. The Philadelphia defense was able to keep the Broncos from turning it into any points, forcing a punt, and scored on their next possession with a 2-yard touchdown pass to DeSean Jackson. Soon after, David Akers' 39 yard field goal pushed the Eagles' lead to 10, closing the first quarter. Denver answered with an 11-yard touchdown pass from quarterback Kyle Orton to wide receiver Jabar Gaffney, capping off a 12 play, 70 yard drive on their very first possession of the second period. Up 10-7, the Eagles immediately responded on the following drive as Donovan McNabb hit his tight end Brent Celek for a 47-yard passing touchdown. The Eagles forced another punt, David Akers added 3 more points on his second field goal of the day, and the Eagles' halftime lead stood at 13. Now down 20-7, the Broncos started the second half strong, forcing another Eagles turnover on the second play of the third quarter. McNabb was intercepted by Champ Bailey, setting up a 33-yard field goal by Matt Prater to reduce the lead to 10. Philadelphia's next possession gave them their largest lead of the game after Donovan McNabb found Jason Avant for his third passing touchdown of the day. Kyle Orton was then intercepted by Asante Samuel, and the Broncos' hopes of a comeback were fading away. However, Denver forced a 3-and-out, scored on another passing touchdown to Jabar Gaffney, and recovered the fumble by Macho Harris on the following kickoff. Orton found Knowshon Moreno for his third passing touchdown of the day, and, within two minutes, the Eagles' 17-point lead was down to 3. In the fourth, Matt Prater succeeded on a 46-yard field goal attempt and the game was tied at 27 with just over 6 minutes to go. After offensive possessions for each team, both ending in punts, the Eagles got the ball back with 1:41 remaining to set up a 28-yard field goal by David Akers, leaving the Broncos with 7 seconds of game time. Time ran out on the ensuing kickoff, and the Eagles held on to win by a score of 30-27. The victory, their sixth consecutive, boosted Philadelphia's record to 11-4, setting up a decisive Week 17 game with the Cowboys for the division title.\nHow many touchdowns did both quarterbacks have?",
    "allSubtask": "step1: How many passing touchdowns did Donovan McNabb throw in the game?; step2: How many passing touchdowns did Kyle Orton throw in the game?; step3: How many total touchdowns are there when summing up the touchdowns thrown by both quarterbacks?",
    "nowSubtask": ["How many passing touchdowns did Donovan McNabb throw in the game?","How many passing touchdowns did Kyle Orton throw in the game?","How many total touchdowns are there when summing up the touchdowns thrown by both quarterbacks?"]
  },
  "47": {
    "steps": ["Identify the final score of the game between the Redskins and the 2007 Detroit Lions.","Determine how many points the Redskins scored in the game.","Determine how many points the Detroit Lions scored in the game.","Subtract the Detroit Lions' score from the Redskins' score to find the difference in points by which the Redskins won the game."],
    "steps_dict": {
      "1": "Identify the final score of the game between the Redskins and the 2007 Detroit Lions.",
      "2": "Determine how many points the Redskins scored in the game.",
      "3": "Determine how many points the Detroit Lions scored in the game.",
      "4": "Subtract the Detroit Lions' score from the Redskins' score to find the difference in points by which the Redskins won the game."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2","Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,2],[1,3],[2,4],[3,4]],
    "problemText": "The Redskins began the 2007 NFL season by \"winning ugly\" starting the season off 2–0. The Redskins kept winning and losing close games, the only exception to this a 34–3 rout of the 2007 Detroit Lions season. The Redskins continued to win ugly and lose ugly to be 5–3 at the halfway mark. However, the Redskins would begin to collapse. The Washington Redskins lost their next three games to fall to 5–6. On Monday, November 26, 2007, Redskins superstar, Sean Taylor was shot by intruders early in the morning in his Miami home. The next morning, Sean Taylor died from severe blood loss. The heartbreak continued for the Washington Redskins, taking a 9–2 halftime lead against the 2007 Buffalo Bills season, and eventually a 16–5 lead. However, the Bills cut the lead to 16–14, and got into position with just 8 seconds remaining to win the game. In an attempt to ice the kicker, head coach Joe Gibbs called timeout. However, he attempted to re-ice him, and called timeout again, which drew an unsportsmanlike conduct penalty, reducing the field goal from 51 yards to 36, and Bills kicker Rian Lindell nailed it with ease. Following the heartbreaking loss, the Redskins attended Sean Taylors funeral two days later, with a game to play on Thursday night against the 2007 Chicago Bears season. The bad news continued, as quarterback Jason Campbell went down for the season with a knee injury. Following this, unlikely hero and backup quarterback Todd Collins (quarterback) led the Redskins to the victory, keeping their playoff hopes alive. Things continued to turn in the right direction behind Collins, who led the Redskins to a 22–10 victory on NBC Sunday Night Football over the 2007 New York Giants season and routs of the 2007 Minnesota Vikings season and rival 2007 Dallas Cowboys season in the final two weeks to propel the Redskins to 9–7 and the final playoff spot in the 2007–08 NFL playoffs.\nHow many points did the Redskins beat the 2007 Detroit Lions by?",
    "allSubtask": "step1: Identify the final score of the game between the Redskins and the 2007 Detroit Lions.; step2: Determine how many points the Redskins scored in the game.; step3: Determine how many points the Detroit Lions scored in the game.; step4: Subtract the Detroit Lions' score from the Redskins' score to find the difference in points by which the Redskins won the game.",
    "nowSubtask": ["Identify the final score of the game between the Redskins and the 2007 Detroit Lions.","Determine how many points the Redskins scored in the game.","Determine how many points the Detroit Lions scored in the game.","Subtract the Detroit Lions' score from the Redskins' score to find the difference in points by which the Redskins won the game."]
  },
  "48": {
    "steps": ["What are all the years listed on the Tym co za Polskość Gdańska monument as per the passage?","Are any years repeated among the listed years on the monument?","Count the number of unique years mentioned on the monument."],
    "steps_dict": {
      "1": "What are all the years listed on the Tym co za Polskość Gdańska monument as per the passage?",
      "2": "Are any years repeated among the listed years on the monument?",
      "3": "Count the number of unique years mentioned on the monument."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "When the area was disputed between Weimar Germany and the Second Polish Republic, the Poles recalled the massacre quoting the number of 10,000 murdered. After Nazi Germany had annexed the Free City of Danzig in World War II, the exiled Polish government in releases said that the knights had \"massacre ten thousand souls\", portrayed the contemporary Germans in the tradition of these events and linked these events with National Socialism. In 1969 the post-war Polish city authorities dedicated a monument that commemorates the massacre of the population of Gdańsk in 1308. Its stated aim was to propagate an analogy of the events of 1308 and the German crimes of World War II. On the monument, called Tym co za Polskość Gdańska , the dates 1308, 1454, 1466 and 1939 are mentioned, relating the events of 1308 to the Thirteen Years' War and World War II.\nHow many different years are mentioned on the Tym co za Polskość Gdańska monument?",
    "allSubtask": "step1: What are all the years listed on the Tym co za Polskość Gdańska monument as per the passage?; step2: Are any years repeated among the listed years on the monument?; step3: Count the number of unique years mentioned on the monument.",
    "nowSubtask": ["What are all the years listed on the Tym co za Polskość Gdańska monument as per the passage?","Are any years repeated among the listed years on the monument?","Count the number of unique years mentioned on the monument."]
  },
  "49": {
    "steps": ["How many points did the Denver Broncos score in the first half?","How many points did the Jacksonville Jaguars score in the first half?","What is the difference between the points scored by the Broncos and the Jaguars in the first half?"],
    "steps_dict": {
      "1": "How many points did the Denver Broncos score in the first half?",
      "2": "How many points did the Jacksonville Jaguars score in the first half?",
      "3": "What is the difference between the points scored by the Broncos and the Jaguars in the first half?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "For the second time this season, backup quarterback Paxton Lynch started in place of Trevor Siemian, who missed the game due to a sprained foot. Following a scoreless first quarter, a 47-yard field goal by placekicker Jason Myers gave the Jaguars the brief lead. The Broncos then reeled off 17 unanswered points, with a 6-yard touchdown run by running back Devontae Booker and a 32-yard field goal by placekicker Brandon McManus just before halftime. Then, in the third quarter, cornerback Bradley Roby returned an interception off quarterback Blake Bortles 51 yards for a touchdown. The Jaguars narrowed the Broncos' lead to 17-10 early in the fourth quarter, when Bortles ran for a 22-yard touchdown. Following an exchange of punts throughout the majority of the fourth quarter, the Jaguars were attempting a rally just after the two-minute warning, when Broncos' linebacker Shane Ray forced a strip sack and fumble recovery off Bortles in Jaguars' territory. Four plays later, McManus added a 41-yard field goal with only 33 seconds remaining to put the game out of reach.\nHow many points did Denver lead by at halftime?",
    "allSubtask": "step1: How many points did the Denver Broncos score in the first half?; step2: How many points did the Jacksonville Jaguars score in the first half?; step3: What is the difference between the points scored by the Broncos and the Jaguars in the first half?",
    "nowSubtask": ["How many points did the Denver Broncos score in the first half?","How many points did the Jacksonville Jaguars score in the first half?","What is the difference between the points scored by the Broncos and the Jaguars in the first half?"]
  },
  "50": {
    "steps": ["Who was in first place in the NFC North during that period?","What was the record of the first-place team (Detroit Lions) at that time?","What was the Bears' record at the same time?","How do you calculate the number of games behind one team is from another in the standings?"],
    "steps_dict": {
      "1": "Who was in first place in the NFC North during that period?",
      "2": "What was the record of the first-place team (Detroit Lions) at that time?",
      "3": "What was the Bears' record at the same time?",
      "4": "How do you calculate the number of games behind one team is from another in the standings?"
    },
    "depths": {
      "0": ["Step 1","Step 3"],
      "1": ["Step 2"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,2],[2,4],[3,4]],
    "problemText": "The Bears entered the bye week with a 3-5 record, tied with the Vikings for last in the NFC North, two games behind the Packers, and four behind the Detroit Lions. The last time the Bears had been 3-5, yet made the playoffs was in 1979, and had also performed the feat in 1977, while the last time that Chicago had made the playoffs after having a record of two games below .500 occurred in 2005, when the team was 1-3, but finished the regular season 11-5. On offense, the Bears were tied for seventh in the league in passes per game with 37.4 and 27th in rushing attempts per game with 23.5. The offense had also regressed in points scored per game; in 2013, the team averaged 27.8 points, while after eight games in 2014, had scored only 22.4, despite having all 11 starters from 2013 returning. In their first three games, the Bears had a +4 turnover margin with eight turnovers forced and four turnovers allowed, but in their last five games, the margin was -7 with four takeaways and 11 giveaways, including -5 in the previous two games with no forced turnovers and five allowed turnovers; this marked the first time that the Bears had failed to force a turnover in consecutive games since 2010. Despite these struggles, the Bears' offense had the league's fifth-best red zone scoring percentage with 88.5.\nHow many games behind first place in the division were the Bears?",
    "allSubtask": "step1: Who was in first place in the NFC North during that period?; step2: What was the record of the first-place team (Detroit Lions) at that time?; step3: What was the Bears' record at the same time?; step4: How do you calculate the number of games behind one team is from another in the standings?",
    "nowSubtask": ["Who was in first place in the NFC North during that period?","What was the record of the first-place team (Detroit Lions) at that time?","What was the Bears' record at the same time?","How do you calculate the number of games behind one team is from another in the standings?"]
  },
  "51": {
    "steps": ["What was the score for the Patriots at halftime?","What was the score for the Ravens at halftime?","Calculate the difference between the Patriots' and Ravens' scores at halftime."],
    "steps_dict": {
      "1": "What was the score for the Patriots at halftime?",
      "2": "What was the score for the Ravens at halftime?",
      "3": "Calculate the difference between the Patriots' and Ravens' scores at halftime."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Coming off their win over the Falcons, the Patriots stayed at home for a Week 4 matchup against the Baltimore Ravens. The opening kickoff was fumbled by Ravens returner Chris Carr and recovered by McGowan at the Ravens' 12-yard line. However, the Patriots could not capitalize on the field position, settling for a 32-yard Gostkowski field goal to give them an early 3-0 lead. The Ravens began their first drive from their own 19-yard line and advanced on a 15-play drive, capping it with a 20-yard touchdown pass from quarterback Joe Flacco to wide receiver Derrick Mason. The Patriots responded with a 14-play drive of their own, going 76 yards before Brady scored on a 1-yard quarterback sneak to re-establish a Patriots lead at 10-7. The Ravens reached midfield on their next drive with a 22-yard reception by tight end Todd Heap, but the drive stalled at the Patriots' 38-yard line, setting up a punt by Sam Koch that gave the Patriots the ball at their own 9-yard line. Similarly, the Patriots reached Ravens' territory before having to punt; Hanson's punt landed in the end zone for a touchback. On the second play of the Ravens' ensuing drive, left tackle Jared Gaither injured his head falling into Flacco during a block; while he had motion in his extremities, the game was stopped for 15 minutes as Gaither was loaded onto a stretcher and taken to the hospital for tests. The Ravens' drive finished as a three-and-out. The Patriots then went 63 yards on six plays, extending their lead to 17-7 on a 12-yard touchdown run by Morris. With just under four minutes remaining in the half, the Ravens mounted a drive that reached the Patriots' 17-yard line with 1:17 left; Flacco was intercepted by Bodden to prevent the Ravens from scoring again before halftime. The Patriots first drive of the second half was aided by a 15-yard unsportsmanlike penalty on the Ravens' bench, but the Patriots were unable to capitalize as a Matt Light holding penalty and a Jarret Johnson sack of Brady forced a punt. Starting from their own 16-yard line, the Ravens advanced to their 45-yard line before a Wright sack of Flacco set up another punt. Kevin Faulk fielded the return but fumbled; Bodden recovered the fumble for the Patriots at their own 14-yard line. On the next play, Brady dropped back and was strip-sacked from his blind side by Terrell Suggs; defensive lineman Dwan Edwards recovered the fumble for the Ravens in the end zone for a touchdown, cutting the Patriots' lead to 17-14. Brady quickly recovered, hitting passes to Taylor for 13 yards, Aiken for 26 yards, and Moss for 20 yards to put the Patriots in the Ravens' red zone. Three plays later, Brady and Moss connected for their first touchdown of the season; the 14-yard strike extended the Patriots' lead to 24-14. The Ravens had similar success on his next drive, with Flacco hitting Mark Clayton on a 13-yard catch, Mason on a 20-yard catch, and then running back Ray Rice breaking a 50-yard rush to put the Ravens well into Patriots territory. A few plays later, Flacco kept pace with Brady on a 13-yard touchdown pass to running back Willis McGahee to cut the Patriots' lead to 24-21. The Patriots would control the ball for the next seven minutes, reaching the Ravens' 9-yard line on a second down. After two incomplete passes, the Patriots lined up in a field goal formation but the holder, Hanson, took a quick snap and passed to Baker, who had motioned outside of the formation. Baker was tackled around the first down marker, but was called for an illegal motion on the play. The Ravens challenged the ruling of a catch and the first down spot, as they would have declined the penalty if Baker had been short. The ruling was upheld and the Patriots took a 27-21 lead on a 33-yard Gostkowski field goal. After an exchange of three-and-outs, the Ravens mounted a drive with 3:32 left, reaching the Patriots' red zone with under a minute remaining. On third and fourth down, Flacco's passes fell incomplete to Mason and Clayton, ending the Ravens' hopes of a comeback. Brady then kneeled to hand the Ravens their first loss of the season and better the Patriots' record to 3-1.\nHow many points were the Ravens trailing by at half time?",
    "allSubtask": "step1: What was the score for the Patriots at halftime?; step2: What was the score for the Ravens at halftime?; step3: Calculate the difference between the Patriots' and Ravens' scores at halftime.",
    "nowSubtask": ["What was the score for the Patriots at halftime?","What was the score for the Ravens at halftime?","Calculate the difference between the Patriots' and Ravens' scores at halftime."]
  },
  "52": {
    "steps": ["What year did the Lithuanian Civil War begin?","What year did the Lithuanian Civil War end?","Calculate the total duration of the war by subtracting the starting year from the ending year."],
    "steps_dict": {
      "1": "What year did the Lithuanian Civil War begin?",
      "2": "What year did the Lithuanian Civil War end?",
      "3": "Calculate the total duration of the war by subtracting the starting year from the ending year."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The Lithuanian Civil War of 1432-1438 was a conflict over the succession to the throne of the Grand Duchy of Lithuania, after Vytautas the Great died in 1430 without leaving an heir.  The war was fought on the one side by Švitrigaila, allied with the Teutonic Knights, and on the other by Sigismund Kęstutaitis, backed by the Kingdom of Poland. The war threatened to sever the Union of Krewo, the personal union between Poland and Lithuania. Švitrigaila's alliance with the Grand Master of the Teutonic Order, Paul von Rusdorf, launched the Polish-Teutonic War  but failed to secure victory for Švitrigaila. When Sigismund captured power in Lithuania by staging a coup in 1432, Lithuania split into two opposing camps, and there began three years of devastating hostilities. To prevent the Knights from continuing their support of Švitrigaila, Poland backed a Hussite invasion of Prussia in 1433. The war ended in a decisive defeat for Švitrigaila and his ally, the Livonian branch of the Teutonic Knights, at the Battle of Pabaiskas in September 1435. Švitrigaila eventually surrendered in 1437; Sigismund Kęstutaitis ruled Lithuania for only eight years before he was assassinated in 1440.\nHow many years did the Lithuanian Civil War last?",
    "allSubtask": "step1: What year did the Lithuanian Civil War begin?; step2: What year did the Lithuanian Civil War end?; step3: Calculate the total duration of the war by subtracting the starting year from the ending year.",
    "nowSubtask": ["What year did the Lithuanian Civil War begin?","What year did the Lithuanian Civil War end?","Calculate the total duration of the war by subtracting the starting year from the ending year."]
  },
  "53": {
    "steps": ["What was the length in yards of Forte's touchdown run in the first quarter?","What was the length in yards of Forte's touchdown run in the second quarter?","How do you calculate the difference in yards between the two touchdown runs from Forte in the first and second quarters?"],
    "steps_dict": {
      "1": "What was the length in yards of Forte's touchdown run in the first quarter?",
      "2": "What was the length in yards of Forte's touchdown run in the second quarter?",
      "3": "How do you calculate the difference in yards between the two touchdown runs from Forte in the first and second quarters?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Trying to snap a four-game losing streak, the Rams went home for a Week 12 duel with the Chicago Bears. In the first quarter, St. Louis trailed early as Bears RB Matt Forte got a 13-yard TD run, while QB Kyle Orton completed a 7-yard TD pass to FB Jason McKie. In the second quarter, the Rams' struggles continued as Fort&#233; got a 47-yard TD run.  St. Louis would respond with kicker Josh Brown getting a 43-yard field goal. Chicago would close out the half with Gould making a 43-yard field goal. In the third quarter, the Bears pulled away with Gould nailing a 38-yard field goal. From there on out, Chicago's defense stiffened for the win.\nHow many more yards was Fortes TD run in the second quarter compared to the one he made in the first quarter",
    "allSubtask": "step1: What was the length in yards of Forte's touchdown run in the first quarter?; step2: What was the length in yards of Forte's touchdown run in the second quarter?; step3: How do you calculate the difference in yards between the two touchdown runs from Forte in the first and second quarters?",
    "nowSubtask": ["What was the length in yards of Forte's touchdown run in the first quarter?","What was the length in yards of Forte's touchdown run in the second quarter?","How do you calculate the difference in yards between the two touchdown runs from Forte in the first and second quarters?"]
  },
  "54": {
    "steps": ["Determine how many field goals were attempted by each team.","Find out the number of field goals each team successfully scored.","Subtract the number of successful field goals from the total attempts to calculate how many were missed by each team.","Sum the missed field goals from both teams to get the total number of missed field goals during the game."],
    "steps_dict": {
      "1": "Determine how many field goals were attempted by each team.",
      "2": "Find out the number of field goals each team successfully scored.",
      "3": "Subtract the number of successful field goals from the total attempts to calculate how many were missed by each team.",
      "4": "Sum the missed field goals from both teams to get the total number of missed field goals during the game."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[3,4],[2,3]],
    "problemText": "After a close win against the Falcons, the Steelers returned home for a game against the Chiefs.  They were facing a WIN AND IN scenario for the playoffs.  They would score first in the first quarter when Shaun Suisham kicked a 23-yard field goal for a 3-0 lead.  The Chiefs managed to tie it up later on in the quarter when Cairo Santos nailed a 35-yard field goal for a 3-3 game.  The Chiefs took the lead in the 2nd quarter when Santos kicked a 25-yard field goal for a 6-3 game.  The Steelers later on in the quarter retook the lead as Le'Veon Bell ran for a 1-yard TD for a halftime score of 10-6.  After the break, the Steelers got back to work in the 3rd quarter as Ben Roethlisberger found Antonio Brown on a 3-yard TD pass for a 17-6 game.  In the 4th quarter, the Chiefs came within 8 when Santos kicked another field goal from 43 yards out for a 17-9 game.  The Steelers however pulled away as Suisham kicked a 20-yard field goal for a 20-9 game.  Santos would later on kick a 23-yard field goal for the eventual final score of 20-12. With the win, the Steelers improved to 10-5 and endured their first playoff appearance since 2011. Antonio Brown finished the game with 122 catches on the season, the third-highest single-season total in league history while Jamaal Charles was held to his second-lowest rushing total of the season.\nHow many field goals were missed during the game?",
    "allSubtask": "step1: Determine how many field goals were attempted by each team.; step2: Find out the number of field goals each team successfully scored.; step3: Subtract the number of successful field goals from the total attempts to calculate how many were missed by each team.; step4: Sum the missed field goals from both teams to get the total number of missed field goals during the game.",
    "nowSubtask": ["Determine how many field goals were attempted by each team.","Find out the number of field goals each team successfully scored.","Subtract the number of successful field goals from the total attempts to calculate how many were missed by each team.","Sum the missed field goals from both teams to get the total number of missed field goals during the game."]
  },
  "55": {
    "steps": ["What are all the causes mentioned in the passage that contributed to the death of the Maya population?","Count the different types of contributing causes to the deaths.","Determine whether each mentioned cause independently or jointly affected the mortality rate.","Verify if some causes overlap or can be categorized under a broader classification."],
    "steps_dict": {
      "1": "What are all the causes mentioned in the passage that contributed to the death of the Maya population?",
      "2": "Count the different types of contributing causes to the deaths.",
      "3": "Determine whether each mentioned cause independently or jointly affected the mortality rate.",
      "4": "Verify if some causes overlap or can be categorized under a broader classification."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"],
      "3": ["Step 2"]
    },
    "int_edges": [[1,3],[3,4],[4,2]],
    "problemText": "At the time of the fall of Nojpetén, there are estimated to have been 60,000 Maya living around Lake Petén Itzá, including a large number of refugees from other areas. It is estimated that 88% of them died during the first ten years of colonial rule owing to a combination of disease and war. Although disease was responsible for the majority of deaths, Spanish expeditions and internecine warfare between indigenous groups also played their part. Catholic priests from Yucatán founded several mission towns around Lake Petén Itzá in 1702-1703. The first towns to be concentrated into colonial reducciones were Ixtutz, which became the new town of San José, and neighbouring San Andrés, both on the north shore of Lake Petén Itzá. They were first subjugated by one of Ursúa's officers, Cristobal de Sologaistoa, before being passed into the care of the Dominican friars for the Christian conversion of the inhabitants. Surviving Itza and Kowoj were resettled in the new colonial towns by a mixture of persuasion and force. Kowoj and Itza leaders in these mission towns rebelled against their Spanish overlords in 1704 and almost retook Nojpetén, but although well-planned, the rebellion was quickly crushed. Its leaders were executed, and most of the mission towns were abandoned; by 1708 only about 6,000 Maya remained in central Petén. The reductions failed in large part because the missionaries charged with converting the inhabitants could not speak the Itza language.\nHow many factors killed 88% of the Maya?",
    "allSubtask": "step1: What are all the causes mentioned in the passage that contributed to the death of the Maya population?; step2: Count the different types of contributing causes to the deaths.; step3: Determine whether each mentioned cause independently or jointly affected the mortality rate.; step4: Verify if some causes overlap or can be categorized under a broader classification.",
    "nowSubtask": ["What are all the causes mentioned in the passage that contributed to the death of the Maya population?","Count the different types of contributing causes to the deaths.","Determine whether each mentioned cause independently or jointly affected the mortality rate.","Verify if some causes overlap or can be categorized under a broader classification."]
  },
  "56": {
    "steps": ["Identify all the scoring situations involving Marion Barber mentioned in the passage.","Determine which scoring situations specifically resulted in touchdowns.","Count the total number of touchdowns Marion Barber scored based on the provided details."],
    "steps_dict": {
      "1": "Identify all the scoring situations involving Marion Barber mentioned in the passage.",
      "2": "Determine which scoring situations specifically resulted in touchdowns.",
      "3": "Count the total number of touchdowns Marion Barber scored based on the provided details."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their divisional home win over the Giants, the Cowboys flew to Dolphin Stadium for a Week 2 interconference fight with the Miami Dolphins.  In the first quarter, Dallas trailed early with Dolphins kicker Jay Feely getting a 37-yard field goal.  The Cowboys would tie the game with rookie kicker Nick Folk getting a 26-yard field goal.  In the second quarter, Dallas took the lead with RB Marion Barber getting a 1-yard TD run.  Miami would close out the first half with Feely getting a 45-yard field goal. In the third quarter, the Cowboys trailed as Dolphins QB Trent Green completed an 18-yard TD pass to WR Marty Booker.  Dallas jumped back into the lead with QB Tony Romo completing a 2-yard TD pass to TE Tony Curtis, along with Folk's 28-yard field goal.  In the fourth quarter, the Cowboys took control with Folk's 47-yard field goal and Romo's 34-yard TD pass to WR Terrell Owens.  Miami's Green completed a 21-yard TD pass to WR Derek Hagan, but Dallas responded with Barber's 40-yard TD run. On defense, they managed to force 5 turnovers, 4 of which came from intercepting Trent Green passes.\nHow many touchdowns did barber score?",
    "allSubtask": "step1: Identify all the scoring situations involving Marion Barber mentioned in the passage.; step2: Determine which scoring situations specifically resulted in touchdowns.; step3: Count the total number of touchdowns Marion Barber scored based on the provided details.",
    "nowSubtask": ["Identify all the scoring situations involving Marion Barber mentioned in the passage.","Determine which scoring situations specifically resulted in touchdowns.","Count the total number of touchdowns Marion Barber scored based on the provided details."]
  },
  "57": {
    "steps": ["Identify the specific agreement mentioned in the passage.","Determine which entities or parties were involved in the signing of the agreement.","Clarify how many of these entities are recognized as independent countries."],
    "steps_dict": {
      "1": "Identify the specific agreement mentioned in the passage.",
      "2": "Determine which entities or parties were involved in the signing of the agreement.",
      "3": "Clarify how many of these entities are recognized as independent countries."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "On June 1, 1922, in Helsinki, Finland and Soviet Russia signed an Agreement between RSFSR and Finland about the measures providing the inviolability of the Soviet-Finnish border. Both parties agreed to reduce the number of border guards and to keep those who do not reside permanently in the border zone from freely crossing the border from either side to the other. Towards the end of the uprising some 30 000 East Karelian refugees evacuated to Finland. The Karelian Worker's Commune was renamed into the Karelian Autonomous Soviet Socialist Republic in 1923, and its autonomy was further expanded. However the cultural autonomy practically ended in 1933 - 1935 when the émigré Finnish leaders Edvard Gylling and Kustaa Rovio were purged and teaching of Finnish language was prohibited.  Gylling had promoted the adoption of Finnish rather than Karelian within the KASSR as he and the other émigré Finns who dominated the leadership of Karelia prior to 1935 did not consider Karelian to be anything more than a rustic dialect of Finnish.  It may also be argued they held the same view of the essential unity of the Karelians and Finns as one Finnic people as their nationalist counterparts, and also wished that they be unified .\nHow many countries signed an Agreement on June 1st, 1922?",
    "allSubtask": "step1: Identify the specific agreement mentioned in the passage.; step2: Determine which entities or parties were involved in the signing of the agreement.; step3: Clarify how many of these entities are recognized as independent countries.",
    "nowSubtask": ["Identify the specific agreement mentioned in the passage.","Determine which entities or parties were involved in the signing of the agreement.","Clarify how many of these entities are recognized as independent countries."]
  },
  "58": {
    "steps": ["What year did the tensions with shaikh Khazal of Mohammerah begin?","What year did the tensions with shaikh Khazal peak or come to a critical event such as a rebellion?","How do we calculate the duration between the start of the tensions and the year they peaked or led to a significant event?"],
    "steps_dict": {
      "1": "What year did the tensions with shaikh Khazal of Mohammerah begin?",
      "2": "What year did the tensions with shaikh Khazal peak or come to a critical event such as a rebellion?",
      "3": "How do we calculate the duration between the start of the tensions and the year they peaked or led to a significant event?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Khuzestan has been a troublesome province of Iran since the ascent of the Pahlavi rule in the 1920s. In the two decades before 1924, although nominally part of Persian territory, the western part of Khuzestan functioned as an autonomous emirate known as \"Arabistan\". The eastern part of Khuzestan was governed by Bakhtiari khans because the eastern part of Khuzestan was mainly inhabited by Bakhtiari people. With rising power of Reza Khan and his increasingly negative attitudes on tribal autonomies in Iran, tensions with shaikh Khazal of Mohammerah had grown from 1922 to 1924. Attempts to withdraw more taxes and reduce Khazal's authority heated it up even more. In response Khaz'al al-Ka'bi initiated a rebellion. The short rebellion by Sheikh Khazal, at its peak in November 1924, was quickly crushed by the newly installed Pahlavi dynasty with minimal casualties. The emirate was dissolved by Reza Shah government in 1925, along with other autonomous regions of Persia, in a bid to centralize the state. At least 115 people died in the insurrection. A low level conflict between the central Iranian government and the Arab separatists of the western part of the province continued since.\nHow many years did tensions grow with shaikh Khazal of Mohammerah?",
    "allSubtask": "step1: What year did the tensions with shaikh Khazal of Mohammerah begin?; step2: What year did the tensions with shaikh Khazal peak or come to a critical event such as a rebellion?; step3: How do we calculate the duration between the start of the tensions and the year they peaked or led to a significant event?",
    "nowSubtask": ["What year did the tensions with shaikh Khazal of Mohammerah begin?","What year did the tensions with shaikh Khazal peak or come to a critical event such as a rebellion?","How do we calculate the duration between the start of the tensions and the year they peaked or led to a significant event?"]
  },
  "59": {
    "steps": ["Identify how many touchdown (TD) passes are mentioned in the problem passage where Peyton Manning is specifically stated as the passer.","Confirm if each mentioned TD pass was indeed thrown by Peyton Manning and not by any other player.","Sum up instances where Peyton Manning threw a touchdown pass to determine the total number of TD passes thrown by him in the game."],
    "steps_dict": {
      "1": "Identify how many touchdown (TD) passes are mentioned in the problem passage where Peyton Manning is specifically stated as the passer.",
      "2": "Confirm if each mentioned TD pass was indeed thrown by Peyton Manning and not by any other player.",
      "3": "Sum up instances where Peyton Manning threw a touchdown pass to determine the total number of TD passes thrown by him in the game."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Hoping to add to a nine-game winning streak, the Broncos returned home for an AFC match-up with the Cleveland Browns. On the game's opening drive, quarterback Peyton Manning threw a 22-yard touchdown pass to wide receiver Demaryius Thomas. The Browns got on the scoreboard, with a 27-yard field goal by placekicker Phil Dawson. A 10-yard touchdown pass from Manning to wide receiver Eric Decker was the only scoring play of the second quarter. The Browns narrowed the Broncos' lead early in the third quarter, with a 53-yard field goal by Dawson, but the Broncos would add 17 unanswered points to their lead, with an 8-yard touchdown pass from Manning to Decker, followed in the fourth quarter by a 27-yard field goal by placekicker Matt Prater and a 1-yard touchdown run by fullback Jacob Hester. The Browns finally scored a touchdown midway through the fourth quarter, with quarterback Colt McCoy connecting on a 6-yard pass to wide receiver Greg Little, but the Broncos' lead was too much for the Browns to overcome. Prater added a 41-yard field goal to close out the scoring. The Broncos matched their win total from the two previous seasons combined, and also swept the AFC North division. The Broncos won their 10th consecutive game against the Browns, dating back to the 1991 season, and improved their all-time series record against the Browns to 22-5 (including the playoffs).\nHow many times Peyton Manning threw TD pass?",
    "allSubtask": "step1: Identify how many touchdown (TD) passes are mentioned in the problem passage where Peyton Manning is specifically stated as the passer.; step2: Confirm if each mentioned TD pass was indeed thrown by Peyton Manning and not by any other player.; step3: Sum up instances where Peyton Manning threw a touchdown pass to determine the total number of TD passes thrown by him in the game.",
    "nowSubtask": ["Identify how many touchdown (TD) passes are mentioned in the problem passage where Peyton Manning is specifically stated as the passer.","Confirm if each mentioned TD pass was indeed thrown by Peyton Manning and not by any other player.","Sum up instances where Peyton Manning threw a touchdown pass to determine the total number of TD passes thrown by him in the game."]
  },
  "60": {
    "steps": ["What is the total nickel production of Russia in the year given?","What is the total nickel production of Indonesia in the year given?","What is the difference between the nickel production of Russia and Indonesia?"],
    "steps_dict": {
      "1": "What is the total nickel production of Russia in the year given?",
      "2": "What is the total nickel production of Indonesia in the year given?",
      "3": "What is the difference between the nickel production of Russia and Indonesia?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "New Caledonia is a major source for nickel and contains roughly 10% of the worlds known nickel supply. The islands contain about 7,100,000 tonnes of nickel. With the annual production of about 107,000 tonnes in 2009, New Caledonia was the Nickel mining in New Caledonia after Russia (266,000), Indonesia (189,000), Canada (181,000) and Australia (167,000). In recent years, the economy has suffered because of depressed international demand for nickel, due to the ongoing financial crisis of 2007–2008. Only a negligible amount of the land is suitable for cultivation, and food accounts for about 20% of imports. In addition to nickel, the substantial financial support from France and tourism are keys to the health of the economy. In the 2000s, large additions were made to nickel mining capacity. The Goro, New Caledonia is expected to be one of the largest nickel producing plants on Earth. When full-scale production begins in 2013 this plant will produce an estimated 20% of the global nickel supply. However, the need to respond to environmental concerns over the countrys globally recognized ecological heritage, may increasingly need to be factored into capitalization of mining operations.\nHow many more tonnes of nickel did Russia produce than Indonesia?",
    "allSubtask": "step1: What is the total nickel production of Russia in the year given?; step2: What is the total nickel production of Indonesia in the year given?; step3: What is the difference between the nickel production of Russia and Indonesia?",
    "nowSubtask": ["What is the total nickel production of Russia in the year given?","What is the total nickel production of Indonesia in the year given?","What is the difference between the nickel production of Russia and Indonesia?"]
  },
  "61": {
    "steps": ["Identify all instances in the passage where Brett Favre completed a pass that resulted in a touchdown.","Count the number of mentioned passes that resulted in touchdowns.","Sum up the occurrences to determine the total number of touchdown passes Brett Favre threw during the game."],
    "steps_dict": {
      "1": "Identify all instances in the passage where Brett Favre completed a pass that resulted in a touchdown.",
      "2": "Count the number of mentioned passes that resulted in touchdowns.",
      "3": "Sum up the occurrences to determine the total number of touchdown passes Brett Favre threw during the game."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their dominating divisional road win over the Bills, the Jets went home for a Week 5 interconference duel with the Minnesota Vikings on Monday night. New York took flight in the first quarter as kicker Nick Folk made a 25-yard field goal. The Jets added onto their lead in the second quarter as Folk booted a 53-yard and a 22-yard field goal. New York continued to build their lead in the third quarter as Folk nailed a 34-yard field goal. The Vikings answered with quarterback Brett Favre completed a 37-yard touchdown pass to wide receiver Randy Moss, yet the Jets came right back with Folk's 31-yard field goal. After the match was delayed due to adverse weather conditions, Minnesota began to strike back in the fourth quarter as Favre connected with wide receiver Percy Harvin on a 34-yard touchdown pass (with a failed 2-point conversion). Afterwards, New York answer as running back Shonn Greene got a 23-yard touchdown run. The Vikings tried to rally as Favre found Harvin again on an 11-yard touchdown pass, yet the Jets put the game away as cornerback Dwight Lowery returned an interception 26 yards for a touchdown.\nHow many touchdown passes did Brett Favre throw?",
    "allSubtask": "step1: Identify all instances in the passage where Brett Favre completed a pass that resulted in a touchdown.; step2: Count the number of mentioned passes that resulted in touchdowns.; step3: Sum up the occurrences to determine the total number of touchdown passes Brett Favre threw during the game.",
    "nowSubtask": ["Identify all instances in the passage where Brett Favre completed a pass that resulted in a touchdown.","Count the number of mentioned passes that resulted in touchdowns.","Sum up the occurrences to determine the total number of touchdown passes Brett Favre threw during the game."]
  },
  "62": {
    "steps": ["What is the starting year of the first documented uprising?","What is the ending year of the last documented uprising?","Calculate the difference between the ending year and the starting year to find the total duration in years.","Check if we need to add one more year to include both the starting and ending years in the total count."],
    "steps_dict": {
      "1": "What is the starting year of the first documented uprising?",
      "2": "What is the ending year of the last documented uprising?",
      "3": "Calculate the difference between the ending year and the starting year to find the total duration in years.",
      "4": "Check if we need to add one more year to include both the starting and ending years in the total count."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"],
      "2": ["Step 4"]
    },
    "int_edges": [[1,3],[3,4],[2,3]],
    "problemText": "Upper Austria had been rebellious for centuries, with 62 known uprisings between 1356 and 1849, 14 of which occurred in the 16th century. However, the Peasants' War of 1626 was the costliest in terms of human life and damage to livestock and property. The war caused Martin Aichinger to lose his farm and begin roaming the country. He eventually became a religious leader who led a popular revolt against aristocratic rule. His revolutionary ideas frightened the rulers so much that they tried to arrest him, leading to another series of uprisings that ended in the Battle on the Frankenberg  in 1636. All of Aichinger's followers were slaughtered during the battle, including the remaining women and children who had been in hiding.\nHow many years total did it take Upper Austria to have 62 uprisings?",
    "allSubtask": "step1: What is the starting year of the first documented uprising?; step2: What is the ending year of the last documented uprising?; step3: Calculate the difference between the ending year and the starting year to find the total duration in years.; step4: Check if we need to add one more year to include both the starting and ending years in the total count.",
    "nowSubtask": ["What is the starting year of the first documented uprising?","What is the ending year of the last documented uprising?","Calculate the difference between the ending year and the starting year to find the total duration in years.","Check if we need to add one more year to include both the starting and ending years in the total count."]
  },
  "63": {
    "steps": ["Define the age categories used in the population distribution.","Calculate the midpoint age for each of the specified age categories.","Determine the proportion of total population each age category represents.","Calculate the weighted average age of the population using the midpoint ages and proportion of each age category.","Interpret the result in the context of the county’s population demographics."],
    "steps_dict": {
      "1": "Define the age categories used in the population distribution.",
      "2": "Calculate the midpoint age for each of the specified age categories.",
      "3": "Determine the proportion of total population each age category represents.",
      "4": "Calculate the weighted average age of the population using the midpoint ages and proportion of each age category.",
      "5": "Interpret the result in the context of the county’s population demographics."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 3","Step 2"],
      "2": ["Step 4"],
      "3": ["Step 5"]
    },
    "int_edges": [[1,3],[1,2],[2,4],[3,4],[4,5]],
    "problemText": "In the county, the population was spread out with 23.50% under the age of 18, 8.70% from 18 to 24, 29.70% from 25 to 44, 24.70% from 45 to 64, and 13.30% who were 65 years of age or older. The median age was 38 years. For every 100 females, there were 99.10 males. For every 100 females age 18 and over, there were 96.60 males.\nHow many years old was the average person?",
    "allSubtask": "step1: Define the age categories used in the population distribution.; step2: Calculate the midpoint age for each of the specified age categories.; step3: Determine the proportion of total population each age category represents.; step4: Calculate the weighted average age of the population using the midpoint ages and proportion of each age category.; step5: Interpret the result in the context of the county’s population demographics.",
    "nowSubtask": ["Define the age categories used in the population distribution.","Calculate the midpoint age for each of the specified age categories.","Determine the proportion of total population each age category represents.","Calculate the weighted average age of the population using the midpoint ages and proportion of each age category.","Interpret the result in the context of the county’s population demographics."]
  },
  "64": {
    "steps": ["What year did Southern Irish Protestants start to decline from 10% of the population?","What year did the proportion of Southern Irish Protestants reduce to 3%?","Calculate the number of years between these two time points."],
    "steps_dict": {
      "1": "What year did Southern Irish Protestants start to decline from 10% of the population?",
      "2": "What year did the proportion of Southern Irish Protestants reduce to 3%?",
      "3": "Calculate the number of years between these two time points."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The split effectively ended the realistic electoral chances of the Irish Unionist Alliance in southern Ireland. As the partition of Ireland became more likely, Southern Unionists formed numerous political movements in an attempt to find a solution to the \"Irish Question\". Among these were Irish Dominion League and the Irish Centre Party. As such, the southern rump of the IUA became increasingly fractured and in 1922 it lost its reason to exist with the establishment of the Irish Free State. Leading unionist figures, such as the Earl of Midleton,  Lord Dunraven, James Campbell and Horace Plunkett were appointed in December 1922 by WT Cosgrave to the Free State's first Senate. Amongst others, Horace Plunkett's home in County Dublin was then burnt down during the Irish Civil War  because of his involvement in the Irish Senate. The IUA helped form the Southern Irish Loyalist Relief Association to assist war refugees and claim compensation for damage to property. From 1921 IUA voters began to support the mainstream Cumann na nGaedheal party. In the 1923 election three formerly loyalist businessmen were elected as the Business and Professional Group. From 1921 to 1991 the proportion of Southern Irish Protestants declined from 10% to 3% of the population; these had provided the bulk of the IUA's support base. Unionists continued to have a majority on Rathmines Council until 1929, when the IUA's successors lost their last elected representatives in the Irish Free State.\nThe ratio of Southern Irish Protestants declined from 10% to 3% over how many years?",
    "allSubtask": "step1: What year did Southern Irish Protestants start to decline from 10% of the population?; step2: What year did the proportion of Southern Irish Protestants reduce to 3%?; step3: Calculate the number of years between these two time points.",
    "nowSubtask": ["What year did Southern Irish Protestants start to decline from 10% of the population?","What year did the proportion of Southern Irish Protestants reduce to 3%?","Calculate the number of years between these two time points."]
  },
  "65": {
    "steps": ["What was the total number of Tokugawa forces involved in the siege of Ueda Castle?","What was the total number of Sanada forces defending Ueda Castle?","Calculate the difference between the number of Tokugawa forces and the number of Sanada forces."],
    "steps_dict": {
      "1": "What was the total number of Tokugawa forces involved in the siege of Ueda Castle?",
      "2": "What was the total number of Sanada forces defending Ueda Castle?",
      "3": "Calculate the difference between the number of Tokugawa forces and the number of Sanada forces."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Both sides had forces that did not arrive at Sekigahara in time to participate due to other battles.  Ieyasu's son Hidetada led another group through Nakasendō. However, Hidetada's forces were bogged down as he attempted to besiege Sanada Masayuki's Ueda Castle against his father's direct orders. Even though the Tokugawa forces numbered some 38,000, an overwhelming advantage over the Sanada's mere 2,000, they were still unable to capture the strategist's well-defended position. At the same time, 15,000 Toyotomi troops were being held up by 500 troops under Hosokawa Yūsai at Tanabe Castle in present-day Maizuru, Kyoto Prefecture. Some among the 15,000 troops respected Hosokawa so much they intentionally slowed their pace. Due to these incidents, a large number of troops from both sides failed to show up in time for the battle. If either of these armies participated in the conflict, it could have ended quite differently.\nHow many more forces Tokugawa had than Sanada?",
    "allSubtask": "step1: What was the total number of Tokugawa forces involved in the siege of Ueda Castle?; step2: What was the total number of Sanada forces defending Ueda Castle?; step3: Calculate the difference between the number of Tokugawa forces and the number of Sanada forces.",
    "nowSubtask": ["What was the total number of Tokugawa forces involved in the siege of Ueda Castle?","What was the total number of Sanada forces defending Ueda Castle?","Calculate the difference between the number of Tokugawa forces and the number of Sanada forces."]
  },
  "66": {
    "steps": ["What is defined as the first half in a football game?","What scoring events are mentioned that occurred in the first half?","Among the scoring events identified in the first half, which ones specifically mention field goals?","Summarize the number of field goals made based on the identified scoring events."],
    "steps_dict": {
      "1": "What is defined as the first half in a football game?",
      "2": "What scoring events are mentioned that occurred in the first half?",
      "3": "Among the scoring events identified in the first half, which ones specifically mention field goals?",
      "4": "Summarize the number of field goals made based on the identified scoring events."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "Hoping to rebound from their loss to the Jets, the Steelers stayed at home for a Week 16 interconference duel with the Carolina Panthers on Thursday night.  Pittsburgh delivered the game's opening punch in the first quarter with a 26-yard field goal from kicker Shaun Suisham.  The Steelers added onto their lead in the second quarter as Roethlisberger found wide receiver Mike Wallace on a 43-yard touchdown pass, followed by a 1-yard touchdown run from running back Rashard Mendenhall and a 29-yard field goal from Suisham. Pittsburgh continued their dominating night in the third quarter with Roethlisberger's 1-yard touchdown run.  The Panthers would close out the game in the fourth quarter as kicker John Kasay got a 27-yard field goal.\nHow many field goals were made during the first half?",
    "allSubtask": "step1: What is defined as the first half in a football game?; step2: What scoring events are mentioned that occurred in the first half?; step3: Among the scoring events identified in the first half, which ones specifically mention field goals?; step4: Summarize the number of field goals made based on the identified scoring events.",
    "nowSubtask": ["What is defined as the first half in a football game?","What scoring events are mentioned that occurred in the first half?","Among the scoring events identified in the first half, which ones specifically mention field goals?","Summarize the number of field goals made based on the identified scoring events."]
  },
  "67": {
    "steps": ["What was the total population of Singapore in 1860?","How many of the total population were Chinese in 1860?","Subtract the number of Chinese from the total population to determine how many people were not Chinese."],
    "steps_dict": {
      "1": "What was the total population of Singapore in 1860?",
      "2": "How many of the total population were Chinese in 1860?",
      "3": "Subtract the number of Chinese from the total population to determine how many people were not Chinese."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Many of the migrants from China in the 19th century came to work on the pepper and Uncaria gambir plantations, with 11,000 Chinese immigrants recorded in one year. Singapore became one of the entry and dispersal points for large number of Chinese and Indian migrants who came to work in the plantations and mines of the Straits Settlements, many of whom then settled in Singapore after their contract ended. By 1860, the total population had reached around 90,000, of these 50,000 were Chinese, and 2,445 Europeans and Eurasians. The first thorough census in Singapore was undertaken in 1871, and the people were grouped into 33 racial, ethnic or national categories, with Chinese forming the largest group at 57.6%. Censuses were then conducted at 10 year intervals afterwards. The 1881 census grouped the people into 6 main categories, and further subdivided into 47 sub-categories. The 6 broad groups were given as Europeans, Eurasians, Malays, Chinese, Indians and Others in 1921. The Malays group includes other natives of the Malay archipelago, the Europeans include Americans, the Indians would be people from the Indian subcontinent including what would now be Pakistan and Bangladesh. In 1901, the total population of Singapore was 228,555, with 15.8% Malays, 71.8% Chinese, 7.8% Indians, and 3.5% Europeans and Eurasians. The Chinese population figure of Singapore has stayed at over 70% of the total since, reaching 77.8% in 1947. After dropping from a peak of 60% in the early years of Singapore, the Malay population would range between 11 and 16% in the first half of the 20th century, while Indians hovered between 7 and just over 9% in the same period.\nIn 1860 how many people in Singapore were not Chinese?",
    "allSubtask": "step1: What was the total population of Singapore in 1860?; step2: How many of the total population were Chinese in 1860?; step3: Subtract the number of Chinese from the total population to determine how many people were not Chinese.",
    "nowSubtask": ["What was the total population of Singapore in 1860?","How many of the total population were Chinese in 1860?","Subtract the number of Chinese from the total population to determine how many people were not Chinese."]
  },
  "68": {
    "steps": ["What is the definition of a field goal in football?","Identify instances in the passage where field goals were mentioned.","Count the total number of field goals mentioned in the game by both teams."],
    "steps_dict": {
      "1": "What is the definition of a field goal in football?",
      "2": "Identify instances in the passage where field goals were mentioned.",
      "3": "Count the total number of field goals mentioned in the game by both teams."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their road win over the Seahawks, the Cardinals flew to Giants Stadium for a Week 7 Sunday night duel with the New York Giants.  After a scoreless first quarter, Arizona would trail in the second quarter as Giants running back Brandon Jacobs got a 4-yard touchdown run.  The Cardinals would answer with rookie running back Chris \"Beanie\" Wells, but New York came right back with quarterback Eli Manning completing a 62-yard touchdown pass to wide receiver Hakeem Nicks.  Arizona would end the half with kicker Neil Rackers nailing a 30-yard field goal. The Cardinals would take the lead in the third quarter with running back Tim Hightower's 1-yard touchdown run, followed by quarterback Kurt Warner completing a 6-yard touchdown pass to running back Jason Wright.  The Giants tried to come back in the fourth quarter as kicker Lawrence Tynes booted a 20-yard field goal, yet safety Antrel Rolle's final interception of the game sealed the deal for Arizona.\nHow many field goals were kicked?",
    "allSubtask": "step1: What is the definition of a field goal in football?; step2: Identify instances in the passage where field goals were mentioned.; step3: Count the total number of field goals mentioned in the game by both teams.",
    "nowSubtask": ["What is the definition of a field goal in football?","Identify instances in the passage where field goals were mentioned.","Count the total number of field goals mentioned in the game by both teams."]
  },
  "69": {
    "steps": ["Verify all instances where Todd Heap is mentioned in the passage.","Identify which of these mentions describe Todd Heap catching a pass.","Count the total number of passes Todd Heap caught according to the passage."],
    "steps_dict": {
      "1": "Verify all instances where Todd Heap is mentioned in the passage.",
      "2": "Identify which of these mentions describe Todd Heap catching a pass.",
      "3": "Count the total number of passes Todd Heap caught according to the passage."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Coming off their home win over the Dolphins, the Ravens flew to the Georgia Dome for a Week 10 interconference duel with the throwback-cladded Atlanta Falcons on Thursday night.  After a scoreless first quarter, Baltimore trailed in the second quarter as Falcons quarterback Matt Ryan completed a 28-yard touchdown pass to running back Jason Snelling, followed by kicker Matt Bryant making a 28-yard field goal. Atlanta added onto their lead in the third quarter with Bryant's 51-yard field goal, yet the Ravens answered with quarterback Joe Flacco found wide receiver Anquan Boldin on a 5-yard touchdown pass.  The Falcons struck back in the fourth quarter as Ryan completed a 4-yard touchdown pass to wide receiver Roddy White.  Baltimore took the lead as Flacco hooked up with wide receiver Derrick Mason on a 6-yard touchdown pass, followed by finding tight end Todd Heap on a 9-yard touchdown pass.  However, Atlanta got the last laugh as Ryan completed a 33-yard touchdown pass to White (with a failed two-point conversion).\nHow many passes did Heap receive?",
    "allSubtask": "step1: Verify all instances where Todd Heap is mentioned in the passage.; step2: Identify which of these mentions describe Todd Heap catching a pass.; step3: Count the total number of passes Todd Heap caught according to the passage.",
    "nowSubtask": ["Verify all instances where Todd Heap is mentioned in the passage.","Identify which of these mentions describe Todd Heap catching a pass.","Count the total number of passes Todd Heap caught according to the passage."]
  },
  "70": {
    "steps": ["Identify which 34-yard field goal the question refers to, as there are two mentioned in the passage.","Determine what the term \"former amount\" refers to in the context of the game's scoring sequence.","Calculate the score just before the identified 34-yard field goal was kicked.","Verify any changes in team scores leading up to that specific field goal."],
    "steps_dict": {
      "1": "Identify which 34-yard field goal the question refers to, as there are two mentioned in the passage.",
      "2": "Determine what the term \"former amount\" refers to in the context of the game's scoring sequence.",
      "3": "Calculate the score just before the identified 34-yard field goal was kicked.",
      "4": "Verify any changes in team scores leading up to that specific field goal."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "After winning at home, the Steelers traveled to Detroit to take on the Lions. The Steelers would score first when Chris Boswell nailed a 34-yard field goal to make the score 3-0. The Lions tied the game up later on when Matt Prater kicked a 48-yard field goal to make it 3-3. The Lions moved into the lead when Prater kicked a 37-yard field goal to make it 6-3. The Steelers moved back into the lead when Le'Veon Bell ran for a 5-yard touchdown to make it 10-6. The Lions retook the lead when Prater kicked 2 more field goals from 51 and 34 yards out to make the score 10-9 and then move up 12-10 at halftime. In the third quarter, it was all Steelers as they retook the lead when Chris Boswell kicked a 38-yard field goal to make it 13-12. Later on in the quarter, Ben Roethlisberger connected with JuJu Smith-Schuster for a 97-yard pass making it 20-12. The Lions scored their only points of the second half in the fourth quarter when Prater kicked a 19-yard field goal to make it 20-15. This would eventually be the final score of the game. With the win, the Steelers went into their bye week 6-2. After falling behind in the all-time series to the Lions 4-12-1 through 1965, the Steelers' victory moved them to 13-2 against Detroit since 1966. The team also held an opponent without a touchdown on the road for the first time since their 28-12 victory over the Browns in 2015.\nHow many points was the former amount after the 34 yard field goal was made?",
    "allSubtask": "step1: Identify which 34-yard field goal the question refers to, as there are two mentioned in the passage.; step2: Determine what the term \"former amount\" refers to in the context of the game's scoring sequence.; step3: Calculate the score just before the identified 34-yard field goal was kicked.; step4: Verify any changes in team scores leading up to that specific field goal.",
    "nowSubtask": ["Identify which 34-yard field goal the question refers to, as there are two mentioned in the passage.","Determine what the term \"former amount\" refers to in the context of the game's scoring sequence.","Calculate the score just before the identified 34-yard field goal was kicked.","Verify any changes in team scores leading up to that specific field goal."]
  },
  "71": {
    "steps": ["What is a field goal in the context of football?","How many times is John Carney mentioned as making a field goal in the game description?","Document each instance (with the distance specified) where Carney successfully completed a field goal during the described game.","Add up the total number of successful field goals made by John Carney mentioned in the passage."],
    "steps_dict": {
      "1": "What is a field goal in the context of football?",
      "2": "How many times is John Carney mentioned as making a field goal in the game description?",
      "3": "Document each instance (with the distance specified) where Carney successfully completed a field goal during the described game.",
      "4": "Add up the total number of successful field goals made by John Carney mentioned in the passage."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "Coming off their road win over the Rams, the Giants went home for a Week 3 interconference duel with the Cincinnati Bengals.  In the first quarter, the G-Men trailed early as Bengals kicker Shayne Graham kicked a 22-yard field goal.  In the second quarter, New York responded with RB Brandon Jacobs getting a 1-yard TD run.  Cincinnati replied with RB Chris Perry getting a 25-yard TD run, yet the Giants managed to tie the game with kicker John Carney getting a 24-yard field goal.  The Bengals ended the first half with Graham's 30-yard field goal. In the third quarter, Big Blue responded with Carney's 46-yard field goal.  In the fourth quarter, the Giants took the lead with Carney kicking a 26-yard field goal.  Cincinnati took the lead again with QB Carson Palmer completing a 17-yard TD pass to WR T.J. Houshmandzadeh.  New York reclaimed the lead with QB Eli Manning completing a 4-yard TD pass to TE Kevin Boss, yet the Bengals tied the game with Graham's 21-yard field goal.  In overtime, Carney gave the Big Blue a big win with a game-winning 22-yard field goal. With the win, the Giants entered the bye week at 3-0.\nHow many field goals did Carney make?",
    "allSubtask": "step1: What is a field goal in the context of football?; step2: How many times is John Carney mentioned as making a field goal in the game description?; step3: Document each instance (with the distance specified) where Carney successfully completed a field goal during the described game.; step4: Add up the total number of successful field goals made by John Carney mentioned in the passage.",
    "nowSubtask": ["What is a field goal in the context of football?","How many times is John Carney mentioned as making a field goal in the game description?","Document each instance (with the distance specified) where Carney successfully completed a field goal during the described game.","Add up the total number of successful field goals made by John Carney mentioned in the passage."]
  },
  "72": {
    "steps": ["How many touchdowns did the Buccaneers score in the game?","How many touchdowns did the 49ers score in the game?","What is the total number of touchdowns scored by both teams combined?"],
    "steps_dict": {
      "1": "How many touchdowns did the Buccaneers score in the game?",
      "2": "How many touchdowns did the 49ers score in the game?",
      "3": "What is the total number of touchdowns scored by both teams combined?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Coming off their win over the Rams the 49ers played on home ground for an NFC duel with the Buccaneers. In the second quarter the 49ers trailed after RB Cadillac Williams made a 6-yard TD run. This was followed in the third quarter by QB Josh Freeman completing an 8-yard TD pass to WR Mike Williams; and in the fourth quarter by Freeman throwing a 1-yard TD pass to Donald Penn. With the loss, the 49ers fell to 3-7.  This marked the 49ers' first shutout loss at home since 1977, when they were defeated by the Atlanta Falcons 7-0.\nHow many touchdowns were scored in the game?",
    "allSubtask": "step1: How many touchdowns did the Buccaneers score in the game?; step2: How many touchdowns did the 49ers score in the game?; step3: What is the total number of touchdowns scored by both teams combined?",
    "nowSubtask": ["How many touchdowns did the Buccaneers score in the game?","How many touchdowns did the 49ers score in the game?","What is the total number of touchdowns scored by both teams combined?"]
  },
  "73": {
    "steps": ["How many total troops were involved in the invasion of Kandy?","What is the breakdown of those troops in terms of their origin or type, specifically the number of Portuguese troops in the invasion force?","Confirm if the specified number of Portuguese troops only includes soldiers from Portugal or if it possibly includes others labeled under a different group in the force."],
    "steps_dict": {
      "1": "How many total troops were involved in the invasion of Kandy?",
      "2": "What is the breakdown of those troops in terms of their origin or type, specifically the number of Portuguese troops in the invasion force?",
      "3": "Confirm if the specified number of Portuguese troops only includes soldiers from Portugal or if it possibly includes others labeled under a different group in the force."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "The Portuguese tried again to put their preferred candidate on the throne of Kandy as a client ruler. This time it was Dona Catarina, a Kandyan princess who had been entrusted to the care of the Portuguese and brought up in a Catholic European style. She was then aged ten or twelve. Pedro Lopes de Sousa led a force of about 20,000 in an invasion of Kandy, of which one thousand were Portuguese troops , 15,400 native Lascarin allies, 47 elephants used as pack animals, and the remainder Badaga mercenaries from India and coolie labourers. The initial number of opposing Kandyan forces is unknown, but is estimated at 10,000. The defenders held a distinct advantage in the terrain, as Kandy is a mountainous region and the invading force would be forced to traverse well-defended mountain passes. The Portuguese stormed the pass at Balana with heavy losses, after which the Kandyan forces began to retreat before the invaders. The Portuguese were able to enter the capital Kandy without resistance, finding it abandoned by King Vimaladharmasuriya I. Dona Catarina was crowned as the new ruler of the Kingdom of Kandy. However she and her Portuguese advisers were unpopular rulers, particularly after rumours spread that she was to be married to a Portuguese husband . Vimaladharmasuriya's forces engaged in guerilla tactics, attacking Portuguese foraging parties and cutting off lines of supply and communication. A large Portuguese-Lascarin raiding party of 3,000 men was surrounded and destroyed in the Uva region. Shortly thereafter, evidence was found that Jayavira Bandara Mudali, one of the Lascarin chieftains, was preparing to betray the Portuguese to Vimaladharmasuriya. Part of this evidence was later shown to be fabricated by Vimaladharmasuriya, but Jayavira was killed as a traitor before this was realised.\nIn the invasion of Kandy, how many of the invading troops were from Portugal?",
    "allSubtask": "step1: How many total troops were involved in the invasion of Kandy?; step2: What is the breakdown of those troops in terms of their origin or type, specifically the number of Portuguese troops in the invasion force?; step3: Confirm if the specified number of Portuguese troops only includes soldiers from Portugal or if it possibly includes others labeled under a different group in the force.",
    "nowSubtask": ["How many total troops were involved in the invasion of Kandy?","What is the breakdown of those troops in terms of their origin or type, specifically the number of Portuguese troops in the invasion force?","Confirm if the specified number of Portuguese troops only includes soldiers from Portugal or if it possibly includes others labeled under a different group in the force."]
  },
  "74": {
    "steps": ["Identify which quarters constitute the second half of the game.","Determine the touchdowns scored specifically in the third and fourth quarters.","Count the total number of touchdowns mentioned in the passage for the third and fourth quarters."],
    "steps_dict": {
      "1": "Identify which quarters constitute the second half of the game.",
      "2": "Determine the touchdowns scored specifically in the third and fourth quarters.",
      "3": "Count the total number of touchdowns mentioned in the passage for the third and fourth quarters."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Still searching for their first win of the year, the Rams flew to Texas Stadium for a Week 4 showdown with the Dallas Cowboys.  After a scoreless first quarter, St. Louis trailed early as Cowboys RB Julius Jones got a 2-yard TD run.  Later in the period, the Rams would get their only score of the game as WR Dante Hall returned a punt 85&#160;yards for a touchdown.  Afterwards, Dallas regained the lead with QB Tony Romo getting a 15-yard TD run. In the third quarter, the Cowboys managed to put the game away with Romo hooking up with WR Patrick Crayton on a 59-yard and a 37-yard TD pass.  Afterwards, the scoring ended with Romo's 17-yard TD pass to TE Jason Witten. With no touchdowns in their last 30 offensive possessions to go with their fourth-straight loss, the Rams fell to 0-4.\nHow many touchdowns were scored in the second half?",
    "allSubtask": "step1: Identify which quarters constitute the second half of the game.; step2: Determine the touchdowns scored specifically in the third and fourth quarters.; step3: Count the total number of touchdowns mentioned in the passage for the third and fourth quarters.",
    "nowSubtask": ["Identify which quarters constitute the second half of the game.","Determine the touchdowns scored specifically in the third and fourth quarters.","Count the total number of touchdowns mentioned in the passage for the third and fourth quarters."]
  },
  "75": {
    "steps": ["At what point in the game did the second quarter begin?","What was the score at the start of the second quarter?","Were there any scoring plays by the Patriots in the second quarter?","What were the details of each scoring play by the Patriots during the second quarter, including the type of score (touchdown, field goal, etc.)?","How many points were scored in each of the Patriots' scoring plays in the second quarter?","What was the score at the end of the second quarter?"],
    "steps_dict": {
      "1": "At what point in the game did the second quarter begin?",
      "2": "What was the score at the start of the second quarter?",
      "3": "Were there any scoring plays by the Patriots in the second quarter?",
      "4": "What were the details of each scoring play by the Patriots during the second quarter, including the type of score (touchdown, field goal, etc.)?",
      "5": "How many points were scored in each of the Patriots' scoring plays in the second quarter?",
      "6": "What was the score at the end of the second quarter?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"],
      "4": ["Step 5"],
      "5": ["Step 6"]
    },
    "int_edges": [[1,2],[2,3],[3,4],[4,5],[5,6]],
    "problemText": "Coming off their Monday night loss to the Saints, the Patriots traveled to Miami to face the Dolphins with a two-game lead in the division. The Patriots received the ball to start the game and six plays in, converted a 3rd-and-8 to keep the drive alive. On the next play, Brady threw a 58-yard touchdown pass to Moss to take an early 7-0 lead. Brady was injured on the play and went to the locker room but returned by the next offensive snap. In the mean time, the Dolphins' first possession reached the Patriots' 42-yard line before Henne was sacked by Banta-Cain and Mayo for a loss of seven yards. On the next play, the Dolphins used White in their \"pistol\" formation and attempted a play action option run, but White's option toss to Ricky Williams was errant and recovered by Williams for a loss of 13 yards. Following the Dolphins' punt, the Patriots began a 13-play, 80-yard drive with 6:41 left in the first quarter and did not surrender the ball until early in the second quarter, extending their lead to 14-0 on a 6-yard Faulk draw for a touchdown. The Dolphins responded with a 10-play, 88-yard drive of their own, including a 29-yard pass to Camarillo, that ended in a 13-yard touchdown pass from Henne to Davone Bess, cutting the Patriots' lead to 14-7. Despite a 16-yard Welker reception to begin the Patriots' next drive, they were forced to punt after four plays. The Dolphins again moved into Patriots territory on their ensuing possession, reaching the 49-yard line before Henne was intercepted by Meriweather at the Patriots' 19-yard line. Following a 19-yard return, a 15-yard unsportsmanlike conduct penalty on Wilfork, and a false start penalty on Watson, the Patriots' next drive began at their own 18-yard line. The Patriots quickly moved into the red zone on a 58-yard Welker catch, but on a 4th-and-1 from the 6-yard line, the Patriots tried to convert, and Morris was stopped short of the first down marker. Off the turnover and with under two minutes remaining, the Dolphins moved 83 yards on 11 plays, cutting the Patriots' halftime lead to 14-10 on a 29-yard Carpenter field goal. The Dolphins, who had deferred the opening coin toss, chose to receive at the start of the second half but went three-and-out. On the next play (after a penalty), Brady threw a short sideline pass to Aiken, who caught the ball over the defender and proceeded to run down the sideline for an 81-yard touchdown, extending the Patriots' lead to 21-10. It was the third 50+ yard completion of the game for Brady, a career first, and the third longest completion of Brady's career. He also eclipsed 30,000 career passing yards on the play. Following a 51-yard kickoff return by Ted Ginn, Jr., the Dolphins took two plays to reach Patriots territory. On a 3rd-and-4 from the Patriots' 46-yard line, Henne attempted a deep sideline pass to wide receiver Brian Hartline, who stopped and turned back to catch the ball but was taken down by Wilhite for a 37-yard defensive pass interference penalty. However, the Pats surrendered only three yards and forced the Dolphins to kick a field goal; Carpenter's 24-yard score cut the Patriots' lead to 21-13. After a Patriots three-and-out, the Dolphins continued to pressure the Patriots defense, moving 64 yards on 12 plays and cutting the deficit to two points on a 7-yard Hartline touchdown catch. The Dolphins attempted to tie the game on a two-point conversion pass attempt to Fasano, but the pass fell incomplete. The Patriots' next drive reached the Dolphins' 39-yard line, where the Patriots again attempted to convert a fourth down, this one with three yards to gain. The Patriots appeared to do so at first, as Welker caught a 13-yard pass from Brady, but the play was nullified by an Aiken offensive pass interference penalty. After another penalty on the first punt attempt, the second punt attempt by Hanson actually gave the Patriots a better break, pinning the Dolphins at their own 3-yard line at the end of the third quarter. The Dolphins could not move past their 22-yard line on the ensuing possession and punted, giving the Patriots the ball at their own 39-yard line. After several quick first downs, the Patriots reached the red zone. However, a Brady pass attempt intended for Moss in the back corner of the end zone was intercepted by Vontae Davis for a touchback, maintaining a two-point deficit for the Dolphins. However, the Dolphins could not move a yard off the turnover and were forced to punt; the Patriots too went three-and-out. The Dolphins moved to the Patriots' 39-yard line on their ensuing possession, and like the Patriots, faced a fourth down with two yards to go. Henne's pass intended for Bess was broken up by Butler to turn the ball over on downs. However, the Patriots did not gain a yard, and in fact lost one yard on their next possession, setting up a Dolphins possession with 3:44 left in the game. The Dolphins moved 51 yards on 10 plays, reaching the Patriots' 23-yard line with just over one minute remaining. Carpenter then hit a 41-yard field goal to put the Dolphins ahead for the first time in the game, 22-21. Only needing a field goal, the Patriots tried to set up a Gostkowski attempt with under a minute to go, but three plays into their drive Brady was hit as he threw and was intercepted by linebacker Channing Crowder to seal a Dolphins victory. The back-to-back losses were a first for the Patriots since November 2006, and dropped their record to 7-5, while the Dolphins improved to 6-6 and within a game of first place in the division.\nHow many points did the Patriots score in the second quarter?",
    "allSubtask": "step1: At what point in the game did the second quarter begin?; step2: What was the score at the start of the second quarter?; step3: Were there any scoring plays by the Patriots in the second quarter?; step4: What were the details of each scoring play by the Patriots during the second quarter, including the type of score (touchdown, field goal, etc.)?; step5: How many points were scored in each of the Patriots' scoring plays in the second quarter?; step6: What was the score at the end of the second quarter?",
    "nowSubtask": ["At what point in the game did the second quarter begin?","What was the score at the start of the second quarter?","Were there any scoring plays by the Patriots in the second quarter?","What were the details of each scoring play by the Patriots during the second quarter, including the type of score (touchdown, field goal, etc.)?","How many points were scored in each of the Patriots' scoring plays in the second quarter?","What was the score at the end of the second quarter?"]
  },
  "76": {
    "steps": ["What year was the European Coal and Steel Community (ECSC) established?","What year did the ECSC transition into the European Economic Community (EEC)?","How do we calculate the number of years between two given years?"],
    "steps_dict": {
      "1": "What year was the European Coal and Steel Community (ECSC) established?",
      "2": "What year did the ECSC transition into the European Economic Community (EEC)?",
      "3": "How do we calculate the number of years between two given years?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Since the end of World War II, in part due to industrial size and the onset of the Cold War, the United States has often been a proponent of reduced tariff-barriers and free trade. The U.S. helped establish the General Agreement on Tariffs and Trade  and later the World Trade Organization ; although it had rejected an earlier version in the 1950s . Since the 1970s, U.S. governments have negotiated managed-trade agreements, such as the North American Free Trade Agreement  in the 1990s, the Dominican Republic-Central America Free Trade Agreement  in 2006, and a number of bilateral agreements . In Europe, six countries formed the European Coal and Steel Community  in 1951 which became the European Economic Community  in 1958. Two core objectives of the EEC were the development of a common market, subsequently renamed the single market, and establishing a customs union between its member states. After expanding its membership, the EEC became the European Union  in 1993. The European Union, now the world's largest single market, has concluded free trade agreements with many countries around the world.\nHow many years did the European Coal and Steel Community exist?",
    "allSubtask": "step1: What year was the European Coal and Steel Community (ECSC) established?; step2: What year did the ECSC transition into the European Economic Community (EEC)?; step3: How do we calculate the number of years between two given years?",
    "nowSubtask": ["What year was the European Coal and Steel Community (ECSC) established?","What year did the ECSC transition into the European Economic Community (EEC)?","How do we calculate the number of years between two given years?"]
  },
  "77": {
    "steps": ["What was the final score for the Texans?","What was the final score for the Jaguars?","Subtract the Jaguars' final score from the Texans' final score to find the difference."],
    "steps_dict": {
      "1": "What was the final score for the Texans?",
      "2": "What was the final score for the Jaguars?",
      "3": "Subtract the Jaguars' final score from the Texans' final score to find the difference."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "(2012 Jacksonville Jaguars season)The Texans entered their first division clash of the season looking to establish their will on the ground.  Behind a punishing ground attack with Arian Foster and Ben Tate, as well as an efficient defensive effort led by second year defensive lineman J.J. Watt, the Texans dominated the game with a time of possession of 43:17 on their way to a 27-7 victory in Jacksonville.  With the win, the Texans improved to 2-0 for the 3rd straight season. On the first drive, Houston drove 60 yards aided by Tate and took a 3-0 lead on a Shayne Graham 31 yard field goal. The Jaguars mounted a drive into Texan territory but they had to punt from the 44. Both teams went three-and-out on their next drive.  After a long pass play, the Texans were at the 1. 2 plays later Arian Foster ran it in from the 1 to make it 10-0. Two drives later Houston scored on an 8-yard run from Ben Tate. At halftime it was 17-0 Texans. In the 3rd quarter, quarterback Matt Schaub threw an interception returned to the Houston 37. Jacksonville scored in just 2 plays on a Td pass from Blaine Gabbert to running back Maurice-Jones Drew. It was 17-7. Then the Texans made a 17 play drive resulting in a 2-yard Ben Tate touchdown to make it 24-7. The Texans would get a field goal to make it 27-7, and that would end the game.\nHow many points did the Texans win by?",
    "allSubtask": "step1: What was the final score for the Texans?; step2: What was the final score for the Jaguars?; step3: Subtract the Jaguars' final score from the Texans' final score to find the difference.",
    "nowSubtask": ["What was the final score for the Texans?","What was the final score for the Jaguars?","Subtract the Jaguars' final score from the Texans' final score to find the difference."]
  },
  "78": {
    "steps": ["What is the starting month and year of the Kingdom of Kurdistan?","What is the ending month and year of the Kingdom of Kurdistan?","How to calculate the total number of years between two given dates, considering both the months and years."],
    "steps_dict": {
      "1": "What is the starting month and year of the Kingdom of Kurdistan?",
      "2": "What is the ending month and year of the Kingdom of Kurdistan?",
      "3": "How to calculate the total number of years between two given dates, considering both the months and years."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Mahmud Barzanji revolts were a series of armed uprisings by Kurdish Sheykh Mahmud Barzanji against the Iraqi authority in newly conquered British Mesopotamia and later the British Mandate in Iraq. Following his first insurrection in May 1919, Sheykh Mahmud was imprisoned and eventually exiled to India for a one-year period. When returning, he was once again appointed a governor, but shortly revolted again declaring himself as the ruler of the Kingdom of Kurdistan. The Kingdom of Kurdistan lasted from September 1922 - July 1924. With British forces greatly exceeding his in ammunition and training, the defeat finally subdued the region to central British Iraqi rule in 1924. Sheykh Mahmud retreated into mountains, and eventually reached terms with the independent Kingdom of Iraq in 1932, over his return from the underground. Sheykh Mahmud revolts are considered the first chapter of the modern Iraqi-Kurdish conflict.\nHow many years the lifetime of the Kingdom of Kurdistan?",
    "allSubtask": "step1: What is the starting month and year of the Kingdom of Kurdistan?; step2: What is the ending month and year of the Kingdom of Kurdistan?; step3: How to calculate the total number of years between two given dates, considering both the months and years.",
    "nowSubtask": ["What is the starting month and year of the Kingdom of Kurdistan?","What is the ending month and year of the Kingdom of Kurdistan?","How to calculate the total number of years between two given dates, considering both the months and years."]
  },
  "79": {
    "steps": ["What is the percentage of the student population that are Louisiana residents?","Subtract the percentage of Louisiana residents from 100% to find the percentage of students who are not Louisiana residents."],
    "steps_dict": {
      "1": "What is the percentage of the student population that are Louisiana residents?",
      "2": "Subtract the percentage of Louisiana residents from 100% to find the percentage of students who are not Louisiana residents."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"]
    },
    "int_edges": [[1,2]],
    "problemText": "As of the Fall 2017 quarter, Louisiana Tech had an all-time record high enrollment of 12,873 students pursuing degrees in five academic colleges. The student body has members from every Louisiana parish, 47 U.S. states, and 64 foreign countries. Louisiana residents account for 85.0% of the student population, while out-of-state students and international students account for 11.1% and 4.0% of the student body, respectively. The student body at Louisiana Tech is 69.4% white, 13.3% black, 3.8% international students, and 13.5% other or \"unknown\" ethnicity. The student body consists of 50.2% women and 49.8% men.\nHow many percent of the student population are not Louisiana residents?",
    "allSubtask": "step1: What is the percentage of the student population that are Louisiana residents?; step2: Subtract the percentage of Louisiana residents from 100% to find the percentage of students who are not Louisiana residents.",
    "nowSubtask": ["What is the percentage of the student population that are Louisiana residents?","Subtract the percentage of Louisiana residents from 100% to find the percentage of students who are not Louisiana residents."]
  },
  "80": {
    "steps": ["What was the final score for the Bears in the game against the Vikings?","What was the final score for the Vikings in the same game?","How do we calculate the winning margin using the final scores of the two teams?"],
    "steps_dict": {
      "1": "What was the final score for the Bears in the game against the Vikings?",
      "2": "What was the final score for the Vikings in the same game?",
      "3": "How do we calculate the winning margin using the final scores of the two teams?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "After the loss to New England, the Bears returned to Soldier Field to play the Minnesota Vikings. The weather conditions were harsh throughout the game; the below-freezing temperatures and swirling winds provided a clich&#233;d background for a rivalry game in the \"Black and Blue Division\".  Despite a marginal offensive performance, the Bears managed to defeat the Vikings 23-13. With their tenth win of the season, the Bears secured their second consecutive NFC North Title. Additionally, the Bears became the first team in the NFL to clinch a playoff berth, and remained tied for the NFL's best record.\nHow many points did the Bears win over the Vikings?",
    "allSubtask": "step1: What was the final score for the Bears in the game against the Vikings?; step2: What was the final score for the Vikings in the same game?; step3: How do we calculate the winning margin using the final scores of the two teams?",
    "nowSubtask": ["What was the final score for the Bears in the game against the Vikings?","What was the final score for the Vikings in the same game?","How do we calculate the winning margin using the final scores of the two teams?"]
  },
  "81": {
    "steps": ["What is the total number of Navy and Marine personnel stationed at the Naval Base during the Cold War?","What is the total number of civilians serving at the same Naval Base during the Cold War?","Calculate the difference between the number of Navy and Marine personnel and the number of civilians."],
    "steps_dict": {
      "1": "What is the total number of Navy and Marine personnel stationed at the Naval Base during the Cold War?",
      "2": "What is the total number of civilians serving at the same Naval Base during the Cold War?",
      "3": "Calculate the difference between the number of Navy and Marine personnel and the number of civilians."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Charleston, North Charleston, Goose Creek, and Hanahan are home to branches of the United States military. During the Cold War, the Naval Base  became the third largest U.S. homeport, with 23,500 Navy and Marine personnel, and 13,200 civilians serving over 80 ships and submarines. In addition, the combined facilities of the Naval Base and Weapons Station created the largest U.S. submarine port.  The Charleston Naval Shipyard repaired frigates, destroyers, cruisers, submarine tenders, and submarines. Also during this period, the shipyard conducted refueling of nuclear submarines. The Weapons Station was the Atlantic Fleet's loadout base for all nuclear ballistic missile submarines. Two SSBN \"Boomer\" squadrons and a submarine tender were homeported at the Weapons Station, while one SSN attack squadron, Submarine Squadron 4, and a submarine tender were homeported at the Naval Base. At the 1996 closure of the station's Polaris Missile Facility Atlantic , over 2,500 nuclear warheads and their UGM-27 Polaris, UGM-73 Poseidon, and UGM-96 Trident I delivery missiles  were stored and maintained, guarded by a U.S. Marine Corps security force company. In 2010, the Air Force base  and Naval Weapons Station  merged to form Joint Base Charleston. Today, Joint Base Charleston, supporting 53 military commands and federal agencies, provides service to over 79,000 airmen, sailors, soldiers, Marines, coast guardsmen, Department of Defense civilians, dependents, and retirees.\nHow many more Navy and Marine personnel were there than civilians?",
    "allSubtask": "step1: What is the total number of Navy and Marine personnel stationed at the Naval Base during the Cold War?; step2: What is the total number of civilians serving at the same Naval Base during the Cold War?; step3: Calculate the difference between the number of Navy and Marine personnel and the number of civilians.",
    "nowSubtask": ["What is the total number of Navy and Marine personnel stationed at the Naval Base during the Cold War?","What is the total number of civilians serving at the same Naval Base during the Cold War?","Calculate the difference between the number of Navy and Marine personnel and the number of civilians."]
  },
  "82": {
    "steps": ["What is the year when the 1917 Constitution was first established?","What year did the government introduce reforms to the 1917 Constitution?","How do you calculate the number of years between two given years?"],
    "steps_dict": {
      "1": "What is the year when the 1917 Constitution was first established?",
      "2": "What year did the government introduce reforms to the 1917 Constitution?",
      "3": "How do you calculate the number of years between two given years?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "An important element the Revolution's legacy is the 1917 Constitution. It was pushed forward by populist generals within Carranza's government to undermine the popular support that Pancho Villa and Emiliano Zapata held. It was not written by liberal elites or the military itself, but rather young radicalized professionals, giving the document some authenticity for the peasantry. The document brought numerous reforms demanded by populist factions of the revolution, with article 27 empowering the state to expropriate resources deemed vital to the nation. These included expropriation of hacienda lands and redistribution to peasants. Article 27 also empowered the government to expropriate holdings of foreign companies, most prominently seen in the 1938 expropriation of oil. In Article 123 the constitution codified major labor reforms, including an 8-hour work day, a right to strike, equal pay laws for women, and an end to exploitative practices such as child labor and company stores. The constitution strengthened restrictions on the Roman Catholic Church in Mexico. In the early 1990s, the government introduced reforms to the constitution that rolled back the government's power to expropriate property and its restrictions on religious institutions. Just as the government of Carlos Salinas de Gortari was amending significant provisions of the constitution, Metro Constitución de 1917 station was opened.\nRoughly how many years was the 1917 Constitution in place before it was reformed?",
    "allSubtask": "step1: What is the year when the 1917 Constitution was first established?; step2: What year did the government introduce reforms to the 1917 Constitution?; step3: How do you calculate the number of years between two given years?",
    "nowSubtask": ["What is the year when the 1917 Constitution was first established?","What year did the government introduce reforms to the 1917 Constitution?","How do you calculate the number of years between two given years?"]
  },
  "83": {
    "steps": ["When was the key appointment mentioned that is relevant to the timeline (i.e., which appointment by the Tsar to the Ministry is being referred to in the question)?","What is the date of the Tsar confirming his promise to the people and their representatives?","How should months between two dates be calculated to determine the period from the appointment to the confirmation of promise?"],
    "steps_dict": {
      "1": "When was the key appointment mentioned that is relevant to the timeline (i.e., which appointment by the Tsar to the Ministry is being referred to in the question)?",
      "2": "What is the date of the Tsar confirming his promise to the people and their representatives?",
      "3": "How should months between two dates be calculated to determine the period from the appointment to the confirmation of promise?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "On 12 January, the Tsar appointed Dmitri Feodorovich Trepov as governor in St Petersburg and dismissed the Minister of the Interior, Pyotr Sviatopolk-Mirskii, on 18 February  1905. He appointed a government commission \"to enquire without delay into the causes of discontent among the workers in the city of St Petersburg and its suburbs\" in view of the strike movement. The commission was headed by Senator NV Shidlovsky, a member of the State Council, and included officials, chiefs of government factories, and private factory owners. It was also meant to have included workers' delegates elected according to a two-stage system. Elections of the workers delegates were, however, blocked by the socialists who wanted to divert the workers from the elections to the armed struggle. On 5 March  1905, the Commission was dissolved without having started work. Following the assassination of his uncle, the Grand Duke Sergei Aleksandrovich, on 17 February  1905, the Tsar made new concessions. On 18 February  1905 he published the Bulygin Rescript, which promised the formation of a consultative assembly, religious tolerance, freedom of speech  and a reduction in the peasants' redemption payments. On 24 and 25 May  1905, about 300 Zemstvo and municipal representatives held three meetings in Moscow, which passed a resolution, asking for popular representation at the national level. On 6 June  1905, Nicholas II had received a Zemstvo deputation. Responding to speeches by Prince Sergei Trubetskoi and Mr Fyodrov, the Tsar confirmed his promise to convene an assembly of people's representatives.\nHow many months after the appointments to Ministry had the Tsar confirmed his promise to the people and their representatives?",
    "allSubtask": "step1: When was the key appointment mentioned that is relevant to the timeline (i.e., which appointment by the Tsar to the Ministry is being referred to in the question)?; step2: What is the date of the Tsar confirming his promise to the people and their representatives?; step3: How should months between two dates be calculated to determine the period from the appointment to the confirmation of promise?",
    "nowSubtask": ["When was the key appointment mentioned that is relevant to the timeline (i.e., which appointment by the Tsar to the Ministry is being referred to in the question)?","What is the date of the Tsar confirming his promise to the people and their representatives?","How should months between two dates be calculated to determine the period from the appointment to the confirmation of promise?"]
  },
  "84": {
    "steps": ["What does the Treaty of London refer to in the context of the historical event?","What territories were mentioned in the passage as being affected by the Treaty of London?","Identify which of these territories had their holdings enlarged as a result of the Treaty.","Count how many territories had their holdings enlarged based on the relevant information."],
    "steps_dict": {
      "1": "What does the Treaty of London refer to in the context of the historical event?",
      "2": "What territories were mentioned in the passage as being affected by the Treaty of London?",
      "3": "Identify which of these territories had their holdings enlarged as a result of the Treaty.",
      "4": "Count how many territories had their holdings enlarged based on the relevant information."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "Austria-Hungary precipitated the Bosnian crisis of 1908-1909 by officially annexing the former Ottoman territory of Bosnia and Herzegovina, which it had occupied since 1878. This angered the Kingdom of Serbia and its patron, the Pan-Slavic and Orthodox Russian Empire. Russian political manoeuvring in the region destabilised peace accords that were already fracturing in the Balkans, which came to be known as the \"powder keg of Europe.\" In 1912 and 1913, the First Balkan War was fought between the Balkan League and the fracturing Ottoman Empire. The resulting Treaty of London further shrank the Ottoman Empire, creating an independent Albanian state while enlarging the territorial holdings of Bulgaria, Serbia, Montenegro, and Greece. When Bulgaria attacked Serbia and Greece on 16 June 1913, it lost most of Macedonia to Serbia and Greece, and Southern Dobruja to Romania in the 33-day Second Balkan War, further destabilising the region. The Great Powers were able to keep these Balkan conflicts contained, but the next one would spread throughout Europe and beyond.\nHow many territorial holdings were enlarged during the Treaty of London?",
    "allSubtask": "step1: What does the Treaty of London refer to in the context of the historical event?; step2: What territories were mentioned in the passage as being affected by the Treaty of London?; step3: Identify which of these territories had their holdings enlarged as a result of the Treaty.; step4: Count how many territories had their holdings enlarged based on the relevant information.",
    "nowSubtask": ["What does the Treaty of London refer to in the context of the historical event?","What territories were mentioned in the passage as being affected by the Treaty of London?","Identify which of these territories had their holdings enlarged as a result of the Treaty.","Count how many territories had their holdings enlarged based on the relevant information."]
  },
  "85": {
    "steps": ["Which cities were targeted by the Siamese troops during the initial campaigns led by Phraya Chakri and Phraya Phra Khlang?","Were there additional cities captured by the Siamese troops apart from those mentioned in the initial campaign?","Determine the final tally of cities successfully captured by the Siamese after all military actions described."],
    "steps_dict": {
      "1": "Which cities were targeted by the Siamese troops during the initial campaigns led by Phraya Chakri and Phraya Phra Khlang?",
      "2": "Were there additional cities captured by the Siamese troops apart from those mentioned in the initial campaign?",
      "3": "Determine the final tally of cities successfully captured by the Siamese after all military actions described."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "In 1592 King Naresuan sent two different forces to the cities of Dawei and Tenasserim. The first, under the command of Phraya Chakri, had 50,000 troops to attack Tenasserim. The second unit, under the command of Phraya Phra Khlang, had 50,000 troops to capture Dawei. Dawei and Tenasserim were cities in Thailand during Sukhothai period, which the Burmese had captured. However, the Governor of Tenasserim learned of the Siamese plans and sent an urgent message to the King of Pagu, Nanda Bayin, who ordered an army to oppose the Siamese.:139-140 Tenasserim resisted the siege for 15 days while the siege of Dawei lasted 20 days, before the Siamese were successful in capturing both cities. Both consented to be subject to Ayutthaya as in the past.:140 After Phraya Chakri captured Tenasserim city, he captured Mergui and the boats in the port, which included 3 foreign sloops and 150 other boats. He then sent Phraya Thep Archun by sea to Tavoy so as to assist Phraya Phra Khlang if the Burmese advanced that far. Phraya Chakri then marched with a force of 30,000 to Tavoy by land, leaving a garrison of 10,000 at Tenasserim under Phraya Sri Sainarong. Simultaneously, Phraya Phra Khlang sent 100 boats and 5,000 men under Phraya Phichai Songkhram and Phraya Ram Khamhaeng to assist Phraya Chakri.:141 The Burmese had sent 200 boats and 10,000 men under the command of Samin Ubkong and Samin Phataba. This Burmese flotilla was caught in the middle of the Siamese flotillas advancing from the north and south. Many Burmese boats were sunk, some beached their boats and fled, while the rest sailed away. Saming Ubakong was killed and 500 men were captured.:141-142\nHow many cities did the Siamese capture?",
    "allSubtask": "step1: Which cities were targeted by the Siamese troops during the initial campaigns led by Phraya Chakri and Phraya Phra Khlang?; step2: Were there additional cities captured by the Siamese troops apart from those mentioned in the initial campaign?; step3: Determine the final tally of cities successfully captured by the Siamese after all military actions described.",
    "nowSubtask": ["Which cities were targeted by the Siamese troops during the initial campaigns led by Phraya Chakri and Phraya Phra Khlang?","Were there additional cities captured by the Siamese troops apart from those mentioned in the initial campaign?","Determine the final tally of cities successfully captured by the Siamese after all military actions described."]
  },
  "86": {
    "steps": ["What is defined as the \"Azov campaign\" in the historical context?","Which countries actively participated in the Azov campaigns of 1695 and 1696?","Were there any alliances or coalitions involved in these campaigns?","Did any other countries provide indirect support, such as supplies or diplomatic backing, during the Azov campaigns?","How to determine if the involvement of a nation counts toward the total number of countries involved?"],
    "steps_dict": {
      "1": "What is defined as the \"Azov campaign\" in the historical context?",
      "2": "Which countries actively participated in the Azov campaigns of 1695 and 1696?",
      "3": "Were there any alliances or coalitions involved in these campaigns?",
      "4": "Did any other countries provide indirect support, such as supplies or diplomatic backing, during the Azov campaigns?",
      "5": "How to determine if the involvement of a nation counts toward the total number of countries involved?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 4","Step 3"],
      "3": ["Step 5"]
    },
    "int_edges": [[1,2],[2,4],[2,3],[4,5]],
    "problemText": "During the war, the Russian army organized the Crimean campaigns of 1687 and 1689, which both ended in Russian defeats. Despite these setbacks, Russia launched the Azov campaigns in 1695 and 1696, and after raising the siege in 1695 successfully occupied Azov in 1696.\nHow many countries were involved on teh Azov campaign?",
    "allSubtask": "step1: What is defined as the \"Azov campaign\" in the historical context?; step2: Which countries actively participated in the Azov campaigns of 1695 and 1696?; step3: Were there any alliances or coalitions involved in these campaigns?; step4: Did any other countries provide indirect support, such as supplies or diplomatic backing, during the Azov campaigns?; step5: How to determine if the involvement of a nation counts toward the total number of countries involved?",
    "nowSubtask": ["What is defined as the \"Azov campaign\" in the historical context?","Which countries actively participated in the Azov campaigns of 1695 and 1696?","Were there any alliances or coalitions involved in these campaigns?","Did any other countries provide indirect support, such as supplies or diplomatic backing, during the Azov campaigns?","How to determine if the involvement of a nation counts toward the total number of countries involved?"]
  },
  "87": {
    "steps": ["Did the passage mention any touchdowns in the first quarter?","How many touchdown passes specifically did Eli Manning throw that are mentioned in the first quarter?","Was there more than one touchdown sequence or play involving Eli Manning in the first quarter?"],
    "steps_dict": {
      "1": "Did the passage mention any touchdowns in the first quarter?",
      "2": "How many touchdown passes specifically did Eli Manning throw that are mentioned in the first quarter?",
      "3": "Was there more than one touchdown sequence or play involving Eli Manning in the first quarter?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 3"],
      "2": ["Step 2"]
    },
    "int_edges": [[1,3],[3,2]],
    "problemText": "at Lincoln Financial Field, Philadelphia|weather= 81&#160;&#176;F (Sunny)The Eagles Week 2 home opener began similar to the game against the Houston Texans, the Giants marched downfield on their first drive with a touchdown pass from Eli Manning to Amani Toomer. Similar to the Houston game, the Eagles would proceed to destroy the Giants offense with 8 sacks and amass over 400 yards on the Giants defense going a 24-point scoring run. However, in the 4th quarter, the Eagles completely collapsed on offense with a Brian Westbrook fumble, dropped passes and the inability to convert key 3rd downs to run out the clock. The defense failed to capitalize on a Plaxico Burress fumble in the redzone which turned into a touchdown for the Giants. The Eagles also began giving Eli Manning time to connect with his receivers downfield. Towards the end of regulation, Eagles defensive end Trent Cole was flagged for a personal foul which allowed Giants kicker Jay Feely to tie the game with a field goal. The game proceeded to overtime with the Eagles offensive woes continuing and the defense allowing the Giants to score a miraculous touchdown on 3rd a long from Manning to Burress. To add to the loss, the Eagles lost Jevon Kearse for the remainder of the season with a knee injury.\nHow many touchdown passes did Manning throw in the first quarter?",
    "allSubtask": "step1: Did the passage mention any touchdowns in the first quarter?; step2: How many touchdown passes specifically did Eli Manning throw that are mentioned in the first quarter?; step3: Was there more than one touchdown sequence or play involving Eli Manning in the first quarter?",
    "nowSubtask": ["Did the passage mention any touchdowns in the first quarter?","How many touchdown passes specifically did Eli Manning throw that are mentioned in the first quarter?","Was there more than one touchdown sequence or play involving Eli Manning in the first quarter?"]
  },
  "88": {
    "steps": ["How many touchdowns did Deangelo Williams score?","How many touchdowns did Cam Newton run for?","How many touchdowns did Cam Newton throw?","How many touchdowns did Drew Brees throw?","Add all the touchdowns from sub-questions 1 to 4 to find the total number of touchdowns scored in the game."],
    "steps_dict": {
      "1": "How many touchdowns did Deangelo Williams score?",
      "2": "How many touchdowns did Cam Newton run for?",
      "3": "How many touchdowns did Cam Newton throw?",
      "4": "How many touchdowns did Drew Brees throw?",
      "5": "Add all the touchdowns from sub-questions 1 to 4 to find the total number of touchdowns scored in the game."
    },
    "depths": {
      "0": ["Step 1","Step 3","Step 2","Step 4"],
      "1": ["Step 5"]
    },
    "int_edges": [[1,5],[2,5],[3,5],[4,5]],
    "problemText": "A NFC South rivalry rookie Cam Newton and Drew Brees go head to head for the first time. After an early lead Deangelo Williams starts a comeback with a 69-yard touchdown run. Former Carolina kicker John Kasay kicked two straight field goals, and then Cam Newton ran for a touchdown. Then, Cam Newton threw a touchdown pass to take the lead. Then, Drew Brees led the Saints down to the redzone and with less than a minute, threw a 6-yard touchdown pass to Pierre Thomas to win the game.\nHow many touchdowns were scored in the game?",
    "allSubtask": "step1: How many touchdowns did Deangelo Williams score?; step2: How many touchdowns did Cam Newton run for?; step3: How many touchdowns did Cam Newton throw?; step4: How many touchdowns did Drew Brees throw?; step5: Add all the touchdowns from sub-questions 1 to 4 to find the total number of touchdowns scored in the game.",
    "nowSubtask": ["How many touchdowns did Deangelo Williams score?","How many touchdowns did Cam Newton run for?","How many touchdowns did Cam Newton throw?","How many touchdowns did Drew Brees throw?","Add all the touchdowns from sub-questions 1 to 4 to find the total number of touchdowns scored in the game."]
  },
  "89": {
    "steps": ["What is the starting point in time for measuring the currency devaluation?","What is the endpoint in time by when the ZWD declined to 2,000,000 per USD?","How many months are there between the starting point and the endpoint?"],
    "steps_dict": {
      "1": "What is the starting point in time for measuring the currency devaluation?",
      "2": "What is the endpoint in time by when the ZWD declined to 2,000,000 per USD?",
      "3": "How many months are there between the starting point and the endpoint?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "On 1 April 2007, the parallel market was asking ZWD 30,000 for $1 USD. By year end, it was down to about ZWD 2,000,000. On 18 January 2008, the Reserve Bank of Zimbabwe began to issue higher denomination ZWD bearer cheques (a banknote with an expiry date), including $10 million bearer cheques - each of which was worth less than US $1.35 (70p Sterling; 0.90 Euro) on the parallel market at the time of first issue. On 4 April 2008 the Reserve Bank of Zimbabwe introduced new $25 million and $50 million bearer cheques. At the time of first issue they were worth US$0.70 & US$1.40 on the parallel market respectively.\nHow many months did it take for the ZWD to drop to 2,000,000 after April 2007?",
    "allSubtask": "step1: What is the starting point in time for measuring the currency devaluation?; step2: What is the endpoint in time by when the ZWD declined to 2,000,000 per USD?; step3: How many months are there between the starting point and the endpoint?",
    "nowSubtask": ["What is the starting point in time for measuring the currency devaluation?","What is the endpoint in time by when the ZWD declined to 2,000,000 per USD?","How many months are there between the starting point and the endpoint?"]
  },
  "90": {
    "steps": ["What was the final score for the Broncos?","What was the final score for the Raiders?","Calculate the difference in the scores between the two teams."],
    "steps_dict": {
      "1": "What was the final score for the Broncos?",
      "2": "What was the final score for the Raiders?",
      "3": "Calculate the difference in the scores between the two teams."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "Charles Woodson said days prior to Week 5 that he always wanted to intercept a pass from Peyton Manning as he had not accomplished this feat in his entire 18-year career. He lived up to his word, intercepting Manning twice, but it was Carr's interception and the resulting return for a touchdown by Chris Harris that was the difference in the game. The Raiders fell to the Broncos 16-10 as the team dropped to 2-3 going into their bye week.\nHow many more points did the Broncos score than the Raiders?",
    "allSubtask": "step1: What was the final score for the Broncos?; step2: What was the final score for the Raiders?; step3: Calculate the difference in the scores between the two teams.",
    "nowSubtask": ["What was the final score for the Broncos?","What was the final score for the Raiders?","Calculate the difference in the scores between the two teams."]
  },
  "91": {
    "steps": ["What data from the text specifies the number of times the teams have tied in their past games?","Confirm if the mentioned data specifically highlights the outcomes of ties between the two teams.","Extract the number of ties from the mentioned series record between the teams."],
    "steps_dict": {
      "1": "What data from the text specifies the number of times the teams have tied in their past games?",
      "2": "Confirm if the mentioned data specifically highlights the outcomes of ties between the two teams.",
      "3": "Extract the number of ties from the mentioned series record between the teams."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "In week three, Chicago hosted the 2-0 Pittsburgh Steelers, who trailed the all-time series 18-7-1 and had not defeated the Bears since 2005. WBBM-TV writer Jeff Joniak described the Bears as in \"clean-up mode\" after a poor performance in Tampa. The battle between the Bears' rushing attack and the Steelers' run defense featured the former averaging just 2.9 yards per carry (27th in the league) taking on a defense that allowed just 74 yards per game and 3.3 yards per carry. Joniak added Chicago's running game should try to make progress on early downs to allow Mike Glennon to succeed against Pittsburgh. Defensively, Joniak wrote the Bears had \"their hands full\" as Steelers quarterback Ben Roethlisberger was aided by receivers Antonio Brown and Martavis Bryant, running back Le'Veon Bell, and tight end Jesse James. In spite of Pittsburgh's success in contrast with Chicago's struggles, a common belief was that the Steelers would often \"play down to their competition,\" one that was spurned in the wake of Glennon's 2014 Buccaneers upsetting the Steelers 27-24. The first two drives of the game ended with punts, but on the Bears' first punt of the game, Steelers returner Eli Rogers muffed the ball and Sherrick McManis recovered. Jordan Howard would score a three-yard touchdown run on the drive. On the Steelers' next drive, Roethlisberger was sacked by Bryce Callahan and fumbled, with Akiem Hicks recovering. The takeaway failed to result in points, however, as Connor Barth missed a 47-yard field goal. In the second quarter, Roethlisberger threw a seven-yard touchdown pass to Brown, which the Bears responded via Glennon's two-yard touchdown pass to Adam Shaheen. On the final play of the first half, Chris Boswell's 35-yard field goal was blocked by McManis into Marcus Cooper's hands. Cooper raced down the field before suddenly slowing down before he reached the end zone, which allowed Pittsburgh's Vance McDonald to knock the ball away at the one-yard line. The ball was then batted out of the end zone, which led to a penalty against the Steelers and an untimed play for the Bears. A false start penalty on Charles Leno Jr. prompted the Bears to instead kick a 24-yard field goal. In the second half, the Bears suffered their first turnover of the game when Howard was stripped by Ryan Shazier; the Steelers took advantage to score on Bell's one-yard touchdown run. A second giveaway occurred when Glennon's pass for Zach Miller was intercepted by J. J. Wilcox, which enabled the Steelers to tie the game on Boswell's 32-yard field goal. The game remained scoreless through the rest of the half, resulting in overtime. After winning the coin toss to start overtime with the ball, the Bears quickly scored on the second play of the series; Tarik Cohen broke through for a 73-yard touchdown run, but was ruled to have stepped out of bounds at the Steelers' 37-yard line. Two plays later, Howard scored the game-winning touchdown on a 19-yard run. In claiming their first victory of the season, the Bears' running backs provided a solid performance, recording a combined 220 yards on the ground - 200 yards more than in week two. The defense also shone, forcing two turnovers after having just one in the first two games.\nHow many times had these tow teams tied?",
    "allSubtask": "step1: What data from the text specifies the number of times the teams have tied in their past games?; step2: Confirm if the mentioned data specifically highlights the outcomes of ties between the two teams.; step3: Extract the number of ties from the mentioned series record between the teams.",
    "nowSubtask": ["What data from the text specifies the number of times the teams have tied in their past games?","Confirm if the mentioned data specifically highlights the outcomes of ties between the two teams.","Extract the number of ties from the mentioned series record between the teams."]
  },
  "92": {
    "steps": ["What year did Romania first enter World War I?","What year did Romania re-enter World War I?","How do you calculate the number of years between two given years?"],
    "steps_dict": {
      "1": "What year did Romania first enter World War I?",
      "2": "What year did Romania re-enter World War I?",
      "3": "How do you calculate the number of years between two given years?"
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "In 1916 Romania entered World War I on the side of the Allies. In doing so, Romania's goal was to unite all the territories with a Romanian national majority into one state. In the Treaty of Bucharest , terms for Romania's acquisition of territories within Austria-Hungary were stipulated. In 1918, after the October Revolution, the Bolsheviks signed a separate peace with the Central Powers in the Treaty of Brest-Litovsk. Romania was alone on the Eastern Front, a situation that far surpassed its military capabilities. Therefore, on 7 May 1918, Romania sued for peace. The prime minister of Romania, Alexandru Marghiloman, signed the Treaty of Bucharest  with the Central Powers. However, this treaty was never signed by King Ferdinand of Romania. At the end of 1918 Romania's situation was dire. She was suffering from the consequences of punitive war reparations. Dobruja was under Bulgarian occupation. The German army under the command of Field Marshal August von Mackensen was retreating through Romania. The bulk of the Romanian army was demobilized, leaving only four full-strength divisions. A further eight divisions were left in a reserve status. The four battle-ready divisions were used to keep order and protect Basarabia from possible hostile actions of the Soviet Union. On 10 November 1918, taking advantage of the Central Powers' precarious situation, Romania re-entered the war on the side of the Allied forces, with similar objectives to those of 1916. King Ferdinand called for the mobilization of the Romanian army and ordered it to attack by crossing the Carpathian Mountains into Transylvania. The end of World War I that soon followed did not bring an end to  fighting for the Romanian army. Its action continued into 1918 and 1919 in the Hungarian-Romanian war.\nHow many years was it from the first time Romania entered World War I, to the time they re-entered the war?",
    "allSubtask": "step1: What year did Romania first enter World War I?; step2: What year did Romania re-enter World War I?; step3: How do you calculate the number of years between two given years?",
    "nowSubtask": ["What year did Romania first enter World War I?","What year did Romania re-enter World War I?","How do you calculate the number of years between two given years?"]
  },
  "93": {
    "steps": ["What is the date of the first treaty between Venice and Vladislaus II?","What is the date of the second treaty between Venice and Vladislaus II?","How do you calculate the number of years between two given dates?"],
    "steps_dict": {
      "1": "What is the date of the first treaty between Venice and Vladislaus II?",
      "2": "What is the date of the second treaty between Venice and Vladislaus II?",
      "3": "How do you calculate the number of years between two given dates?"
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "The Ottoman incursions in Dalmatia escalated to the point where Venice was forced to sign a treaty with Vladislaus II of Hungary and Pope Alexander VI by which they pledged 140,000 ducats a year for the Kingdom of Hungary to actively defend its southern Croatian territories, which aided the defence of Venetian Dalmatia, signed after long negotiations on 13 May 1501. In 1501 Feriz Beg captured Durazzo in Venetian Albania. By the end of 1502, Venice and the Ottoman Empire agreed on an armistice. On 31 January 1503, Venice signed another treaty with Vladislaus II, having already paid 124,000 ducats through the previous treaty, to pay 30,000 ducats a year for the same purpose. In 1503, Turkish cavalry raids reached Venetian territory in Northern Italy, and Venice was forced to recognize the Ottoman gains, ending the war. The economy of the Venetian cities in Dalmatia was severely impacted by the Turkish occupation of the hinterland during this war.\nHow many years passed between the two treaties between Venice and Vladislaus II?",
    "allSubtask": "step1: What is the date of the first treaty between Venice and Vladislaus II?; step2: What is the date of the second treaty between Venice and Vladislaus II?; step3: How do you calculate the number of years between two given dates?",
    "nowSubtask": ["What is the date of the first treaty between Venice and Vladislaus II?","What is the date of the second treaty between Venice and Vladislaus II?","How do you calculate the number of years between two given dates?"]
  },
  "94": {
    "steps": ["How many ethnic Poles were killed by the Nazi regime?","How many people were deemed \"unworthy of life\" and killed in the extermination program?","How many Soviet POWs died in Nazi camps?","Are there any other groups or minorities that were exterminated by the Nazis which need to be counted in the total?","Add the numbers from each group to get the total number of exterminations conducted by the Nazis."],
    "steps_dict": {
      "1": "How many ethnic Poles were killed by the Nazi regime?",
      "2": "How many people were deemed \"unworthy of life\" and killed in the extermination program?",
      "3": "How many Soviet POWs died in Nazi camps?",
      "4": "Are there any other groups or minorities that were exterminated by the Nazis which need to be counted in the total?",
      "5": "Add the numbers from each group to get the total number of exterminations conducted by the Nazis."
    },
    "depths": {
      "0": ["Step 1","Step 3","Step 2","Step 4"],
      "1": ["Step 5"]
    },
    "int_edges": [[1,5],[2,5],[3,5],[4,5]],
    "problemText": "The German government led by Adolf Hitler and the Nazi Party was responsible for the Holocaust , as well as for killing of 2.7 million ethnic Poles, and 4 million others who were deemed \"unworthy of life\"  as part of a programme of deliberate extermination. Soviet POWs were kept in especially unbearable condition, and, although their extermination was not an official goal, 3.6 million of Soviet POWs out of 5.7 died in Nazi camps during the war. In addition to concentration camps, death camps were created in Nazi Germany to exterminate people at an industrial scale.Nazi Germany extensively used forced labourers. About 12 million  Europeans from German occupied countries were used as slave work force in German agriculture and war economy. Soviet Gulag became de facto a system of deadly camps during 1942-43, when wartime privation and hunger caused numerous deaths of inmates, including foreign citizens of Poland and other countries occupied in 1939-40 by the USSR, as well as of the Axis POWs.By the end of the war, most Soviet POWs liberated from Nazi camps and many repatriated civilians were detained in special filtration camps where they were subjected to NKVD check, and significant part of them was sent to Gulag as real or perceived Nazi collaborators.\nHow many people did the Nazis exterminate in total?",
    "allSubtask": "step1: How many ethnic Poles were killed by the Nazi regime?; step2: How many people were deemed \"unworthy of life\" and killed in the extermination program?; step3: How many Soviet POWs died in Nazi camps?; step4: Are there any other groups or minorities that were exterminated by the Nazis which need to be counted in the total?; step5: Add the numbers from each group to get the total number of exterminations conducted by the Nazis.",
    "nowSubtask": ["How many ethnic Poles were killed by the Nazi regime?","How many people were deemed \"unworthy of life\" and killed in the extermination program?","How many Soviet POWs died in Nazi camps?","Are there any other groups or minorities that were exterminated by the Nazis which need to be counted in the total?","Add the numbers from each group to get the total number of exterminations conducted by the Nazis."]
  },
  "95": {
    "steps": ["What is the historical context of the Raiders' games played in Baltimore before this specific game?","Was there any statement about previous outcomes between the Raiders and Ravens in Baltimore in the passage provided?","What was the outcome of the game described in the passage?","Based on the information given, how can we determine the total number of times the Raiders have won in Baltimore?"],
    "steps_dict": {
      "1": "What is the historical context of the Raiders' games played in Baltimore before this specific game?",
      "2": "Was there any statement about previous outcomes between the Raiders and Ravens in Baltimore in the passage provided?",
      "3": "What was the outcome of the game described in the passage?",
      "4": "Based on the information given, how can we determine the total number of times the Raiders have won in Baltimore?"
    },
    "depths": {
      "0": ["Step 2","Step 1","Step 3"],
      "1": ["Step 4"]
    },
    "int_edges": [[1,4],[2,4],[3,4]],
    "problemText": "The Ravens stayed at home for a matchup against the Raiders who never won at Baltimore. Unfortunately the Ravens could not hold on to the lead after Derek Carr found Michael Crabtree in the end zone near the end of the game. Baltimore began driving down the field but the drive stalled allowing the Raiders to win at Baltimore for the first time in history dropping the Ravens 3-1. With the Steelers win, the Ravens dropped to second place in the AFC North\nHow many times have the raiders won in Baltimore?",
    "allSubtask": "step1: What is the historical context of the Raiders' games played in Baltimore before this specific game?; step2: Was there any statement about previous outcomes between the Raiders and Ravens in Baltimore in the passage provided?; step3: What was the outcome of the game described in the passage?; step4: Based on the information given, how can we determine the total number of times the Raiders have won in Baltimore?",
    "nowSubtask": ["What is the historical context of the Raiders' games played in Baltimore before this specific game?","Was there any statement about previous outcomes between the Raiders and Ravens in Baltimore in the passage provided?","What was the outcome of the game described in the passage?","Based on the information given, how can we determine the total number of times the Raiders have won in Baltimore?"]
  },
  "96": {
    "steps": ["What specific events or actions from the passage led to resentment among some of the population?","Are there any indirect indications or consequences mentioned that contributed to the resentment?","Determine if distinct sources of resentment mentioned can be counted as separate issues or if they are related aspects of the same broader issue.","Count each distinct cause of resentment identified from the analysis."],
    "steps_dict": {
      "1": "What specific events or actions from the passage led to resentment among some of the population?",
      "2": "Are there any indirect indications or consequences mentioned that contributed to the resentment?",
      "3": "Determine if distinct sources of resentment mentioned can be counted as separate issues or if they are related aspects of the same broader issue.",
      "4": "Count each distinct cause of resentment identified from the analysis."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"],
      "3": ["Step 4"]
    },
    "int_edges": [[1,2],[2,3],[3,4]],
    "problemText": "The English Civil War had left resentment among some of the population about the monarchy and the penalties which had been imposed on the supporters of the Commonwealth. The South West of England contained several towns where opposition remained strong. Fears of a potential Catholic monarch persisted, intensified by the failure of Charles II and his wife to produce any children. A defrocked Anglican clergyman, Titus Oates, spoke of a \"Popish Plot\" to kill Charles and to put the Duke of York on the throne. The Earl of Shaftesbury, a former government minister and a leading opponent of Catholicism, attempted to have James excluded from the line of succession. Some members of Parliament even proposed that the crown go to Charles's illegitimate son, James Scott, who became the Duke of Monmouth. In 1679, with the Exclusion Bill - which would exclude the King's brother and heir presumptive, James, Duke of York, from the line of succession - in danger of passing, Charles II dissolved Parliament. Two further Parliaments were elected in 1680 and 1681, but were dissolved for the same reason. After the Rye House Plot of 1683, an attempt to assassinate both Charles and James, Monmouth went into self-imposed exile in the Netherlands, and gathered supporters in The Hague. Monmouth was a Protestant and had toured the South West of England in 1680, where he had been greeted amicably by crowds in towns such as Chard and Taunton. So long as Charles II remained on the throne, Monmouth was content to live a life of pleasure in Holland, while still hoping to accede peaceably to the throne. The accession of James II and coronation at Westminster Abbey on 23 April 1685 put an end to these hopes.\nHow many things left resentment among some of the population?",
    "allSubtask": "step1: What specific events or actions from the passage led to resentment among some of the population?; step2: Are there any indirect indications or consequences mentioned that contributed to the resentment?; step3: Determine if distinct sources of resentment mentioned can be counted as separate issues or if they are related aspects of the same broader issue.; step4: Count each distinct cause of resentment identified from the analysis.",
    "nowSubtask": ["What specific events or actions from the passage led to resentment among some of the population?","Are there any indirect indications or consequences mentioned that contributed to the resentment?","Determine if distinct sources of resentment mentioned can be counted as separate issues or if they are related aspects of the same broader issue.","Count each distinct cause of resentment identified from the analysis."]
  },
  "97": {
    "steps": ["What is the earliest year mentioned in the passage?","What is the latest year mentioned in the passage?","Calculate the duration by subtracting the earliest year from the latest year."],
    "steps_dict": {
      "1": "What is the earliest year mentioned in the passage?",
      "2": "What is the latest year mentioned in the passage?",
      "3": "Calculate the duration by subtracting the earliest year from the latest year."
    },
    "depths": {
      "0": ["Step 2","Step 1"],
      "1": ["Step 3"]
    },
    "int_edges": [[1,3],[2,3]],
    "problemText": "During the 15th century the Ayutthaya Kingdom fought frequent wars against the Lan Na Kingdom in the north, the Khmer Empire of Angkor Wat to the east and the Malay States to the south. King Intharacha of Ayutthaya forced the former Kingdom of Sukhothai to recognize his authority in 1410. The king then invaded Lan Na in 1411, seizing Chiang Rai but failing to capture Chiang Mai and Phayao. In the latter battle the two sides may have used early cannons. In 1424 King Borommarachathirat II ascended the throne of Ayutthaya. After a seven-month siege, he captured Angkor by treachery in 1431. The Khmer retook the city in 1432 and subsequently transferred their capital to Phnom Penh. The sixth son of the Lan Na king Sam Fang Kaen, Thao Lok, ascended the throne in the aftermath of coup against his father in 1441. Thao Lok was crowned as king Tilokaraj of Lan na, later banishing his father Sam Fang Kaen to Muong Shan in the Shan States. General Phya Samdekyoki, who had previously played an important role in bringing Tilokaraj to power created a plot in order to assume power himself, the plot was however discovered and Samdekyoki was exiled to Chiang Saen.\nHow many years did these events span for?",
    "allSubtask": "step1: What is the earliest year mentioned in the passage?; step2: What is the latest year mentioned in the passage?; step3: Calculate the duration by subtracting the earliest year from the latest year.",
    "nowSubtask": ["What is the earliest year mentioned in the passage?","What is the latest year mentioned in the passage?","Calculate the duration by subtracting the earliest year from the latest year."]
  },
  "98": {
    "steps": ["Identify all instances of touchdown passes described in the passage.","Record the yardage for each touchdown pass.","Compare the yardage of each touchdown pass to determine the longest."],
    "steps_dict": {
      "1": "Identify all instances of touchdown passes described in the passage.",
      "2": "Record the yardage for each touchdown pass.",
      "3": "Compare the yardage of each touchdown pass to determine the longest."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "In a game that was hyped by wide receiver Terrell Owens' return to Philadelphia as a Cowboy (FOX promoted it as being the game of the year), the Eagles went up against their long-time rival at home, as another chapter was written in the famed Dallas Cowboys-Philadelphia Eagles rivalry.  In the first quarter, the Eagles drew first blood as running back Brian Westbrook got a 5-yard TD run (which was set up on a fumbled punt attempt), while kicker David Akers kicked a 27-yard field goal after a quarterback Drew Bledsoe fumble.  The Cowboys would score in the period, as running back Marion Barber got a 2-yard TD run.  In the second quarter, Cowboys OLB Greg Ellis sacked QB Donovan McNabb, causing him to fumble, which was picked up by OLB DeMarcus Ware who returned it 69 yards for a touchdown. McNabb would make up for his fumble by getting a 1-yard touchdown on a QB sneak after a long completion to L.J. Smith.  However, the Eagles trailed at halftime, as Bledsoe ran 7 yards for a score. In the third quarter, Philadelphia would get back on top, as McNabb threw an 87-yard bomb to rookie wide receiver Hank Baskett.  In the fourth quarter, the Cowboys evened the score with a Mike Vanderjagt 39-yard field goal.  The Eagles responded with a 40-yard McNabb to Reggie Brown flea-flicker touchdown. With Dallas threatening to tie the score late in the game, cornerback Lito Sheppard, who already had an interception, returned a Bledsoe pass 102 yards for a touchdown. With their 38-24 victory, Philadelphia managed to take the lead in the NFC East. McNabb finished with 354 yards, two passing TDs and one rushing TD, while Owens was a nonfactor with only 3 catches for 45 yards and several drops. Stats The win ended the Eagles seven-game losing streak to their division rivals.\nHow many yards was the longest touchdown pass?",
    "allSubtask": "step1: Identify all instances of touchdown passes described in the passage.; step2: Record the yardage for each touchdown pass.; step3: Compare the yardage of each touchdown pass to determine the longest.",
    "nowSubtask": ["Identify all instances of touchdown passes described in the passage.","Record the yardage for each touchdown pass.","Compare the yardage of each touchdown pass to determine the longest."]
  },
  "99": {
    "steps": ["Identify all instances in the passage where Rob Bironas, the kicker for Tennessee, is mentioned as performing a kick.","Differentiate between the types of kicks mentioned (i.e., determine which are field goals and which might be extra points or other types of kicks).","Count the number of times field goals specifically are mentioned in relation to Rob Bironas."],
    "steps_dict": {
      "1": "Identify all instances in the passage where Rob Bironas, the kicker for Tennessee, is mentioned as performing a kick.",
      "2": "Differentiate between the types of kicks mentioned (i.e., determine which are field goals and which might be extra points or other types of kicks).",
      "3": "Count the number of times field goals specifically are mentioned in relation to Rob Bironas."
    },
    "depths": {
      "0": ["Step 1"],
      "1": ["Step 2"],
      "2": ["Step 3"]
    },
    "int_edges": [[1,2],[2,3]],
    "problemText": "Hoping to rebound from their road loss to the Giants, the Redskins returned home for a Week 6 fight with the Tennessee Titans.  In the first quarter, Washington trailed early as Tennessee kicker Rob Bironas kicked a 32-yard field goal.  RB Clinton Portis got a 10-yard TD run to help the Redskins regain the lead.  In the second quarter, the Skins increased their lead with QB Mark Brunell completing a 24-yard TD pass to TE Chris Cooley.  However, the Titans regained the lead with Bironas nailing a 26-yard field goal and QB Vince Young completing a 3-yard TD pass to WR Brandon Jones.  In the third quarter, the Redskins continued to dig themselves a huge hole, as RB Travis Henry got a 2-yard TD run.  Afterwards, the Titans got a safety on a blocked punt that rolled out the back of the end zone.  In the fourth quarter, Washington tried valiantly to fight back, as Portis got a 4-yard TD run, but in the end, Bironas got a 30-yard field goal for Tennessee and a late interception by Free Safety Lamont Thompson killed any chance of a comeback.  With the loss, the Redskins fell to 2-4. Stats\nHow many field goals did Bironas kick?",
    "allSubtask": "step1: Identify all instances in the passage where Rob Bironas, the kicker for Tennessee, is mentioned as performing a kick.; step2: Differentiate between the types of kicks mentioned (i.e., determine which are field goals and which might be extra points or other types of kicks).; step3: Count the number of times field goals specifically are mentioned in relation to Rob Bironas.",
    "nowSubtask": ["Identify all instances in the passage where Rob Bironas, the kicker for Tennessee, is mentioned as performing a kick.","Differentiate between the types of kicks mentioned (i.e., determine which are field goals and which might be extra points or other types of kicks).","Count the number of times field goals specifically are mentioned in relation to Rob Bironas."]
  }
}